{
    "title":"costume_store",
    "position":[
       0.42,
       0.71
    ],
    "header":"Costume Store",
    "subheader":"At the side of the market square is this small wooden stall, with an eclectic collection of hats, clothing, costumes and other random goods.",
    "events":[
       {
          "id":"ritter_festival_m",
          "title":"Spend the Festival With Ritter",
          "subtitle":"Ritter is lounging on the edge of the costume stall, drinking from a bottle. He doesn't look particularly festive.",
          "type":"random",
          "requirements":[
             {
                "parameter":"festival_time",
                "value":2,
                "comparison":"greater"
             }
          ],
          "icon":"rittericon",
          "results":{
             "success":{
                "text":"You approach the cat magician carefully. His legs swing idly on the side of the stall, and he shoots you a bored glance. \"Shop's closed. Festival, or whatever\", he mutters.</p>You ask him whether he would like to walk out through the festival with you then if he's closing up anyway. He glares at you, then chuckles. \"Alright, fair, I guess you logic-trapped me with that one. Come on then, there might be free booze.\"</p>He jumps down from his stall and walks off towards the food stands, without waiting to see if you join him. You tag along behind quickly.</p>With the festival in full swing, the market square and the fountain plaza are decked out in colours and lights. Red lanterns are hung from the eaves of buildings, and candles in red glass holders have been placed all around the fountain edge. Drapes of red cloth are hung across rooftops, turning all of the streets into makeshift tents.</p>Somehow, between walking from his stall to the fountain, Ritter has already found two bottles of wine. He takes a drink from one, then lifts out his hand with the other, but then drinks from that too instead of giving it to you.</p>\"They really take this stuff seriously, don't they? I don't really get it, I think. If anyone asks, this is a costume, and I'm really a hedgehog\", he says. You sit down beside him at the edge of the fountain and watch the crowds walk by. There are a lot of costumes this year. A bear painted with patchwork dye to make him look stitched-together, a fox with a long cloak and fake fangs, and countless people in red capes and masks. \"It's still weird to me, seeing so many people revelling. We never had anything like this at the tower. Just lessons, tests, and boring old men\", Ritter says.</p>His bored glance suddenly becomes more focused, and you follow his line of sight across the plaza to see another passer-by in a red cloak. The person turns to take a treat from a table, and you realise it is Saberhagen, wearing a costume. There is someone else at the table too, and their hands touch as they both reach for the same cake. Saberhagen steps back bashfully. \"Ah, you can have it! There are plenty of other things I'd love to try here!\", He chirps. The tall, dark-robed figure pulls back his hood to reveal a powerful, snarling tiger's head. Saberhagen steps back slightly. \"I would never eat something tainted by your touch, tower abomination\", the tiger growls. He then stalks away, leaving Saberhagen nervously clutching his collar. You hear a grinding, squeaking sound, and you turn to see that Ritter's claws are out, and they are leaving white scratch grooves in the glass of the bottle he is holding. His eyes narrow. \"You know, suddenly I am feeling the festive spirit after all. What is the tradition again? If you don't take a treat, you get a trick?\", he says.</p>He stands and begins quickly weaving his way through the crowd. You struggle to keep up with him at first, but soon you start to leave the crowded plaza and move towards the alleyways. Ritter moves like a shadow, following the hooded tiger from a distance. As you begin to close in, the tiger suddenly whips around, revealing a long blade in his hand. \"A tower beast is no match for a natural warrior, an abomination. I do not fear you\", the tiger hisses. Ritter looks unimpressed. \"Perhaps you should\", he says. The tiger lurches and gasps, his knee sinking down into the ground and his blade falling and sliding along the floor. The shadow beneath his feet is darkening and transforming into a thick, deep puddle, and he struggles to pull free of it.</p>Ritter's hands begin to glow with a green, sickly light. The new illumination scatters the shadows away, leaving the tiger sprawled on the floor as he now struggles and gasps from a ring of green light around his neck, squeezing and choking him. \"I may not have the privilege of 'natural' education, but a tower upbringing has a few perks\", Ritter says. \"For example, a large library of forbidden magic. Have you heard of the dracolich, Kalventis? He was laid to rest near here, actually. His greatest, final spell was locked away in our deepest archives. The spell...\"</p>Ritter raises his hand, and slowly starts to clench his fist. The light around the tiger's neck solidifies, becoming a green metal collar. Shackles appear around his wrists and ankles, and his eyes begin to glow as he thrashes and struggles.</p>\"...of Mastery\", Ritter finishes. He clenches his fist completely, and you feel a terrible, crushing and breaking sensation from the air around you. The tiger goes stiff, his eyes completely white, and falls limply onto the floor.</p>The eldritch light fades. Slowly, the tiger rises to his knees and gazes at Ritter with meek, worshipful subservience. \"How may I serve you, Master?\", he asks.</p>Ritter grins widely, his eyes large and excited. He sits down on one of the wooden crates stacked against the side of the alleyway and tugs off his boots with a yank on the sole. Ritter wiggles his soft furry toes and glares imperiously at the tiger. \"Come here, slave, and worship my feet\", he commands. The once-proud tiger crawls over on all fours and takes Ritter's paw in one of his massive hands. He raises it to his powerful muzzle, and slowly licks his long tongue across the soft sole, before lapping and kissing at his toes. \"Thank you, Master! You are so glorious and perfect. The ultimate feline. I am honoured to have the chance to kiss and serve and obey you\", he purrs.</p>Ritter reaches down and pulls the tiger up by tugging on his jerkin. The massive cat presses adoringly against Ritter's chest, as he pulls on the tiger's jerkin and tugs it up over his head. The tiger's torso is massive and muscular and crisscrossed with battle scars. \"Strip, slave. You will no longer wear clothes. You are nothing but an inferior beast\", Ritter says with a wicked smile. The tiger nods eagerly and pulls on his belt buckle before shoving down his pants. He pulls off his boots and tosses them aside with the rest of his clothes, leaving his muscular body naked without a hint of shame. Ritter strokes his hand along the tiger's side as he rubs and feels his firm muscles. He then wraps his hand around the tiger's gigantic, furry balls. The tiger grunts, his cock twitching and bouncing slightly, as Ritter starts to grip and squeeze. The tiger's expression slowly becomes pained, and he begins to whimper, his fingers twitching. Despite that, he makes no move to resist or fight back.</p>\"Fascinating. It works better than I dared to imagine. No wonder this spell was forbidden. Still, I have no particular interest in having to feed an ungrateful tiger\", Ritter says. He slaps the larger cat on the chest and points to you. \"This adventurer is your master now. You will obey and worship them as if they were me\", he commands.</p>Ritter pushes the tiger over to you and looks at you with interest. \"You felt that, didn't you? I saw you react when I activated the spell. There are not many people sensitive enough to detect mana flow in that way. You know, I think there may be something interesting in this town after all\", he says. He walks away, and leaves you with the tiger rubbing and nuzzling against your leg like an eager pet kitten.",
                "outcomes":[
                   {
                      "parameter":"festival_time",
                      "quantity":0,
                      "change":"set"
                   },
                   {
                      "parameter":"slavetiger",
                      "quantity":1,
                      "change":"set"
                   }
                ]
             }
          }
       },
       {
          "id":"rittertraining",
          "title":"Ritter's Remedial Training",
          "subtitle":"There's a sign up at the side of Ritter's stall, listing his prices. Everything with a red label is two coins, and blue is three coins. Yellow is two for three...or is it, uh, three for two? Your head aches as you try to keep the numbers in your slow, dimwitted head. He gives you a withering look.</p>\"What does my brother see in you?\", he says. \"I really can't allow him to hang around with someone this stupid. You should let me fix you up.\"",
          "type":"random",
          "requirements":[
             {
                "parameter":"saberhagen_connection",
                "value":0,
                "comparison":"greater"
             },
             {
                "parameter":"intelligence",
                "value":2,
                "comparison":"less"
             }
          ],
          "icon":"rittericon",
          "results":{
             "thing":{
                "html":"data/active/RittersTraining.html",
                "outcomes":[
                   
                ]
             }
          }
       },
       {
          "id":"staypup",
          "title":"Being Saberhagen's Pup",
          "subtitle":"You love your Master. He's a cuddly, loving big cat, and he smells like nice treats and flour!",
          "trapped":true,
          "type":"random",
          "requirements":[
             {
                "parameter":"trapped",
                "value":14,
                "comparison":"equal"
             }
          ],
          "icon":"inanimatefetish",
          "results":{
             "pumpkin_1":{
                "text":"Master is working in his tent today. He puts the nice-smelling things in the hot box, and then later they come out as other nice-smelling things, but hot! You sniff at his legs and trail around behind him while he works, and sometimes he reaches down to rub and pet your head.</p>You like when you get pets. It makes your tail wag a lot.</p></p>When he puts the hot things out near the front of the tent, some other people start showing up, and taking the hot things. You bark at them at first, but Master pets you and doesn't seem to mind, so maybe it's ok?</p>He puts you at the front of the tent, so you stand guard. Some of the people who come give Master things and get a hot thing, so maybe it's like fetch. Some of them make happy noises when they see you, and give you pets! Maybe it's all good after all.</p>Other Master is here too today. You don't like Other Master quite so much. He looks just like Master, but he smells different, and he's kind of mean. He doesn't give you pets like Master does.</p></p>When he sees you looking at him, he sits down on one of the tables. He reaches down and pulls off one of his boots, and then stretches his paw out. You walk over on all fours and sniff at his paw. It smells like the street outside, and a little bit like the woods. Other Master has been travelling.</p>Other Master's smell makes you feel funny. You know you're not a very smart dog, but now you feel even slower and dumber. You wag your tail at him, forgetting that you don't like him much. He reaches into his pocket, and shows you a dog treat!</p>You bark and wag, excited to get the treat. Then he throws it, and you go dashing out to the side of the tent to look for it. It's not there?</p></p>You look back at Other Master, and see he's still holding the treat! He puts it back in his pocket, and you sulk.</p>Other Master is a jerk!",
                "outcomes":[
                   
                ]
             },
             "pumpkin_2":{
                "text":"Master is working hard as usual today. He's got his big bowl of white stuff, and is mixing it to get ready to make more of the hot things that smell tasty.</p>You want attention! You walk around near his legs, nuzzling and sniffing him. He steps back, and just barely misses your tail. He stumbles, and the bowl in his arms drops.</p>You are suddenly splattered with cold goop. It smells like biscuits!</p>You wag your tail and lick at yourself. Master sighs, and picks you up and takes you to the back of the tent.</p></p>You sit patiently as he places you in a tub, until you see him coming back with a bucket of water. Awww not a bath! You bark, but he ignores you. He pours the water in, and starts rubbing and scrubbing your fur. Baths aren't all bad, you suppose.</p>Just as you're relaxing, Master's fingers touch against the tag on your collar. He looks at it curiously. Then he makes an upset noise. You whine, worried that you did something bad, but he pets your head and reassures you.</p>He places both his thumbs on your collar tag, and starts mumbling. He keeps doing that for a while, long enough that you start getting fidgety. Then, suddenly, the tag gets really hot, and flashes bright!</p>You blink, confused. Master looks a whole lot smaller somehow. And this tub is a lot more cramped!</p></p>You look down at yourself, and see that your fur is missing. Your skin is all smooth now, and your muzzle has gone flat?</p>\"Are you alright? I'm going to have a very stern talk with my brother about this. He shouldn't be changing people into things without permission\", Master says. You cock your head to the side, and then lean forward and lick his face.</p>Master blushes, and wiggles. \"Oh goodness, you've been my pet all this time. I gave you baths! Um, I hope this doesn't make things awkward...\", he says. You jump forward, clambering out of the bath and wrapping your arms around him, as you nuzzle and sniff at his furry neck.</p></p>He yelps, and falls onto his back. Then, he gently reaches out and strokes your head for a while. After a few moments, your brain gradually starts to speed up, and your memories trickle in bit by bit. You look down at Saberhagen, who's face is totally red with a hot blush, and then stand up.</p>You apologise to him, and he assures you it's not a problem. You still really feel like you want to lick him, though, and you have a phantom sensation of a tail wagging behind you whenever you see him...",
                "freeTrap":true,
                "outcomes":[
                   
                ]
             }
          }
       },
       {
          "id":"get_worn",
          "title":"Getting Worn",
          "subtitle":"Your hollow, fabric body is starting to feel more and more empty, and you find yourself looking at the organic people around you with something like a mix of hunger and arousal.",
          "type":"random",
          "requirements":[
             {
                "parameter":"species",
                "value":7,
                "comparison":"equal"
             }
          ],
          "icon":"vorefetish",
          "results":{
             "success":{
                "text":"You can't resist it anymore. You want someone to wear you! You would be panting and drooling, if you needed to breathe or if your soft fuzzy mouth even formed saliva. You look around to make sure no one will see you, and then you lift off your head and carefully place it on the stall, with the other hats and masks. It's a little disorienting looking at your own headless body, and you hold on to the stand carefully as you lift yourself up and lie down, acting like just more merchandise.</p>You don't have to wait long before someone notices you. A worker coming back from construction glances over and sees your soft, handsome blue fur. He walks over, and you observe him silently as he gets closer. He's tall and muscular, with hairy, thick arms and a powerful barrel chest. He strokes his hand down your soft furry blue chest, and it takes all your willpower to not twitch or move from the intense sensitivity of feeling his rough, strong fingers sliding through your fur.</p>He reaches down and starts to pull off his thick and heavy leather boots, revealing his large feet, covered in black socks. He's looking away, with his large rear pointed at you, and you lick your lips. You want him to wear you NOW! He pulls off his socks and you wonder how his big hairy feet will feel inside your paws. He pulls his vest up over his head and drops it aside, and you can see a little sweat glinting as it drips down his hard, chiselled muscles. He pushes his pants down, and then slowly tugs down his underwear. His cock is thick and hefty, and his balls are large and covered in hair. He seems to have no problems with stripping in public.</p>Finally, the time has come. He picks you up, and pulls down your zipper. It's ecstacy to feel your cold metal zip slide slowly down and open you up, revealing your sensitive smooth inner lining to the air. You feel yourself go limp and weak in his grip, until he pushes his foot forward and slides it down inside you. You can feel every inch of his strong leg as it slides down your lining. The feeling is orgasmic. His toes are sliding down into you, and you feel his foot fill your thick, soft plush paw. Then the other leg follows, and you feel his cock and balls push into your inner pouch. You would be moaning and gasping and shivering with pleasure if you could, but you seem unable to do anything right now. You are totally under his power.</p>He pushes his arms down into your sleeves, and you feel your fingers flex and wiggle as he fills them like gloves. He gropes and squeezes your crotch, feeling his own cock slide into your inner pouch where he strokes and adjusts it. He closes the zipper, and you feel your body wrap around him, squeeze all around his warm, musky, powerful form. Finally, he reaches forward and takes your head. You feel your own squishy fingers over your cheeks, as he lifts you up and pulls you down over his head. You can taste him in your mouth, and feel him looking through your eyes. You lift your hands and stroke over your belly, feeling where you are firmer and fuller from him inside you. It feels so damn good!</p>You feel him twitch and struggle with surprise as you move, but his movements and struggles only make you feel even better. Every touch of his naked body against your lining is such a thrill. You no longer feel so hollow and empty, now that you have a passenger.</p>You leave the man's items on the stall for anyone who might come get them, and cheerfully walk off, while still stroking and hugging yourself in a happy, dizzy fugue of pleasure. You're sure you'll let him out...eventually.",
                "outcomes":[
                   
                ]
             }
          }
       },
       {
          "id":"ritter_feet",
          "title":"Ritter's Experiment",
          "subtitle":"There is a slender black cat lounging at the clothing store. At first you think it's Saberhagen, but as you get closer you see it is a very similar-looking male with a much more smug expression. He is wiggling his sock-covered paws at passers-by.",
          "type":"random",
          "requirements":[
             
          ],
          "icon":"footfetish",
          "results":{
             "success":{
                "text":"You walk up closer to the cat, and he notices you. He waves his gloved hand and grins. \"Hello there! Ritter is the name, and I have come to this stall to sell my goods\", he says. Something about his tone and expression makes you not believe him. He leans back, smiles, and raises his paws towards you. You glance down, and look at the smooth, soft fabric that is clinging to his long, handsome paws. His beautiful, strong and masculine feline paws. Every flex of his toes makes the socks stretch and move, and you can't help but stare at the wonderful curves of his soles and padded paws. Before you know it, you are pressing your fingers against his feet, and starting to rub and squeeze them with a dazed, happy expression.</p>Ritter lifts one paw up and presses it against your face. You inhale deeply, and nuzzle into it as you smell the cat's warm, subtle scent. He writes something down in a notebook and grins. \"So it does work! Turning a hypnotic entity into socks retains their scent-based powers. Fascinating\", he says. You pay very little attention to his words, as your entire mind is focused on how absolutely in love you are with these warm, smooth silky socks, and the perfect paws inside them. You hold Ritter's foot in your hand and squeeze it against your face, rubbing his toes over your cheeks and forehead to feel the silky texture, the perfect warmth, to cover yourself with his amazing scent.</p>Ritter lifts both his feet, and slides them over your cheeks, then strokes them down your chest. You reach forward to hold them more, but he pulls back and keeps them out of your grip. You whine desperately, your entire body aching to feel more of them, and he waves a finger at you. \"Now now. Dumb idiot slaves do as they're told, don't they?\", he says. You nod obediently. \"Who's a stupid moron who completely fell for a level one hypnotic spell?\", he asks. You point to yourself, and he chokes back a snorting laugh. Slowly, he pulls off his socks, rolling them down his furry black paws. He then balls them up, and tosses them over your head. You twist and scramble to grab them, and end up falling into the dirt as you clutch them and nuzzle them into your face. Ritter steps over you and laughs as he walks off into an alleyway.</p>You kiss and lick the socks like a kitten playing with yarn for several minutes, until the magic on them starts to fade, and you come to your senses. You feel terribly embarrassed.",
                "outcomes":[
                   
                ]
             }
          }
       },
       {
          "id":"fox_suit",
          "title":"Try on a Fox Costume",
          "subtitle":"One particular costume stands out to you. A soft orange fox suit, with a smiling head and soft artificial fur",
          "type":"random",
          "requirements":[
             {
                "parameter":"species",
                "value":8,
                "comparison":"nequal"
             }
          ],
          "icon":"tffetish",
          "results":{
             "grizzsex":{
                "text":"You pick up the costume curiously, and stroke your hand down the furry, hollow chest. It looks a little small for you, but the quality is surprisingly good for a simple costume lying in a messy pile at some market stand.</p>The only slightly awkward part is that there is a hand-painted sign on the stall saying that you have to strip naked before trying on any costumes. Of course this is Dormaus Village, so people walking around naked or even engaging in outright sex in public isn’t all that unusual. It’s still a little embarrassing, nonetheless. You lay the costume down, and pull down a zip on its back, before looking around awkwardly and then pulling off your own clothes. You fold them into a pile, and slide one foot down into the costume. The inside is incredibly soft and smooth. It clings to your skin and makes you shudder with strange, intense sensitivity. You feel your foot push down all the way inside, stretching and filling the fox’s plush, padded toes. You flex and wiggle your feet, and watch as the furry fox paw moves and stretches. It feels amazing, and you start to pant as you clench and squeeze your foot, feeling the costume lining between your toes, around your sole, up your leg…</p>Quickly, you push your other leg in too, and shudder. Your knees feel weak from how good this feels, and you start rubbing your hands up and down your furry orange thighs. You need more! You push your arms into the sleeves of the costume, and feel it stretch around you, the fur moving and shifting, adjusting to perfectly cover your skin. You wiggle your fingers and look at your clawed furry hands, finding yourself starting to rub and tease your own fuzzy peach-furred belly with your new hands. You drag your claws through your thick fur and huff with intense delight.</p>You fumble and reach around behind you, practically addicted to this feeling. You manage to grab the blank-eyed, hollow fox head, and pull it up over you like a hood. Feeling the costume close over around your shoulders, barely noticing the zip dragging itself up and squeezing it around you, making it skintight. You look out through the holes in the mask, and feel them starting to drag forward onto your face.</p>Or is your face stretching out against them? You gasp, and open your muzzle, feeling the costume’s face open. You can feel your tongue, longer and thicker, against your sharp vulpine teeth. Your ears twitch over your head, and you grip your pointed face, feeling your fur, your skin. You can’t feel the costume at all!</p>You try to grab the zip, but it’s completely vanished. You pull your fur, but it is stuck to your skin. You are trapped in this sensitive, pleasurable, unbearable fox costume. No, not a costume – your actual body! Good god, is this how foxes feel ALL THE TIME? No wonder they’re such sluts!</p>You stumble away from the stall, shivering and feeling your tail twitch and thrash as you try desperately to not just lunge at the nearest man and beg for his cock…",
                "descriptionchange":"This adventurer is slender fox with a long bushy tail, and an expression of barely-contained lust",
                "outcomes":[
                   {
                      "parameter":"species",
                      "quantity":8,
                      "change":"set"
                   }
                ]
             }
          }
       },
       {
          "id":"panther_suit",
          "title":"Goofy Grin",
          "subtitle":"As you walk around the marketplace, a familiar costume catches your eye; a full-body panther costume made out of rubber, including a panther mask with a goofy grin. [Guest event by Shaddura]",
          "type":"random",
          "requirements":[
             {
                "parameter":"species",
                "value":47,
                "comparison":"nequal"
             }
          ],
          "icon":"tffetish",
          "results":{
             "grizzsex":{
                "text":"You’ve walked past the store countless times, and yet that goofy grin has you hooked more than ever. It lights up curiosity inside of you. You’re well aware that the costumes in this store are magical, and it does come to mind that the suit might have enchanted you into desiring it. However, when was the last time you regretted giving in to the enchantments all around you? Before you could even finish your thoughts, your body was already taking off its clothes. You’d stripped naked before you knew it — something inside of you must’ve been really eager to get into that suit.</p>There’s a zipper on the back — how cliche — which you rush to zip down. The sound fills your body with tingles as you imagine yourself in the suit, how handsome you’d be, just like a certain panther you knew… You jump into the suit before even inspecting it thoroughly. The rubber stretches out to fit your shape, clinging tightly to your skin. It was cold — in contrast to your skin — causing you to shudder as more and more of it covered your body. A few people were giving weird glances, hearing the squeaky rubber and the subtle sound of a zipper closing.</p>You reach down to paw yourself, though it seems to be an impossible task. You’re immensely aroused, yet no touch seems to ever bring you pleasure. You flail your arms in frustration, knocking over the panther mask onto the ground. That’s right — you hadn’t even finished the suit. Surely there’d be no way it would help your issues… yet you felt compelled to wear it; wearing it would make you complete, you thought.</p>It slips on easily, and you don’t notice at all when it merges with the neck. You see surprisingly clearly through the eyes. It actually feels more natural than before you had it on… You were immensely happy that you took it. You try to paw off again, and this time it seems to work! In the middle of a street, some weirdo in a rubbery panther outfit is rubbing their rubber bulge furiously…</p>In the midst of your lust, you don’t notice the rubber getting tighter and tighter, almost as if it was sinking into your skin. Each touch felt more real than the last, making the sensation even more intense. Even as your face grows out and fits into the shape of the goofy mask, you notice not a single part of it. All you care about right now is the pleasure you’re feeling.</p>And pleasure there was. As the transformation finished, you felt an electric burst — an orgasm more intense than ever. The more you rubbed yourself, the better it got… You moaned out loudly, as you jerked yourself off for minutes, keeping the orgasm growing stronger and stronger. You had no genitalia left, so you had nothing to ejaculate out of — you had no refraction period.</p>You went on an on in an endless orgasm. Literal hours passed, pawing yourself off in a lust-driven craze. Your body was getting exhausted by now, but you didn’t want to stop. You had no choice though; with each passing minute, your arms grew weaker, and it became harder to keep going. At this point things got blurry — the last thing you could remember was a calculative voice: “3 hours and 37 minutes. That’s a new record…”</p>You wake up a while later. You have become one with the suit. Your crotch is round and smooth, but while your real junk, rubbing your new groin feels just as good — if not better.",
                "descriptionchange":"This adventurer is a tall squeaky rubber panther. Their face is stuck in a silly, goofy looking smile",
                "outcomes":[
                   {
                      "parameter":"species",
                      "quantity":47,
                      "change":"set"
                   }
                ]
             }
          }
       },
       {
          "id":"festival_badger",
          "title":"Help Making Masks",
          "subtitle":"Saberhagen is very excited to be helping out with making masks for King in Red's Night. He's taking it very seriously, and using a complex and difficult mask-making process.",
          "type":"random",
          "requirements":[
             {
                "parameter":"species",
                "value":49,
                "comparison":"nequal"
             }
          ],
          "icon":"tffetish",
          "results":{
             "grizzsex":{
                "text":"When you get to the costume stand, you almost don't recognise Saberhagen. There's a huge, muscular lion in adventurer's armor talking to him, and when you get closer, you see an unusual sight. Next to him is a shaggy lion. His thick mane and powerful, scarred jaw look very out of place with the mage's robe and pointy hat he's wearing. The mage lion reaches up to his cheeks, and closes his eyes, before starting to pull on his cheeks. His features begin to stiffen and harden, fur flattening, developing wood grain patterns. His grin becomes fixed and hard, and his face becomes painted wood, before finally he pulls it off completely. Behind the new mask face is revealed Saberhagen's usual cheerful face. He hands the mask over to the lion in exchange for a handful of coins, and the lion leaves cheerfully.</p>Saberhagen sees you watching, and pulls you over. \"Isn't this great? Everyone is so excited, and there are so many fun decorations and traditions! I've been helping Ritter make the masks, with an old identity-copy spell I learned a while back. People really like how high quality my masks are! Here, I'll show you how to do it!\", he says.</p>The next customer in line is a portly, excited badger with a scruffy and fuzzy striped muzzle. Saberhagen stands behind you and guides your hands through the motions to the spell, his chest pressed against your back and his gentle hands holding your wrists. First, you take hold of the badger's wide, heavy hands, which are thickly padded on the palms. You stare deep into his eyes, as Saberhagen tells you gently and repeatedly to focus on the badger's identity. \"Look at him like you're looking in a mirror. That grey striped muzzle, his stocky build, his posture and movements. Mimic them, let your thinking slow and calm as you become the mirror...\", he says. You feel the magic building up inside you, as it becomes easier and easier to copy everything the badger does. Your posture shifting back in a slight slouch. Your chest breathing in and out in perfect time with his. Your eye level shifting as your height shifts to match him. You even find yourself blinking in time with him. Gradually, your skin starts to tingle and feel warm, as thick fur spreads down your arms and over your chest. Your belly bulging and growing rounder and more portly, pushing out as it grows to match his. Your feet spreading and growing, becoming thick and large, with tough bulging pawpads and firm, strong claws for digging. Your rear pushing out slightly, as your behind gets larger and a short, tufty tail appears between your cheeks. He lifts one of his hands, and you copy him as he stares at your changing hand in amazement, watching as you grow the same thick pawpads as him, as you move your clawed fingers as he does. Your face pushes forward, growing into a muzzle as your nose turns black and wet. Your teeth getting sharper, and a bushy soft covering of striped fur flowing down your new face, with tuftier moustache-and-beard like fuzz on the front of your muzzle. Your hair shrinks back, leaving just some tufts of grey like the badger has, and finally you are a perfect clone copy of him. Saberhagen holds your large hands gently and lifts them to your head. \"Now, just gently release that identity. Let it flow into the mask, and separate it slowly from yourself\", he says.</p>You press your hands to your cheeks, and start to pull. You can feel your face growing firm and hard. Your expression stiffening and hardening. You close your eyes as furry skin becomes smooth, painted wood, and slowly pull forward, feeling it pull away from you like glue.</p>Finally, you open your eyes and look down at the mask in your hands. The mask of...a human face? YOUR face! You touch your head, feeling your badger muzzle, scruffy fur, looking down at your wide diggers hands. Saberhagen makes a nervous noise. \"Oh dear! Were you not very attached to your personality? That doesn't normally happen\", he says with concern. The badger in front of you, however, is very pleased. \"What a cool mask! Perfect for the festival, I love it!\", he says. He drops a bag of coins onto the stall and grabs the mask, before leaving with it in his hand, and your identity alongside it.</p>You stand awkwardly next to Saberhagen, now trapped as a fat and fuzzy badger. He gently pats your shoulder. \"Um, I think you look very handsome this way, if that helps?\", he says.",
                "descriptionchange":"This adventurer is a short and stocky badger, with a round chubby belly and a scruffy, furry striped face.",
                "outcomes":[
                   {
                      "parameter":"species",
                      "quantity":49,
                      "change":"set"
                   },
                   {
                      "parameter":"festival_time",
                      "quantity":1,
                      "change":"add"
                   }
                ]
             }
          }
       }
    ],
    "npcs":[
       
    ]
 }