{
    "title":"dragon_vore",
    "header":"Decision: Lunchtime",
    "nomap":"You don't know your way around this area yet. You'll have to navigate on foot.",
    "subheader":"You have found yourself overcome with a desire to feed yourself to a fat, pear-shaped sleeping dragon. This chubby dragon deserves a meal as tasty as you. You can't wait to be digested for him. You are left with a choice though. Go in through his open, snoring mouth, or through another entrance?",
    "events":[
       {
          "id":"oral_vore",
          "title":"Enter the Mouth",
          "subtitle":"The traditional predator method appeals to you most.",
          "type":"random",
          "requirements":[
             
          ],
          "icon":"vorefetish",
          "results":{
             "grizzpay":{
                "text":"Feeding yourself to a mighty beast and becoming a meal, to serve its nutrition and health. What could be better? You crawl over to the dragon's muzzle, and when he opens his huge fanged maw to snore again, you push yourself between his teeth and onto his huge tongue. The hot, wriggling tongue under you twitches and moves, sliding up and down between your legs. His snores vibrate your body as his teeth close all around you, trapping you in the wet darkness.</p>The feeling of being inside a predator's mouth drives you wild. You hump and stroke his tongue, letting it taste all around you. It slides along your feet, up your chest, against your rear. You wonder if he's dreaming of a delicious meal. The tongue even curls around you and squeezes you, and you shudder with lust as he almost swallows you, before you slip back down against his teeth.</p>You hear his snoring change a little, and he wriggles as saliva starts to build up all around you. It makes you wet and slippery, and you slide around on his tongue, before finally he swallows. You are dragged with incredible force, pulled down into the dark, inescapable tunnel of the dragon's throat. You feel yourself squeezed all around, as his throat movements massage and stroke you while they drag you to his stomach. You shiver with lust, knowing that the dragon will awaken full and happy with you as his midnight snack.",
                "trapped_desc":"A dragon's belly is particularly full and round today.",
                "trapped":"You are the digested remains of an adventurer, now nothing but nutrients for a fat and happy dragon.",
                "area":"beside_river",
                "outcomes":[
                   
                ]
             }
          }
       },
       {
          "id":"cock_vore",
          "title":"Crawl into his Cock",
          "subtitle":"That big fat cock looks almost like a sleeping bag.",
          "type":"random",
          "requirements":[
             
          ],
          "icon":"vorefetish",
          "results":{
             "grizzpay":{
                "text":"The dragon's huge soft cock is the perfect place to be broken down into goo. You shudder with delight at the thought of melting away into a big puddle of sticky white cum. Carefully, so as not to wake him, you move down between his legs and press your feet cautiously against his cockslit. His enormous pale-green cock stretches easily around you, and you can feel the slick, warm insides of his shaft start to pull you in. Your feet are dragged down, and your rear slides across the grass as his twitching cock pulls you down to your hips. As it does, the dragon grumbles and shifts in his sleep, and slowly rolls over on top of you. You are squeezed down into the dirt under his enormous soft belly, as his stretchy cock pulls you deeper and deeper. You rub against the underside of his gut, his musk soaking your head, as you feel your chest and arms get pulled into his stretched-out cock. Finally, your head is drawn down against his slit, and the dragon starts to sleep-hump the ground, his motions forcing you completely inside him. Dark, slimy flesh surrounds you, thick with the scent of cum. You can do nothing but feel him throb and pulse, his cock bulging and hardening as you slide down it, the flesh squeezing you harder and harder the more erect he gets. Just as it feels like his cock is going to crush you, you are finally released into a slightly-less cramped space, as you splash into a messy puddle of thick, hot cum.</p>You can feel the dragon's balls around you, soaking you in jizz that drips from every inch of your body. You smell it, you swallow it, and very quickly, you can feel yourself starting to become it.</p>It starts with your skin sweating heavily, as oozing, slimy white cum drips from every inch of you. Then, you taste the dragon's hot cum deep in your throat, and you are forced to cough and splutter as it oozes endlessly from your mouth. Your legs feel soft and weak, and you sink deeper into the cum as your lower body begins to fall apart. It spreads out and around, while you notice you can no longer see your skin under all the cum, as it too has turned white and translucent. You lie back and relax, feeling your body grow intensely calm and pleasureable as you are melted away. You would masturbate if you still could, but you content yourself with the knowledge that you will soon be part of the dragon's next messy, hot orgasm. Finally, you dissolve completely, nothing but more cum in his swollen balls.",
                "trapped_desc":"A big dragon's balls are currently swollen with lots of hot, sticky cum.",
                "trapped":"You are a big messy blob of cum, swirling patiently in a dragon's balls.",
                "area":"beside_river",
                "outcomes":[
                   
                ]
             }
          }
       },
       {
          "id":"anal_vore",
          "title":"Crawl under his Tail",
          "subtitle":"You better not go for this one unless you have a taste for the gross and dirty stuff you'll find inside an ass.",
          "type":"random",
          "requirements":[
             
          ],
          "icon":"vorefetish",
          "results":{
             "grizzpay":{
                "text":"You eagerly move behind the dragon's sleeping body, to the soft ring of flesh under his tail. The humiliation of being devoured by a butt, squeezed in the dirty insides of a mighty beast's asshole, and pushed back out as nothing but waste. You are already excited. You press your face gently against the dragon's hole, and inhale the earthy, dirty scent of his rear. You open your mouth and lick around the hole, tasting the musky lizard behind and getting a small preview of the nastiness you will soon be subjected to. The sleeping dragon twitches and shifts, but is unaware of your actions.</p>You take the opportunity to get a good bit of ass-worship in, since it might be your last action as a living being. You lick and kiss the dragon's hole, soaking his twitching ass with saliva as you press your head further and further between his scaly cheeks. You feel your nose and mouth pushing into the dragon's rear from your actions, and soon your vision is obscured by darkness, as you have pressed your face so firmly into his asshole that it is starting to suck you in. You breathe in dirty, hot air that stinks of waste, as you are slowly dragged into the dragon's ass. Your head and shoulders are squeezed all around by wet and sticky warm flesh, and you wriggle helplessly as your torso and legs are slowly dragged up and in.</p>You find yourself tightly constricted all around by a slimy and hot prison. You can feel the dragon's hole closing behind you, leaving you completely bound. You can't even move your arms and legs, not that you will have them for very long. The air around you is becoming harder to breathe, and you can feel yourself starting to change. Your skin feels wet and sticky, and your breath is rank and steaming. Vile-tasting goo oozes from your mouth as your limbs and flesh start to squish together and lose definition. Some vital essence, some nutrition and focus, is being drained from you and dragged into the dragon's own body. You lose your shape completely, being squished up into nothing but a messy pile of waste, as the last of your energy is drawn away for the dragon's benefit. You have nothing to look forward to now except being disposed of.",
                "trapped_desc":"There is no adventurer here, only a dragon's butt full and waiting to be emptied.",
                "trapped":"You are the remains of a fully-digested adventurer, trapped in a dragon's colon and awaiting your final disposal.",
                "area":"beside_river",
                "outcomes":[
                   
                ]
             }
          }
       },
       {
          "id":"leave_dragon",
          "title":"Change your mind",
          "subtitle":"What are you doing?! This is a terrible idea!",
          "type":"random",
          "requirements":[
             
          ],
          "icon":"navigateicon",
          "results":{
             "success":{
                "text":"You slap yourself and back away from the big fat dragon. You are not going to become lunch today!",
                "area":"beside_river",
                "outcomes":[
                   
                ]
             }
          }
       }
    ],
    "npcs":[
       
    ]
 }