{
    "title":"horseball_inn",
    "header":"Northern Plains",
    "mapId":"worldmap.jpg",
    "subheader":"You see a large, lumpy black boulder sitting on the grass just beneath a large shaded tree. Upon getting closer, you can see that the boulder is moving and jostling slightly, and looks oddly glossy. Finally when you get close enough, you discover it's not a boulder at all. Two muscular, powerful horse legs are on either side of it, and behind it, resting under the tree, is a massive, chubby black stallion. What you thought was a boulder is in fact his massively stretched out, sweaty black ballsack.",
    "events":[
       {
          "id":"ask",
          "title":"Ask What's Going On",
          "subtitle":"The horse seems perfectly content with his disproportionately enormous balls. He's lying on the grass, his arms behind his back, while he watches the clouds.",
          "type":"random",
          "requirements":[
             
          ],
          "icon":"default",
          "results":{
             "fail":{
                "text":"You greet the horse, and he nods at you. His mane is thick and long, and it covers his eyes completely with a dense black fringe. His body is otherwise naked, showing off his sleek black fur, and his powerful wide chest, with a round, firm gut.</p>\"You here for the night? We've got a spare room if you want it, just had the previous tenant decide to go long-term stay\", he says.</p>You ask what is going on, and he lifts one of his legs and pats his hoof against his bulging nuts. \"I'm running an inn. Nice snug warm rooms, great protection from the weather, and a nice spot right on the trade road running north. Only downside is you come out a little messy in the morning, but there's a river nearby for that, and some customers like it that way.\"</p>You look sceptically at his massive ballsack, and he grins. \"No, it's not a trick. Eatin' folks isn't good for return customers! If you pay your rate and head in, you can come back out again any time. Though some of my really eager customers do decide to become permanent residents, they pay for the privilege and it's all above board.\"</p>He yawns, and chews on a long piece of grass. \"Anyhow, if you want a room, it's only five guilders a night. Just hand me the cash and crawl on in. Don't worry, the \"entrance\" will help you on the way.\"",
                "outcomes":[
                   
                ]
             }
          }
       },
       {
          "id":"getin",
          "title":"Stay at the Horseball Inn",
          "subtitle":"For five coins, you can spend the night sleeping curled up in one of the horse's huge, musky balls. If that sort of thing appeals to you.",
          "type":"random",
          "requirements":[
             
          ],
          "icon":"vorefetish",
          "results":{
             "success":{
                "text":"You hand over your coins to the horse, and he pushes aside a rock and deposits them in a small pile of money hidden beneath it. \"Alright, that covers you for the night. Feel free to crawl on in\", he says.</p>You kneel down, and crawl over the horse's naked belly. He doesn't seem to mind. His gigantic brown-and-pink cock is flopped in front of you, bigger and wider than a sleeping bag. You press your hands to his huge flared cockhead, and it stretches open easily.</p>You push in deeper, the warm and soft flesh stretching to allow you entry, and start to crawl inside. The interior is slick and slimy, and stinks of the musky, rich scent of sex and cum. As your head pushes inside, it becomes dark, and the scent grows stronger.</p>You crawl forward more, with the flesh of the horse's cock surrounding and pressing down on you like a warm, slimy blanket. You feel it pulse and throb, as it slowly starts to tug on you. Your body is drawn forward, deeper into the horse's cock. You feel your hips and legs slide up inside, and then you are dragged down without needing to crawl or push yourself any further. Darkness swallows you up, and your skin is soaked with slippery, warm pre. Before long, the pressure around you loosens, and you are dropped into a new space. You land in a warm pool of cum that covers you up to your neck, as you are left curled up inside the horse's enormous balls.",
                "area":"horseball_inside",
                "outcomes":[
                   
                ]
             }
          }
       }
    ],
    "npcs":[
       
    ]
 }