{
    "title":"hotel",
    "position":[
       0.94,
       0.73
    ],
    "header":"The Two Feathers Inn",
    "subheader":"The inn is a clean and homely building. The walls are white with fresh paint, and some effort has been put into decorating them with photographs and woodcuts. From the ceiling, a small but pretty chandelier is lighting the room.",
    "events":[
       {
          "id":"askcedric",
          "title":"Ask for Advice from Cedric",
          "subtitle":"The owl innkeeper at the Two Feathers has a reputation for knowing everything that is going on in the region. He could get you up to date on the latest rumours. If you ask again every now and then, he could have more news.",
          "type":"random",
          "requirements":[
             
          ],
          "icon":"default",
          "results":{
             "Teddy Complaints":{
                "text":"\"I hear that the mayor has blocked any new digging licenses lately. A shame, with one of those you could go hunting for treasure in the caves east of Turner Farm. Maybe if you made friends with a cat, he would be more open to granting you one? The old tyrant is a bit of a speciesist, you see.\"",
                "outcomes":[
                   
                ]
             },
             "Flute's Pitches":{
                "text":"\"I have heard you tell that the King of Makarna, Leonar, will be in town soon. He is coming south from a meeting at Horn, and after that, he will be getting on a boat from Otterton and travelling back to Makarna. You should keep an eye out for him, I hear he likes fine art and submissive types, so if you like the sound of that, I bet he might be at the art store.\"",
                "outcomes":[
                   
                ]
             },
             "Alakazam":{
                "text":"\"Word on the street is the priest, Bonacieux, has a big problem that he needs help with. No ordinary help, though, he needs a professional. If you have been exploring in the caves successfully, you might be just what he is looking for.\"",
                "outcomes":[
                   
                ]
             },
             "4":{
                "text":"\"You hear that the mayor has a deal with Horn now? They are sending all our criminals up to Hornloft Prison. I would like to go give him a piece of my mind on that, but that would only end up with me on a one-way trip up North! Perhaps you're braver than I, though.\"",
                "outcomes":[
                   
                ]
             },
             "5":{
                "text":"\"There are rumours of bandits on the windy pass north of Otterton. Odd rumour though, I heard that the bandit takes pity on people who don't have any coins. Even befriends them! Odd behaviour for a violent thug.\"",
                "outcomes":[
                   
                ]
             },
             "6":{
                "text":"Have you heard about the Eastwood forests? They call it that because there's a mountain between here and Westwood, and the half of the forest on our side of the mountain is Eastwood. The Westwood wolves have to build a bar there for travellers crossing the mountain path. If you are interested I'd try heading northwest from Otterton.",
                "outcomes":[
                   
                ]
             },
             "7":{
                "text":"\"The festival is getting close again this year. If you are interested in helping out, there is work to be done at the farm, pumpkin patch, and markets. You might be surprised who is out and about when the festival gets close!\"",
                "outcomes":[
                   
                ]
             }
          }
       },
       {
          "id":"tarot",
          "title":"Ask About Villagers",
          "subtitle":"Cedric, the hotel manager, is playing with a deck of cards. Each of them appears to have an unusual image on the front.",
          "type":"random",
          "requirements":[
             
          ],
          "icon":"random",
          "results":{
             "thing":{
                "html":"data/active/Cedric.html",
                "outcomes":[
                   
                ]
             }
          }
       },
       {
          "id":"hotel_random",
          "title":"Wait in the Lobby",
          "subtitle":"They have a selection of books and there is a nice breeze to relax with.",
          "type":"random",
          "requirements":[
             
          ],
          "icon":"default",
          "results":{
             "Teddy Complaints":{
                "text":"There is a strange sight in the inn today. Two short, cuddly teddy bears are arguing with the innkeeper with high-pitched adorable voices. The innkeeper, a fat and sleepy-looking owl, is barely paying attention to their complaints about \"cursed toys\" and \"being full of fluff\". It seems he is quite used to this sort of thing, because after a while the two bears start to trail off, and look at eachother with their big fake plush eyes. </p>They stroke and touch one another, and then begin to cuddle and squeeze together. Their stitched-on happy expressions seem a little more genuine as they become too cuddle-obsessed to keep complaining, allowing the owl to return to reading his book.",
                "outcomes":[
                   {
                      "parameter":"muscat_1",
                      "quantity":5,
                      "change":"add"
                   }
                ]
             },
             "Flute's Pitches":{
                "text":"You see Flute at the inn, trying to convince the owl inkeeper to purchase one of his latest weird trinkets. He dangles a large bronze amulet. \"This is an amulet of life saving! Restores you from any lethal fate!\" he says eagerly. The owl looks at him with half-closed eyes. \"It's an amulet of life preserving. It turns you into a mummy.\" he replies. Flute, ever undeterred, shows off a gleaming knife. \"The blade of ages! Cuts anyone in half!\" he says. </p>The owl yawns. \"The blade of ages cuts anyone's AGE in half, and makes them younger. Which that isn't. It's a bread knife. From my own kitchen.\" he says. The fox tosses the knife aside with the same wide grin, and pulls a badge out from his tunic, with a large paw print on it. \"Well what about this then? Took it from that weird old cave, definitely magical, probably makes you all stompy and powerful.\" he says. </p>The owl grins a bit as he sees it, and hooks one feather-finger into Flute's jerkin, pulling him around behind the counter. \"Flute, that's the badge of paw slavery. Anyone holding one is marking themselves as an obedient paw slut.\" he says. Flute makes a startled noise, but his yelp turns to a moan of lust as he is lowered to the owl's clawed feet behind the counter. You see the proud fox try desperately to resist, but he's soon rubbing and massaging the owl's talons with a frustrated and confused erection. You wonder if you could get yourself one of those badges.",
                "outcomes":[
                   {
                      "parameter":"muscat_1",
                      "quantity":5,
                      "change":"add"
                   }
                ]
             },
             "Alakazam":{
                "text":"It looks like the inn has some entertainment on tonight. On a small stage next to the dining area, a white rabbit with a waistcoat and top hat is performing magic tricks. His black bowtie is quite cute on his furry neck. He makes cards disappear, and correctly guesses which fetish the volunteer is thinking of. Then, for the big finish, he gets an adventurer to come up on stage. With a wave of his wand, the human starts to growl and shudder. </p>Fur sprouts across his flesh, and his face pushes forward as he opens his mouth wide, showing off enormous razor-sharp white fangs. His body thickens with powerful, predatory muscles. His fingers flex as his nails turn to huge sharp claws, and then his hands thicken into furry orange paws. He falls to all fours, his armor snapping open under his growing bulk. He shakes it off, growling and snarling, and stretches his body as his bones reshape for quadrupedal movement. A long sinuous striped orange tail curves behind him, as the enormous new tiger prowls on the stage. The rabbit flourishes and bows, expecting clapping, but nothing happens. </p>He blinks and raises an eyebrow. \"Er. This is considered very impressive where I am from...\" he mutters. You suppose it's hard to impress people with transformation in a town where it happens around every corner. He finishes up his act, leaving behind the tiger, who makes a confused growl that you interpret to mean \"Wait, are you leaving me like this?\"",
                "outcomes":[
                   {
                      "parameter":"muscat_1",
                      "quantity":5,
                      "change":"add"
                   }
                ]
             }
          }
       }
    ],
    "npcs":[
       
    ]
 }