{
    "title":"lionquest_acecock",
    "header":"In Ace's Pants",
    "nomap":"You are far from home and you don't know your way back.",
    "subheader":"You spend most of your time in Ace's pants, dangling over his sweaty balls and waiting to be used.",
    "events":[
       {
          "id":"resistcock",
          "title":"Life of a Cock",
          "subtitle":"You must focus your mind, remember who you are, and not lose yourself to cockthoughts.",
          "type":"statcheck",
          "stat":"magic",
          "difficulty":20,
          "requirements":[
             {
                "parameter":"curse",
                "value":2,
                "comparison":"less"
             }
          ],
          "icon":"aceicon",
          "results":{
             "success":{
                "text":"Life as a cock is very simple. You just wait inside Ace's pants, smelling and tasting his sweat all around you in the humid darkness, until he needs you. When he thinks of something that turns him on, pleasure flushes through you and you feel yourself harden and stiffen. When he itches, he rubs his fingers against you and scratches your balls. All you need to do is wait and obey, and not let your humanity slip away, however good it might feel to sink into cock thoughts.</p>You feel Ace sitting down for camp, and light washes over you as he pulls his pants down. He's sitting in his tent, with a gas lamp next to him. He pulls off his gloves, and strokes his hand along your length. You immediately begin to react, your body throbbing and filling up with hardness and pleasure. \"Fuck, nice. I always forget how sensitive and hot it is to have a guy for a dick\", he mutters. His fingers grip around you, and he starts to pump and stroke you. Each time his hand slides down your body, your mind is awash in lust and pleasure. Precum oozes and dribbles from your mouth, dripping down your face. When Ace gets hard, your whole body reacts and stiffens, but you still have an equivalent of getting erect yourself. That's when the big hard knot around your base bulges and swells. It feels like it's all yours, your own arousal bulging it and making a stiff round ball of pleasure.</p>You remind yourself not to give in to the magical pleasure. If you let the transformation soak into you, your orgasm will be far more amazing, but you will lose part of yourself and might never be able to turn back. You focus on your own magical ability even as Ace strokes and pumps you. When he squeezes your knot, you feel a rush of heat and lust through yourself, and the heat of his cum bursts up through your insides and spews from your mouth. It sprays up over his fur, and leaks down your face. It felt amazing, and you desperately want more, but you didn't lose yourself in it. Not yet.",
                "outcomes":[
                   {
                      "parameter":"time",
                      "quantity":1,
                      "change":"add"
                   }
                ]
             },
             "fail":{
                "text":"Life as a cock is very simple. You just wait inside Ace's pants, smelling and tasting his sweat all around you in the humid darkness, until he needs you. When he thinks of something that turns him on, pleasure flushes through you and you feel yourself harden and stiffen. When he itches, he rubs his fingers against you and scratches your balls. All you need to do is wait and obey, and not let your humanity slip away, however good it might feel to sink into cock thoughts.</p>You feel Ace sitting down for camp, and light washes over you as he pulls his pants down. He's sitting in his tent, with a gas lamp next to him. He pulls off his gloves, and strokes his hand along your length. You immediately begin to react, your body throbbing and filling up with hardness and pleasure. \"Fuck, nice. I always forget how sensitive and hot it is to have a guy for a dick\", he mutters. His fingers grip around you, and he starts to pump and stroke you. Each time his hand slides down your body, your mind is awash in lust and pleasure. Precum oozes and dribbles from your mouth, dripping down your face. When Ace gets hard, your whole body reacts and stiffens, but you still have an equivalent of getting erect yourself. That's when the big hard knot around your base bulges and swells. It feels like it's all yours, your own arousal bulging it and making a stiff round ball of pleasure.</p>It's very dangerous to give in to your pleasure. If you wanted to, you could use your magical abilities to merge more with Ace's dick, to feel more of the pleasure it can give and think the simple, sex-obsessed thoughts of a cock. Too much, though, and there will be no 'you' to turn back afterwards. You throb and pulse against Ace's fingers, and find yourself craving more. You give in to desire, and feel magic tingle and stroke up your sides and inside you. Your senses dull and fade a little, but the pleasure and arousal you feel becomes much more intense. You can feel every inch of Ace's shaft, every touch and tease, all the intricacies of his hands against you. When he squeezes your knot, it's like absolute bliss. You jerk hard in his grip, and feel his balls churn as he orgasms harder than ever. Cum explodes from your slit, spurting up over his chest and even splattering over his muzzle. He laughs and pants, licking cum from his face, while you soften and feel dizzy. Part of your mind and identity went out along with that cum, and you find it harder and harder to remember who you are.",
                "outcomes":[
                   {
                      "parameter":"curse",
                      "quantity":1,
                      "change":"add"
                   }
                ]
             }
          }
       },
       {
          "id":"cursed",
          "title":"Cum The Last of Your Mind",
          "subtitle":"You have given into the spell too much. There is nothing of you left.",
          "type":"random",
          "requirements":[
             {
                "parameter":"curse",
                "value":1,
                "comparison":"greater"
             }
          ],
          "icon":"curse",
          "results":{
             "success":{
                "text":"Finally, after weeks of travel, Ace walks through the gates of Dormaus Valley. He grins at the familiar sight of the little town, and sighs in the cool air of this more temperate part of the world. \"Alright partner, time to go\", he says. He pulls down his pants and looks at his cock, noticing that the extra size and thickness from absorbing someone into it seems to have gone. It looks just like it always does. He tugs on it, and mutters a few spells, but nothing happens. \"Come on, what the hell?\", he says to himself, and scratches his head. He pulls his pants back up, his cock not reacting at all, just a mindless organ that feels only pleasure.</p>He ignores his favourite bar and walks over past the river instead, to a familiar tent near the fountain. Saberhagen looks up from serving a customer, and waves. \"Hello! Can I help you with something?\", the cat asks. Ace nods, and tells the black cat that he was holding someone as his cock for a while and they don't seem to be turning back. Saberhagen's ears twitch, and he blushes a little. \"Let me have a look\", he says. He pulls off a glove and nervously slides his hand into Ace's pants, before feeling around the thick cock the coyote has between his legs. \"No, I'm afraid that I don't sense any magic or intelligence here, sir. If there was a person here, I would imagine they have become so integrated with your cock that it has absolutely become their identity. They won't ever be able to turn back\", he explains. Ace swears and spits, but then shrugs. \"Well, fuck. Hardly my damn fault then if the fool loved my dick so much\", he says.</p>He heads off to the bar, soon forgetting all about the situation. You understand none of this, of course. You are nothing but mindless flesh, always eager for more pleasure, and having no thoughts of your own. You are Ace's cock.",
                "trapped_desc":"Ace's huge musky cock is bulging in his pants.",
                "trapped":"You are Ace's huge, sexy cock. You do only what he wants, your only choice is when to get erect, which you do mindlessly.",
                "outcomes":[
                   
                ]
             }
          }
       },
       {
          "id":"savemebat",
          "trapped":true,
          "title":"Save that cock, Mister Bat!",
          "subtitle":"Ace doesn't recognise the peculiar tall bat that enters the casino one day, but he never says no to a gamble.",
          "type":"random",
          "requirements":[
             
          ],
          "icon":"mrbat",
          "results":{
             "rareSuccess":{
                "text":"Ace blinks in slight surprise as he looks across the table to see a tall bat sitting at the chair. He could have sworn he didn't see anyone come in. The bat reaches over and shuffles the deck of cards, then smiles pleasantly. \"Hello, Ace. I would like to play cards, if you would be so kind\", he says. Ace shrugs and gets out his chips. One mark is as good as another.</p>A few hands later and Ace is staring at the table in disbelief. The bat wins every single round, and however he's cheating, Ace can't seem to see it. The bat places his cards down, revealing another winning hand. \"I would like to go for one more hand, if you don't mind. Perhaps all my chips, and if I win, I can play with that interesting cock of yours\", he says. Ace growls. \"You're on!\"</p>A few minutes later, Ace is sulkily unzipping his pants and spreading his legs, showing off his thick throbbing coyote meat. The bat walks forward, and strokes his fingers along the shaft. It starts to throb, and swell, and grow far beyond its usual size. It stretches out and starts to form limbs and features, and the bat holds it up and rests it on the table. Gradually, it reforms into the shape of a person, the slit transforming into a mouth and a confused expression appearing on their face. Ace, shocked, pulls himself back, his cock sliding out of your ass as you look up at the bat. \"Please do be more careful in future, my friend\", he says, before bowing and leaving. \"Oh, but to be fair, I will have to rewind time to before you made it to Dormaus. This time try to do it properly. Rules are rules\", he says. He waves a finger, and suddenly you are back on the road, travelling under Ace's control.",
                "freeTrap":true,
                "outcomes":[
                   {
                      "parameter":"curse",
                      "quantity":0,
                      "change":"set"
                   }
                ]
             }
          }
       },
       {
          "id":"nextfromcock",
          "title":"Finally Home",
          "subtitle":"It has been one hell of a journey",
          "type":"random",
          "requirements":[
             {
                "parameter":"time",
                "value":1,
                "comparison":"greater"
             },
             {
                "parameter":"guilt",
                "value":2,
                "comparison":"less"
             }
          ],
          "icon":"aceicon",
          "results":{
             "grizzsex":{
                "text":"Finally the day comes when you emerge from your sheath to see not a mountain or desert, but the grassy and pleasant town of Dormaus. When Ace pulls on you, and you feel yourself coming free and transforming, you are almost disappointed that you will no longer be helping Ace masturbate each day. Your limbs return, your body growing, until finally you are left panting and musky, sitting in front of Ace as he walks past you to get a drink at the bar.",
                "area":"dormaus_entrance",
                "outcomes":[
                   {
                      "parameter":"time",
                      "quantity":0,
                      "change":"set"
                   },
                   {
                      "parameter":"leonar_master",
                      "quantity":0,
                      "change":"set"
                   }
                ]
             }
          }
       }
    ],
    "npcs":[
       
    ]
 }