{
    "title":"lionquest_glowscale",
    "header":"Glowscale Docks",
    "nomap":"You are far from home and you don't know your way back.",
    "subheader":"You are standing on a river port. The heat and humidity of this land is like nothing you have ever felt. You are dripping with moisture. A wide river winds off into the distance, and the land around you is cramped with trees. The air hums with the buzz of insects.",
    "events":[
       {
          "id":"restaurant",
          "title":"Work at a Restaurant",
          "subtitle":"The Greedy Gator is a riverside restaurant, which is always looking for new hires. They keep going missing, you see.",
          "type":"statcheck",
          "stat":"charm",
          "difficulty":30,
          "requirements":[
             {
                "parameter":"outcast",
                "value":2,
                "comparison":"less"
             }
          ],
          "icon":"vorefetish",
          "results":{
             "success":{
                "text":"You find out about the restaurant job when you overhear two dockworkers talking about a seafood restaurant that opened facing the river recently. You follow their directions along the riverbank, past some particularly thick and dark trees, until you discover a pleasant-looking building with paper lanterns hanging from the eaves, and a large patio where a number of customers are dining and chatting.</p>You walk up towards the kitchen, and peek your head in to see a massive alligator with a huge round belly, wearing a chef's hat. He is humming to himself as he chops up an enormous catfish, and he pauses now and then to stir  a bubbling pot. He looks over to you and waves. \"Ah! New helper is it, yes? So happy to see you! You can start right away!\", he says. Before you can even reply, he grabs an apron and pushes it over your head, then ushers you along into an adjoining room. This one is much darker, with cooking utensils hanging from the wall, and one particularly alarming feature. A squirrel is tied up and lying on a bench, looking rather panicked. \"Now, is need to baste, yes? Take these and stroke carefully, make sure all the fur is nice and basted, but make sure he is very close to cumming, yes? Customers like the food to have the orgasm just as they are sliding down, you see\", the gator says. He hands you a brush and a bucket of sweet-smelling sauce, and goes back to work.</p>You approach the squirrel nervously, and he blushes. \"Ah, don't worry. I am looking forward to being food, actually. Just make sure I'm tasty!\", he says. This only partially calms your nerves. You dip the brush in the sticky sauce and begin to stroke it up the squirrel's bare feet. He squirms and whines as his soles are soaked in shiny, glistening amber fluid. You brush and smear more of it up his legs, taking your time and watching his cock start to rise and harden as you baste him. He squirms ticklishly when you stroke the brush through his chest fur, soaking him in goopy fluid, and he closes his eyes to let you brush it all over his face. He instructs you to grab an apple and put it in his mouth, and you do so, watching as he bites into it and is gagged. You then finish by very slowly and carefully stroking the brush up and down his shaft. Glazing drips down from his twitching shaft, and you make sure to watch his pants and squirms to keep him right on the edge, to the point that he leaks pre that mingles with the sauce.</p>The chef returns shortly after, picking up the dish the squirrel is lying on and carrying him out. He carries the platter to a huge hippo dressed in a bulging business coat, and you watch as the hippo lifts the squirrel up, opens his massive chubby maw wide, and slowly slides him inside. As the squirrel slips down past the hippo's tongue, he arches his back and squirms, his cock finally unloading and splattering him with cum. Then, with a gulp, he is dragged down the hippo's throat, and the businessman closes his maw and sighs with delight.</p>You are paid well for your services, and as you leave, the gator mentions that if you ever want to send a lot of gift money to a friend, he thinks you'd make an excellent meal. It's possibly the strangest compliment you've ever gotten.",
                "outcomes":[
                   {
                      "parameter":"time",
                      "quantity":1,
                      "change":"add"
                   }
                ]
             },
             "fail":{
                "text":"You find out about the restaurant job when you overhear two dockworkers talking about a seafood restaurant that opened facing the river recently. You follow their directions along the riverbank, past some particularly thick and dark trees, until you discover a pleasant-looking building with paper lanterns hanging from the eaves, and a large patio where a number of customers are dining and chatting.</p>You walk up towards the kitchen, and peek your head in to see a massive alligator with a huge round belly, wearing a chef's hat. He is humming to himself as he chops up an enormous catfish, and he pauses now and then to stir  a bubbling pot. He looks over to you and waves. \"Ah! New helper is it, yes? So happy to see you! You can start right away!\", he says. Before you can even reply, he grabs an apron and pushes it over your head, then ushers you along into an adjoining room. This one is much darker, with cooking utensils hanging from the wall, and one particularly alarming feature. A squirrel is tied up and lying on a bench, looking rather panicked. \"Now, is need to baste, yes? Take these and stroke carefully, make sure all the fur is nice and basted, but make sure he is very close to cumming, yes? Customers like the food to have the orgasm just as they are sliding down, you see\", the gator says. He hands you a brush and a bucket of sweet-smelling sauce, and goes back to work.</p>You approach the squirrel nervously, and he blushes. \"Ah, don't worry. I am looking forward to being food, actually. Just make sure I'm tasty!\", he says. This only partially calms your nerves. You dip the brush in the sticky sauce and begin to stroke it up the squirrel's bare feet. He squirms and whines as his soles are soaked in shiny, glistening amber fluid. You brush up his legs, and over his cock, stroking the goopy fluid over his erect, bobbing shaft. He gasps and whines and bucks his hips, and you brush again carefully to make sure you cover his entire groin. Suddenly, he moans, his cock pulsing and twitching as gushes of hot cum burst from the tip and splatter down over his chest. The door to the kitchen bursts open, and the gator looks in to see the jizz dripping down the squirrel's chest. \"What is this?! I told you CLOSE, not all the way! The meal is ruined!\", he says furiously.</p>He kicks you out of the restaurant without pay. As you go, he bellows that you'll never work in this town again.",
                "outcomes":[
                   {
                      "parameter":"outcast",
                      "quantity":1,
                      "change":"add"
                   }
                ]
             }
          }
       },
       {
          "id":"mudlark",
          "title":"Go Mudlarking",
          "subtitle":"The thick mud of the slow-moving river is known for hiding many lost treasures. It's dirty work, though",
          "type":"statcheck",
          "stat":"charm",
          "difficulty":25,
          "requirements":[
             {
                "parameter":"outcast",
                "value":2,
                "comparison":"less"
             }
          ],
          "icon":"tffetish",
          "results":{
             "success":{
                "text":"Mudlarking is a traditional pastime in Glowscale. Down-on-their-luck or just optimistic individuals will wade into the deep sticky mud on the banks of the river, and search for items of value. Sometimes people get really lucky, and find jewelry or gold. Usually they consider themselves fortunate if they just find some edible roots.</p>You take off your shoes, and carefully slide your feet into the muddy banks. The thick, warm mud sucks down on you as your legs sink into the wet goopy soil. You then begin wading out near the water, and dig your hands through the mud, slowly pushing against it and getting yourself caked in dirt as you look for anything you can pull up out of the mud. You continue like this for quite some time, gradually getting more frustrated, when you bump into someone else, who's half buried in mud and you didn't see in time. He bobs up to the surface, and you see two large blinking eyes, before the mud slides off him to reveal a large, chubby green frog. \"Ah! Well hello there! Here to enjoy the mud, are you?\", he asks.</p>You explain that you're actually looking around in the mud for valuable items that you can sell. He rubs his round, smooth belly and leans back in the mud, letting himself sink a little into it as he lifts his enormous webbed feet. \"But friend, the mud is so cool and relaxing. Feel it oozing around your skin, don't you just want to relax and enjoy it, and forget your worries?\", he says in a crooning, sing-song voice. Fortunately, you keep your wits about you, and argue back with him. You explain that he'll be able to enjoy his mud much more if you take out all the hard objects and shiny trash that are ruining the smooth, slimy mud. He seems pleased that you appreciate the value of a good swampy mudbath. \"Ah, friend, you are a protector of the mud, so I shall assist you\", he says. He sinks down into the mud for a moment, with only slow large bubbles appearing where he vanished. Shortly afterwards, he bobs up again behind you, with a massive grin on his wide, fat green face. \"Tada, all the loot you can need, right here my friend!\", he says. You see that the mud around him is now glinting with goodies. You lean forward and reach your hands down into the mud, grabbing what you can. Your hands press against his round belly as you search around, and you feel his cold, slippery skin. Something thick and hard slips into your grasp, and you feel over it curiously. It throbs and tenses in your hand, and you look up to see the frog grinning even wider. His enormous tongue slides from his mouth, and wraps around your face for a moment as he squeezes you with it in a bizarre kiss, before he chuckles and sinks down into the mud to disappear again.",
                "outcomes":[
                   {
                      "parameter":"time",
                      "quantity":1,
                      "change":"add"
                   }
                ]
             },
             "fail":{
                "text":"Mudlarking is a traditional pastime in Glowscale. Down-on-their-luck or just optimistic individuals will wade into the deep sticky mud on the banks of the river, and search for items of value. Sometimes people get really lucky, and find jewelry or gold. Usually they consider themselves fortunate if they just find some edible roots.</p>You take off your shoes, and carefully slide your feet into the muddy banks. The thick, warm mud sucks down on you as your legs sink into the wet goopy soil. You then begin wading out near the water, and dig your hands through the mud, slowly pushing against it and getting yourself caked in dirt as you look for anything you can pull up out of the mud. You continue like this for quite some time, gradually getting more frustrated, when you bump into someone else, who's half buried in mud and you didn't see in time. He bobs up to the surface, and you see two large blinking eyes, before the mud slides off him to reveal a large, chubby green frog. \"Ah! Well hello there! Here to enjoy the mud, are you?\", he asks.</p>You explain that you're actually looking around in the mud for valuable items that you can sell. He rubs his round, smooth belly and leans back in the mud, letting himself sink a little into it as he lifts his enormous webbed feet.</p>\"But friend, the mud is so cool and relaxing. Feel it oozing around your skin, don't you just want to relax and enjoy it, and forget your worries?\", he says in a crooning, sing-song voice. You look at his huge glowing eyes, and his massive grin, and start to feel a little dizzy. \"Just relaaax. It's so easy in the mud. No worries or cares!\", he says. You start to lean back, letting the slippery slimy mud ooze up over your chest. \"Yes, friend, yes. Feel the pleasure of the mud\", he continues. You find yourself lying on your back, slowly sinking into the mud, feeling it oozing up around your sides and cheeks. The frog emerges in front of you with a wet sucking sound, and stands up. His belly is huge and round, and his body is slippery and smooth. He leans down on top of you, his fat green body pushing you in further to the mud, as his wide face touches to yours. Your vision fades as you see only his glowing eyes, and you both sink into the dark mud.</p>In the sticky, slimy darkness, you feel him wrapping his arms around you. His huge tongue slides out from his throat, wrapping slowly around your chest and neck like a thick wet snake. The bulging tip of it forces its way into your mouth, and oozes over your own tongue. You find that you don't have to struggle to breathe like you expected. Instead of being scary, the dark mud feels relaxing and pleasant. The frog squeezes you firmly against his round belly, and you feel his cock starting to emerge from between his legs. It is just as slippery as the rest of him, and it slides up between both your chests, as he starts to hump and thrust against you. His cock rubs up over your chest, up and down, oozing more and more slimy pre that seems to almost spread over your body. Your skin feels smooth and soft, and you feel your body becoming shorter and fatter as the frog holds you. Your head widens, your mouth stretching out while your tongue starts to wrap and writhe around the frog's one. It lengthens and stretches, intertwining with his, while your feet begin to ache and stretch, becoming longer and wider. Your toes stretch out, and webs begin to form between them. Your hair falls off, pushed away by the slime and mud, leaving you green and slippery all over.</p>Finally, the frog burbles and croaks, his neck bulging and expanding as it presses against you. Somehow, you find this incredibly handsome, and you feel your own neck inflate like a balloon too, letting out your own loud ribbit. His thick cock starts to buck and tense, as it unloads thick, slime-covered white orbs all over your belly. He pulls his tongue out from your mouth, and kicks his legs, swimming away from you through the mud. \"Au revouir friend!\", he croaks as he vanishes. You pull yourself free from the mud and climb up onto the riverbank, looking down at your mud-covered slimy frog body. It takes you hours to pull off all his sticky glue-like frogspawn from your body and toss the fist-sized eggs into the river, and your dirty state does your reputation no favours.",
                "descriptionchange":"This adventurer is a chubby short frog with slippery green skin and a round belly.",
                "outcomes":[
                   {
                      "parameter":"outcast",
                      "quantity":1,
                      "change":"add"
                   },
                   {
                      "parameter":"species",
                      "quantity":30,
                      "change":"set"
                   }
                ]
             }
          }
       },
       {
          "id":"zombie",
          "title":"The Zombies of Glowscale",
          "subtitle":"Glowscale is famous for its dark wizards, and equally so for the strange undead creatures they create",
          "type":"statcheck",
          "stat":"charm",
          "difficulty":20,
          "requirements":[
             {
                "parameter":"outcast",
                "value":2,
                "comparison":"less"
             }
          ],
          "icon":"default",
          "results":{
             "success":{
                "text":"You ask around town about whether there's any work to be had, but most people are too busy heading off to prepare for a festival to speak with you. As you wander the confusing narrow streets of the city, you eventually find your way to a darker, less well-lit section of the city. This area has no charming colourful lights and no fanciful tiles on the street. It's muddy and narrow, and the buildings are quiet, with broken windows and boarded up doors.</p>You are stopped by a gruff, guttural voice from the shadow of a doorway. \"Hey. Hear you're looking for work\", he says. You look over, but you can only see a hulking silhouetted form. Only his feet are visible, poking out from the edge of the doorway and dimly lit by the moon. He has enormous clawed paws, with thick full pads on the bottom, overly long unkempt claws, and ashy grey fur. The bottoms of his pants are ragged and torn. You nervously say that yes, you need to make some money. The creature pauses for a moment, and then reaches out a huge clawed hand to drop a sack into your grip. You look down at the opening of the sack and see a number of roughly-made cotton figures. \"Sell these for me. No one will talk to someone like me. You can have half the cash. But sell them all. Or I'll take...something else.\", he says. You gulp, and nod, wanting to get out of there and away from the unsettling person, and his musty, dirty smell. When he doesn't respond, you quickly go back the way you came, to the lights of the main street.</p>Selling the figures isn't as hard as you expected. There are many people visiting for the festival, and most of them are drunk. Some mysterious Glowscale items are exactly what they're looking for, and it doesn't take much convincing to get them to fork over the cash. Before you know it, the sack is empty and you have made a reasonable, if not particularly impressive, profit. You consider just not returning to the creature, but the thought of it stalking after you in the night to get its money back is unsettling enough to make you want to hold up your end of the bargain. You gradually find your way back down to the run-down part of the city, and start looking for him. You eventually recognise the doorway he was sitting in, but you almost walk right past it, because even when you know what you're looking for, you can't sense any sort of living creature around. You hand over the money, and he looks at it with surprise. \"Thank you. Most people just...run away\", he says. From the slow way he talks, it almost seems like it is an uncomfortable struggle to speak. You feel a little sorry for him. You're not sure why, but you reach forward and place your hand carefully on his footpaw. He pulls it away in surprise, and as he does so, you get a closer look at him. He's a huge, shaggy badger, almost seven feet tall. His fur is ragged and unkempt, and his teeth and claws are yellowed and long. His body was ice-cold to the touch, and there are rough, scarred seams around his joints. He goes very quiet, and eventually you just back away, and say a nervous goodbye before leaving. You are not sure if you imagine it, but you think he says \"Thank you\" quietly as you go.",
                "outcomes":[
                   {
                      "parameter":"time",
                      "quantity":1,
                      "change":"add"
                   }
                ]
             },
             "fail":{
                "text":"You ask around town about whether there's any work to be had, but most people are too busy heading off to prepare for a festival to speak with you. As you wander the confusing narrow streets of the city, you eventually find your way to a darker, less well-lit section of the city. This area has no charming colourful lights and no fanciful tiles on the street. It's muddy and narrow, and the buildings are quiet, with broken windows and boarded up doors.</p>You are stopped by a gruff, guttural voice from the shadow of a doorway. \"Hey. Hear you're looking for work\", he says. You look over, but you can only see a hulking silhouetted form. Only his feet are visible, poking out from the edge of the doorway and dimly lit by the moon. He has enormous clawed paws, with thick full pads on the bottom, overly long unkempt claws, and ashy grey fur. The bottoms of his pants are ragged and torn. You nervously say that yes, you need to make some money. The creature pauses for a moment, and then reaches out a huge clawed hand to drop a sack into your grip. You look down at the opening of the sack and see a number of roughly-made cotton figures. \"Sell these for me. No one will talk to someone like me. You can have half the cash. But sell them all. Or I'll take...something else.\", he says. You gulp, and nod, wanting to get out of there and away from the unsettling person, and his musty, dirty smell. When he doesn't respond, you quickly go back the way you came, to the lights of the main street.</p>Unfortunately, the drunken revellers that are walking through the city are too busy heading for casinos or bars to listen to some street urchin selling toys. Despite your best efforts, no one is interested, and soon it gets late into the night, and the streets empty out. You consider just not returning to the creature, but the thought of it stalking after you in the night to get its money back is unsettling enough to make you want to hold up your end of the bargain. You gradually find your way back down to the run-down part of the city, and start looking for him, hoping that you can ask for more time or get leniency. As you're wandering through a narrow alleyway, you hear his deep voice behind you. \"Here\", he says. You turn to see him looking at you from around a corner, still carefully staying out of the light. You try to explain what happened, and you notice that he's incredibly quiet despite his size. He doesn't even make a sound when he breathes. \"Something...else...\", he growls, and you gulp. \"Want you to...hold me\", he finishes, with difficulty.</p>You gulp, but slowly and nervously approach. He backs away into the darkness of the doorframe again. You get closer, until your hands are pressed against his chest, and finally you get a good look at him. He is a rough, and badly scarred, badger. His enormous hulking body is covered in shaggy, unkempt fur, that is tangled and matted. His claws and teeth are long and yellow, and his fur is a strange, almost pale green shade. All over his body, thick ragged scars criss-cross his limbs. His long, rough face is pulled up into a permanent snarl from a terrible scar, and his body is ice cold under your grip. He wraps his enormous arms slowly around you, and pulls you in close to him. His tattered shirt and pants are practically rags, and he smells musty and strange, like old clothes abandoned in a closet. You try to push past your fear, and stroke your hands up through his chest fur. He leans down, pressing the side of his striped head to yours, and sighs in a slow, long breath. You begin to feel very cold. Your fingers and toes feel numb, and you are breathing slower. His body, however, starts to warm up. You feel his chest, which has been silent and still, slowly rise and fall as he begins to breathe. There is a loud, slow thump as his heart beats. He squeezes you tightly, holding you like a teddy bear, and your vision starts to blur as you feel weak and limp. Suddenly, he jerks away, dropping you and stepping back. Your body heat returns, and you cough as you slowly pull yourself to your knees. He pants and shudders. \"Sorry. Too much\", he says, before lumbering away into the dark.</p>When you return to the main part of town, a few people mockingly say that you smell like a zombie.",
                "outcomes":[
                   {
                      "parameter":"outcast",
                      "quantity":1,
                      "change":"add"
                   }
                ]
             }
          }
       },
       {
          "id":"outcasted",
          "title":"A Bad Reputation",
          "subtitle":"You have screwed up and made a fool of yourself so often that no one is going to make a fuss if you go missing, like so many unfortunate visitors to this dark city.",
          "type":"random",
          "requirements":[
             {
                "parameter":"outcast",
                "value":1,
                "comparison":"greater"
             }
          ],
          "icon":"outcast",
          "results":{
             "success":{
                "text":"Tonight feels different than usual. You are wandering the streets, looking for work like you normally do, but there are fewer people around, and you feel like the shadows are deeper and darker than they would normally be. You walk more cautiously, the back of your neck tingling with a peculiar apprehension. The sounds of the city around you get more quiet, and you notice fog starting to form, flowing out from the alleyways like vaporous tentacles and gradually making the air grey and muted. You start to walk faster, and you think you can hear a faint, unsettling rattling sound, getting closer and louder.</p>\"Lost, are you?\", a voice says from right behind you. You turn and stumble on the wet ground, but a pair of large scaly hands catch you and hold you steady. You find yourself looking up into the eyes of a tall black-scaled snake man. His body is muscular and firm, but slender, with long black legs and a thick snake tail curving around behind him, tipped with a glowing, curved rattle.</p>His tail twitches, rattling again, with a creepy echoing sound. It makes you think of a shaman's ritual. Whenever you look away or move back, his strong hands adjust your head, move your vision back up to his huge grinning face, and those deep, dark eyes.</p>\"Why be so nervous, traveller? Just relax. You want to relax, don't you?\" he says. His tail rattles again, punctuating each sentence. The sound echoing in your head. \"I can help you. I feel your fear, and confusion. Such a scared, lost little lamb.\" Rattle. Rattle. \"Don't you want me to help you? I can make it so you have no worries, no cares. Only true sense of purpose, a place to belong.\"</p>You feel dizzy and confused. Any time you try to think straight, that rattling sound rattles your brain, and you lose track of your thoughts. You do know that you are lost. You want to go home. He strokes his hand across your cheek and pulls you closer to his bare chest. You feel his arms wrap around you. \"Yes, scared, and lost. You need help. You want to come home, isn't that right?\", he whispers. You slowly nod. Yes, you need to go home. \"Come home to me, then. Come back to where you belong\", he says, his mouth mere inches from your ear. Your fingers, pressed against his chest, start to grow longer. You feel your fingertips bulging too, and your skin feels dry and smooth. The snake strokes his hand down your head, as your face stretches out slightly, forming a smooth, streamlined muzzle. Your eyes get wider, and his hand strokes further down your body, making your chest start to tighten and become thin and long. Your rear pushes out, as a tail begins to form. It gets longer, thinning towards the end, as it stretches out behind you. Your feet splay out on the cold ground, toes getting longer, and skin turning to smooth scaly flesh.</p>You realise you are much shorter now, and you cling closer to the snake, feeling strangely attached to him. \"Yes, my little salamander. So cute, so obedient. Wouldn't it be nice to rely on me completely? To have no will, no worries. No need to make your own decisions. Simply knowing that you will obey me, and live alongside me forever?\", he says. You nod. That sounds nice. Going home with your master, no more being confused. Glowing lights start to appear on the snakes arms, flowing down like tendrils before sliding out from his hands. They wrap around you, and stroke over your skin. Your fingertips feel light and strange. They start to turn orange, and then glow. The colour becoming almost neon, while they feel light and insubstantial. The snake strokes your head as the colour begins to flow down your hands, becoming neon green as your hands and arms grow light and foggy, disappearing and leaving only light. \"It feels good, doesn't it? No more need for a body. No need for your own magic or spirit. Submit yourself to me. Let my magic replace your own existence. Become just a part of me, a construct of my power. My beloved obedient familiar\", your master says.</p>You nod, and press closer into him. You want this, you want to give up your body, sacrifice it and replace it with his essence. The light flows faster, making patterns and swirls down your body. As it spirals around your tail, the skin and flesh turns to fog and melts away into the air, leaving only a stylised glowing swirl of light. Your legs start to feel weak and faint, and your master holds you up as they vanish, turning into a glowing green pattern shaped like a salamander's feet. Your chest feels like vapour, and you are no longer breathing. Your very essence is becoming just a spell, a magical pattern. You look up at your master as you feel your body disappear, and your head start to vanish. Your very mind links with his. You understand his wants and needs, your thoughts are his thoughts. Your will disappears as your every action and thought becomes an extension of your master's mind, the same as if he was just imagining you. Finally, you are left floating in front of him, as a glowing pattern of lights in the shape of a salamander. He waves his hand, and you plunge forward into his chest, feeling his skin against you as you become a beautiful tattoo across his right pec. Ready to be summoned whenever he needs you, with just a shake of his rattle.",
                "trapped_desc":"There is a floating, glowing salamander here made of glowing colourful lights.",
                "trapped":"You are a sorceror's familiar, a magical salamander that must obey your master's every desire. Your spirit is entwined with his, and you will never escape.",
                "outcomes":[
                   
                ]
             }
          }
       },
       {
          "id":"savemebat",
          "trapped":true,
          "title":"Is There Anything To Save?",
          "subtitle":"Your master has a strange guest today. A tall back in a black top hat, who somehow entered his store without making a sound or seemingly, even opening the door.",
          "type":"random",
          "requirements":[
             
          ],
          "icon":"mrbat",
          "results":{
             "rareSuccess":{
                "text":"Your master turns, and you feel his surprise as his tail rattles. You were organising the bottles and jars of herbs in his store, but when you sense a disturbance, you rush through the wall and float behind him. There's a stranger in the store, a bat wearing expensive Dormaus-style clothes. You don't recognise him at all, as your only knowledge and memories are from your master's mind. The bat bows. \"Esteemed sorceror, I have been looking for you. I would, if I may be so bold, very much like to purchase your familiar from you\", the bat says.</p>Your master sneers, and starts to twitch his tail left and right. The rattling sound of his ritual magic echoes through the room. \"I'm sorry, dear guest. My familiar is not for sale. You may not be aware of how magic works, but a familiar cannot be parted from its master once attuned. Perhaps I could offer you something else? You must have travelled far. You must be tired, and sleepy. You could rest here, and-\" your master is suddenly interrupted when the bat stretches his wings and flaps them slightly. A rush of wind blows through the room, and the built-up magic dissipates instantly. Your master snarls. He leaps back, takes a defensive posture, and flings a bolt of searing agony-spell towards the bat. It splashes off him like rain hitting a cliff. The bat walks forward, ignoring bolts of fire, rains of acid, spell after spell your master throws with increasing desperation. You feel his fear starting to grow, and you tremble. Then, the bat simply reaches forward and wraps his hand around you. You thrash and panic. You're made of magic! People can't just grab you! Yet the bat simply pulls, and tugs, and you whimper and cry as your bond with your master is broken like tearing flesh from a cooked roast. The serpent falls to his knees in shock, and the bat leaves without a word.</p>Outside the shop, the bat releases you. Your colour is fading as your magical essence starts to unravel. With a wave of his hand, you start to feel firm, and strange. Magic turns to flesh, a mind of your own starts to form. You fall to the ground, as gravity takes hold of you. Your body reforms and your memories return. When you look up, the bat is gone.",
                "freeTrap":true,
                "outcomes":[
                   {
                      "parameter":"outcast",
                      "quantity":0,
                      "change":"set"
                   }
                ]
             }
          }
       },
       {
          "id":"nextfromglow",
          "title":"My Puppet Mon Amie",
          "subtitle":"The river is bare of boats and crafts right now, and the sun is weakly casting the last rays of sunset over the water. You are despairing about how you are ever going to get out of here, when you realise there is someone standing next to you. You jump in surprise and step back, then look up to the creature. It's an enormously tall alligator, his belly a huge round ball so big it could hold a horse. His scales are a deep, dark green that is almost black, but they are coated in stripes of paint that glows a strange and shimmering pink and green in the darkness. He must weight over a ton, yet he moved so quietly that you didn't notice him at all. </p>He brushes his waistcoat, and dips his top hat politely. \"Mon chéri, I thought I heard the lamentations of the lost. It calls to me, you see\", he says. His voice is smooth and friendly, not at all what you would expect from such a terrifying monster of a reptile. \"You are lost, and looking to travel. I can tell from your eyes, ma petite. Alas, chacun voit midi à sa porte. If you help me, I will help you, yes? I have much work that needs doing as I travel north. Perhaps you could join me?\"</p>You don't see many other options, but something about the gator gives you a feeling of supernatural dread. Do you take him up on his offer?",
          "type":"random",
          "requirements":[
             {
                "parameter":"time",
                "value":1,
                "comparison":"greater"
             },
             {
                "parameter":"outcast",
                "value":2,
                "comparison":"less"
             }
          ],
          "icon":"navigateicon",
          "results":{
             "grizzsex":{
                "text":"The gator smiles when you agree. It is a slow smile, and it takes a very long time for his muzzle to stretch all the way down the many rows of his enormous teeth. \"I am so glad we could come to an arrangement. Now, look into my eyes. Un petit peu plus...oiu, just like that\", he says. You don't remember actually lifting your head to look into his eyes, but you are definitely doing so. They are beautiful eyes. Glowing rings of fluorescent pink and green, pulsing and swirling in an endless swirl of colour and feeling. The rings of light seem to be washing over you, almost like they are surrounding you and binding you up. Your body moves forward, and you seem to be falling, falling. Deeper and deeper into that light, the rings forming a tunnel for you to fall forever. </p>You are distantly aware that you are walking along the docks. You can feel yourself lifting boxes and placing them in a long boat that is painted in those same glowing colours. There are other people too, moving with jerky unnatural movements as they help to load up the cargo. Your body strains with the weight, and is exhausted by the amount of cargo that needs to be hauled and tied down, but it's a very distant feeling. It's like you are just watching these events on a screen, not like you are really the ones doing them. Even when you find yourself tying up struggling people, locking them in chains, and forcing them onto the boat, you can't do anything about it. You are trapped inside your own head, watching a movie of these events, and the projectionist is that unstoppable, glowing alligator.</p>Once all the cargo is loaded, you step onto the boat, and feel it rock in the water. You and the other workers line up in a row, and suddenly the alligator is there. He looks over you all.</p>\"Oui oui, now I did say I would take you all north. And I promise I will. Every one of you will be there when I step off this boat.\" he says, before walking along the row of stiff, entranced workers. He stops just in front of you, then opens his enormous maw, and slowly slides it down over the worker ahead of you in line. The human stands obediently and lifelessly as the alligator swallows him up, before the gator lifts his head up and gulps down the human's legs. He burps, and says \"More or less.\" You cannot even yell or react. Your body is totally under his control. </p></p>For days, you work on the boat, cleaning and washing the deck, checking the sails, dusting the rooms. Each day, the alligator lines you all up, and devours another worker whole. Every time it happens, you know you have a higher chance of being next. By the end of the week, it is only you and one other person left. The gator's belly has become enormous from his many live meals, and it jiggles and bounces when he walks. The boat docks at a small port, and the alligator makes you both unload the cargo and tie it up. Your body is aching all over from having to do the work with just the two of you. You are sure that if you weren't being manipulated like a puppet, you would collapse. </p>When it is done, the alligator stands you both before him, and looks down at you with his gleaming eyes. From one to the other, grinning as he chooses...you. His scaly finger points to you, and he sits down, drawing you closer...before he says \"Rub my belly, s'il vous plaît.\"</p>Your body leans forward, and you rub and stroke his heavy gut. You are staring only at his soft belly scales, so you don't see him eating the other worker. You can hear it though, and feel the man's struggles as he goes down. The gator chuckles, and ruffles your hair. \"Travel north for a day and night, mon chéri. There you will find your next stop, and there I will free you from your bindings. Until next we meet...\" he whispers. You stand, turn, and march like a zombie up the road, leaving the gator behind. Only hours later, when you finally collapse in front of a small dusty town, do you regain control of yourself. You shiver for a moment, resolving never again to encounter that nightmarish reptile.",
                "area":"lionquest_westwood",
                "outcomes":[
                   {
                      "parameter":"time",
                      "quantity":0,
                      "change":"set"
                   }
                ]
             }
          }
       }
    ],
    "npcs":[
       
    ]
 }