{
    "title":"makarna_DESERT_OASIS",
    "nomap":"You have no map of this vast, dangerous land.",
    "header":"Desert Oasis",
    "subheader":"You have come to a beautiful oasis, a peaceful respite in this deadly desert. The sapphire-blue waters gleam in the sun, and trees cluster around it greedily.",
    "events":[
       {
          "id":"tarragon",
          "title":"A Resting Elephant",
          "subtitle":"There is someone else at the oasis, a warrior of some kind who is pulling off his armour. (Warning: Extreme musk kink ahead)",
          "type":"random",
          "requirements":[
            
          ],
          "icon":"pawmusk",
          "results":{
             "thing":{
                "html":"data/active/ElephantOasis.html",
                "outcomes":[
                   
                ]
             }
          }
       },
	   
	   
	   {
          "id":"refill_flask",
          "title":"Gather Water",
          "subtitle":"You can gather up the fresh water here and refill your canteens.",
          "type":"random",
          "requirements":[
            {
               "parameter":"canteen_empty",
               "value":0,
               "comparison":"greater"
            }
          ],
          "icon":"navigateicon",
          "results":{
             "success":{
                "text":"You dunk your empty canteen into the crystal clear water, filling it up with a glug. It takes barely a few minutes for the hot air to dry off your hand.",
                "outcomes":[
                  {
                     "parameter":"canteen_empty",
                     "quantity":1,
                     "change":"sub"
                  },
				  {
                     "parameter":"canteen_full",
                     "quantity":1,
                     "change":"add"
                  }
                ]
             }
          }
       },
	   
	   {
         "id":"W_careful",
         "title":"WEST: Cross the Savannah Carefully",
         "subtitle":"If you use extra supplies and take it slow, you can travel through the desert with a minimum of danger.",
         "type":"statcheck",
         "stat":"might",
         "difficulty":30,
         "requirements":[
            {
               "parameter":"desert_supplies",
               "value":2,
               "comparison":"greater"
            }
         ],
         "icon":"navigateicon",
         "results":{
            "success":{
               "text":"Makarna is a vast country, and one that has claimed the lives of many foolhardy adventurers who underestimated its dangers. You wisely decide to take it slow, and begin your travels across the dunes and plains.</p></p>When the sun reaches its zenith, and the heat is too great, you take shelter in what little shade you can find, and ration your water carefully. You move on only when the heat's edge dulls. Your feet slip on sandy dunes, and sweat soaks your clothes, but you make good progress.",
               "area":"makarna_DESERT_B2",
               "outcomes":[
                  {
                     "parameter":"desert_supplies",
                     "quantity":3,
                     "change":"sub"
                  }
               ]
            },
			"rareSuccess":{
               "text":"Makarna is a vast country, and one that has claimed the lives of many foolhardy adventurers who underestimated its dangers. You wisely decide to take it slow, and begin your travels across the dunes and plains.</p></p>You make great progress. You ration your water carefully, and find that you are surprisingly adept at walking over sandy dunes and through arid, cracked land. The sun slowly lowers in the sky, and the purple of night washes above you as the last of the daylight fades.</p></p>Stars twinkle above you, countless gleaming diamonds in a seemingly endless expanse of velvet black. The sky extended from horizon to horizon, unbroken and infinite. The vastness of it in the dark desert is beautiful, and strange. Your mind wants to expand, to fill the endless space.</p></p>You carry on your journey, but feel oddly changed by your experience.",
               "area":"makarna_DESERT_B2",
               "outcomes":[
                  {
                     "parameter":"desert_supplies",
                     "quantity":2,
                     "change":"sub"
                  },
				  {
                     "parameter":"might",
                     "quantity":2,
                     "change":"add"
                  },
				  {
                     "parameter":"magic",
                     "quantity":2,
                     "change":"add"
                  },
				  {
                     "parameter":"charm",
                     "quantity":2,
                     "change":"add"
                  },
				  {
                     "parameter":"stealth",
                     "quantity":2,
                     "change":"add"
                  }
               ]
            },
            "fail":{
               "text":"Makarna is a vast and dangerous country. You don't want to take chances, so you take it slow. You travel only when the heat isn't too unbearable, and you drink your water supplies liberally.</p></p>However, even taking it slow is difficult. You may have underestimated just how harsh Makarna really is. Your skin burns from the heat, and your mouth feels dry and parched. Your legs ache from slipping and sliding on the sandy dunes. You can't possibly keep this up for long.",
               "area":"makarna_DESERT_B2",
			   "outcomes":[
                  {
                     "parameter":"desert_supplies",
                     "quantity":3,
                     "change":"sub"
                  },
				  {
                     "parameter":"pain",
                     "quantity":1,
                     "change":"add"
                  }
               ]
            },
			"rareFail":{
               "text":"Makarna is a vast and dangerous country. You don't want to take chances, so you take it slow. You travel only when the heat isn't too unbearable, and you drink your water supplies liberally.</p></p>Perhaps a little too liberally, as it turns out. The unbearable heat is making you desperate to chug down more and more. You find yourself taking breaks, setting up camp over and over after barely making any progress, just for an excuse to have some shade.</p></p>Perhaps Makarnan travel is not for you. To your dismay, you feel exhausted and battered, and you've blown through an unreasonable amount of your supplies.",
               "area":"makarna_DESERT_B2",
			   "outcomes":[
                  {
                     "parameter":"desert_supplies",
                     "quantity":5,
                     "change":"sub"
                  },
				  {
                     "parameter":"pain",
                     "quantity":2,
                     "change":"add"
                  }
               ]
            }
         }
      },
	  {
         "id":"W_fast",
         "title":"WEST: Cross the Savannah Rapidly",
         "subtitle":"You can save supplies if you are confident in your skills.",
         "type":"statcheck",
         "stat":"might",
         "difficulty":50,
         "requirements":[
            {
               "parameter":"desert_supplies",
               "value":1,
               "comparison":"greater"
            }
         ],
         "icon":"navigateicon",
         "results":{
            "success":{
               "text":"Makarna is a dangerous country, but you are an experienced traveller. If you ration your water very carefully, and use your knowledge of the land well, you can save your supplies and reach your destination in a much shorter time.</p></p>You move with the wind, and keep a weather eye on the sky. You detect sandstorms long before they reach you, and are able to find shelter from them. You scavenge small plants, find easier paths between dunes, and at one point even walk beneath the shadow of a small cloud for over a mile before it disappears.</p></p>You are tired and your muscles are sore when you reach your destination, but you know you could do this again. You truly are an experienced adventurer.",
               "area":"makarna_DESERT_B2",
               "outcomes":[
                  {
                     "parameter":"desert_supplies",
                     "quantity":2,
                     "change":"sub"
                  }
               ]
            },
			"rareSuccess":{
               "text":"Makarna is a dangerous country, but you are an experienced traveller. If you ration your water very carefully, and use your knowledge of the land well, you can save your supplies and reach your destination in a much shorter time.</p></p>You move with the wind, and keep a weather eye on the sky. You detect sandstorms long before they reach you, and are able to find shelter from them. You scavenge small plants, find easier paths between dunes, and at one point even walk beneath the shadow of a small cloud for over a mile before it disappears.</p></p>In fact, you don't even feel sore, or tired. You feel like you could wander through the desert like this forever. Like this is where you were meant to be. You climb to the top of a dune, and look out across the desert, seeing it stretch from horizon to horizon. An infinity of heat and dust, your kingdom, your territory.</p></p>Something inside you feels hot and intense. You shudder, stretching up and feeling the sun bear down on you. Why do you even need clothes? You are better off without them.</p></p>You pull off your shirt and pants, tossing aside your protection from the sun. As you do, you notice your body seems bigger, stronger. Not so much bulging with muscle, but lean and powerful, like a predator.</p></p>You flex your hands, and notice your palms are thicker and rounder than before. Dark brown pads cover them, and when you lift your feet, you notice you have them there too. Oddly, this doesn't seem unnatural. It just makes it easier to walk on the hot sand.</p></p>You leap down from the dune, before landing on all fours and bounding across the desert. Running like this feels freeing, natural. Your muscles bulge and heave, sweat drips down your flanks. As you run, your spine begins to change, stretching out and growing. It thickens into a long tail behind you, the weight of it making it easier for you to run, to glide across the sand. At the end of your thick, muscular tail, sharp fins stretch out, capable of cutting through solid rock. A think layer of brown-grey fur begins to cover your naked body, reflecting the heat and making you feel even more at home.</p></p>You snort, your head feeling larger, heavier, but your mind feeling oddly small. When you open your mouth, it stretches into a muzzle, revealing massive fangs. You shake your head, and the weight grows heavier, as thick horns push forward from your temples, and curve up in front of you. A thick mohawk of tough fur bristles from your head and down your powerful neck.</p></p>Yes, you are a true beast of the desert. The heat and sand is no danger to you. You are a danger to everything else!</p>",
               "descriptionchange":"You are a behemoth, a rare and dangerous desert-dwelling predator. You are huge, covered in short fur and capable of walking on four paws or on your hind legs. You have a large lionlike face, two ox-like horns, and a thick muscular tail tipped by two razor-sharp fins.",
			   "area":"makarna_DESERT_B2",
               "outcomes":[
                  {
                     "parameter":"might",
                     "quantity":10,
                     "change":"add"
                  },
				  {
                     "parameter":"magic",
                     "quantity":10,
                     "change":"sub"
                  },
				  {
                      "parameter":"species",
                      "quantity":68,
                      "change":"set"
                  }
               ]
            },
            "fail":{
               "text":"Makarna is dangerous, but surely so are you? You are confident enough in your skills that you see no need to overuse your supplies and waste time and money.</p></p>You set off across the dunes, making good progress at first. You push yourself hard, at one point sliding down a long dune and laughing at the progress you're making.</p></p>Your confidence is unearned, however. Your weather luck turns, and you don't see the mist-like cloud in the distance until it is already upon you. You are caught in a sandstorm, and it rages around you.</p></p>The sand that seemed so soft under your feet is now like blades across your skin. You cannot see, and you are parched, pained and exhausted. You struggle to find shelter, and barely manage to wedge yourself in the lee of a rock before you are totally overwhelmed.</p></p>When the storm passes, you are forced to patch yourself up and use up much of your supplies to get yourself back in travelling shape. Perhaps you overestimated your own skills.",
               "area":"makarna_DESERT_B2",
			   "outcomes":[
                  {
                     "parameter":"desert_supplies",
                     "quantity":4,
                     "change":"sub"
                  },
				  {
                     "parameter":"pain",
                     "quantity":3,
                     "change":"add"
                  }
               ]
            },
			"rareFail":{
               "text":"Makarna is dangerous, but surely so are you? You are confident enough in your skills that you see no need to overuse your supplies and waste time and money.</p></p>You set off across the dunes, making good progress at first. You push yourself hard, at one point sliding down a long dune and laughing at the progress you're making.</p></p>Your confidence is unearned, however. Your weather luck turns, and you don't see the mist-like cloud in the distance until it is already upon you. You are caught in a sandstorm, and it rages around you.</p></p>The sand that seemed so soft under your feet is now like blades across your skin. You cannot see, and you are parched, pained and exhausted. You struggle through the storm, desperately seeking shelter or escape, but find none.</p></p>You bump into something, and try desperately with your stinging eyes to see what it is. A tall, imposing shadow looms over you. Red eyes gleam in the storm. The whirling sands abate slightly, as something wraps a pair of enormous arms around you.</p></p>You are able to look up, and see a bizarre creature. It is made of craggy red stone, very loosely in a humanoid shape. It is mostly just a huge boulder, with stubby clawed feet and a pair of massive arms that rumble and thump as they move.</p></p>Its eyes are two red gems, embedded in the stone. Sand tumbles from its surface as it stares at you.</p></p>\"Give...me...\"</p></p>You feel weak all over, your body aching as the eyes glow. Your supplies and treasure fall from your hands, as you fall forward onto your knees.</p></p>\"Give...life...\"</p></p>Your hands hit the sand, and your body feels numb, and heavy. You feel stiff all over, barely able to move a muscle. Weight presses down on you, making your hands and knees sink into the shifting sand.</p></p>Your skin starts to harden, growing rough and firm. It becomes craggy and rocky, all colour in your body being replaced by the orange-yellow of sandstone. Your hands fuse into lumps of rock, your insides seize up and petrify into stone. Finally, the features on your head fade over, your whole body becoming a lump of messy, weathered stone, indistinguishable from any other normal boulder in the desert.</p></p>The sandstorm slowly fades, and the rocky creature's eyes seem brighter and more alert. It lurches off into the desert, leaving nothing but stones where you used to be.",
               "trapped_desc":"You are nothing but ordinary desert rocks, a lump of boulders half-sunken in the sand.",
               "trapped":"You are nothing but ordinary desert rocks, a lump of boulders half-sunken in the sand.",
			   "area":"makarna_DESERT_B2",
			   "outcomes":[
                  {
                     "parameter":"desert_supplies",
                     "quantity":0,
                     "change":"set"
                  },
				  {
                     "parameter":"desert_treasure",
                     "quantity":0,
                     "change":"set"
                  },
				  {
                      "parameter":"trapped",
                      "quantity":35,
                      "change":"set"
                   }
               ]
            }
         }
      },
	  {
          "id":"W_saurus",
          "title":"WEST: Ride Your Saurus",
          "subtitle":"You'll barely need any supplies with a saurus to do the difficult parts.",
          "type":"random",
          "requirements":[
            {
               "parameter":"desert_supplies",
               "value":0,
               "comparison":"greater"
            },
			{
               "parameter":"saurus",
               "value":0,
               "comparison":"greater"
            }
          ],
          "icon":"navigateicon",
          "results":{
             "success":{
                "text":"You pat your saurus, and he snorts at you. He lowers his head, and you hop on top of him. After a moment to get your bearings, he trots off across the sand at a gallop.</p></p>The desert speeds past you as your mount crunches forward, his powerful leg eating up distances in mere minutes that would have taken you hours. The only downside is that the jostling and bumping of his stride is causing no small amount of discomfort in your hindquarters.</p></p>You reach your destination in no time at all, and reward your saurus with some food and water.",
                "area":"makarna_DESERT_B2",
                "outcomes":[
                   {
                     "parameter":"desert_supplies",
                     "quantity":1,
                     "change":"sub"
                  }
                ]
             }
          }
       },
	   {
          "id":"W_dying",
          "title":"WEST: Travel Without Supplies",
          "subtitle":"A very unwise decision, and one that could mean your doom.",
          "type":"random",
          "requirements":[
            {
               "parameter":"pain",
               "value":5,
               "comparison":"less"
            },
			{
               "parameter":"desert_supplies",
               "value":3,
               "comparison":"less"
            }
          ],
          "icon":"navigateicon",
          "results":{
             "success":{
                "text":"There's no other option at this point. You are going to have to get as far as you can, even if your supplies have run dry.</p></p>You walk through the desert, trying to ignore your thirst. Mirages sway at the edges of your vision, tantalising you with water, moisture, shade. You focus on your steps, trudging forward one by one. Your feet sink in the sand, your body aches with discomfort.</p></p>Your mouth and throat are raw and dry from your thirst. Your lips feel cracked and painful, and your eyes burn. You cannot go on like this much longer.",
                "area":"makarna_DESERT_B2",
                "outcomes":[
                   {
                     "parameter":"pain",
                     "quantity":4,
                     "change":"add"
                  }
                ]
             }
          }
       },
	   
	   
	   {
         "id":"N_careful",
         "title":"NORTH: Cross the Savannah Carefully",
         "subtitle":"If you use extra supplies and take it slow, you can travel through the desert with a minimum of danger.",
         "type":"statcheck",
         "stat":"might",
         "difficulty":30,
         "requirements":[
            {
               "parameter":"desert_supplies",
               "value":2,
               "comparison":"greater"
            }
         ],
         "icon":"navigateicon",
         "results":{
            "success":{
               "text":"Makarna is a vast country, and one that has claimed the lives of many foolhardy adventurers who underestimated its dangers. You wisely decide to take it slow, and begin your travels across the dunes and plains.</p></p>When the sun reaches its zenith, and the heat is too great, you take shelter in what little shade you can find, and ration your water carefully. You move on only when the heat's edge dulls. Your feet slip on sandy dunes, and sweat soaks your clothes, but you make good progress.",
               "area":"makarna_DESERT_C1",
               "outcomes":[
                  {
                     "parameter":"desert_supplies",
                     "quantity":3,
                     "change":"sub"
                  }
               ]
            },
			"rareSuccess":{
               "text":"Makarna is a vast country, and one that has claimed the lives of many foolhardy adventurers who underestimated its dangers. You wisely decide to take it slow, and begin your travels across the dunes and plains.</p></p>You make great progress. You ration your water carefully, and find that you are surprisingly adept at walking over sandy dunes and through arid, cracked land. The sun slowly lowers in the sky, and the purple of night washes above you as the last of the daylight fades.</p></p>Stars twinkle above you, countless gleaming diamonds in a seemingly endless expanse of velvet black. The sky extended from horizon to horizon, unbroken and infinite. The vastness of it in the dark desert is beautiful, and strange. Your mind wants to expand, to fill the endless space.</p></p>You carry on your journey, but feel oddly changed by your experience.",
               "area":"makarna_DESERT_C1",
               "outcomes":[
                  {
                     "parameter":"desert_supplies",
                     "quantity":2,
                     "change":"sub"
                  },
				  {
                     "parameter":"might",
                     "quantity":2,
                     "change":"add"
                  },
				  {
                     "parameter":"magic",
                     "quantity":2,
                     "change":"add"
                  },
				  {
                     "parameter":"charm",
                     "quantity":2,
                     "change":"add"
                  },
				  {
                     "parameter":"stealth",
                     "quantity":2,
                     "change":"add"
                  }
               ]
            },
            "fail":{
               "text":"Makarna is a vast and dangerous country. You don't want to take chances, so you take it slow. You travel only when the heat isn't too unbearable, and you drink your water supplies liberally.</p></p>However, even taking it slow is difficult. You may have underestimated just how harsh Makarna really is. Your skin burns from the heat, and your mouth feels dry and parched. Your legs ache from slipping and sliding on the sandy dunes. You can't possibly keep this up for long.",
               "area":"makarna_DESERT_C1",
			   "outcomes":[
                  {
                     "parameter":"desert_supplies",
                     "quantity":3,
                     "change":"sub"
                  },
				  {
                     "parameter":"pain",
                     "quantity":1,
                     "change":"add"
                  }
               ]
            },
			"rareFail":{
               "text":"Makarna is a vast and dangerous country. You don't want to take chances, so you take it slow. You travel only when the heat isn't too unbearable, and you drink your water supplies liberally.</p></p>Perhaps a little too liberally, as it turns out. The unbearable heat is making you desperate to chug down more and more. You find yourself taking breaks, setting up camp over and over after barely making any progress, just for an excuse to have some shade.</p></p>Perhaps Makarnan travel is not for you. To your dismay, you feel exhausted and battered, and you've blown through an unreasonable amount of your supplies.",
               "area":"makarna_DESERT_C1",
			   "outcomes":[
                  {
                     "parameter":"desert_supplies",
                     "quantity":5,
                     "change":"sub"
                  },
				  {
                     "parameter":"pain",
                     "quantity":2,
                     "change":"add"
                  }
               ]
            }
         }
      },
	  {
         "id":"N_fast",
         "title":"NORTH: Cross the Savannah Rapidly",
         "subtitle":"You can save supplies if you are confident in your skills.",
         "type":"statcheck",
         "stat":"might",
         "difficulty":50,
         "requirements":[
            {
               "parameter":"desert_supplies",
               "value":1,
               "comparison":"greater"
            }
         ],
         "icon":"navigateicon",
         "results":{
            "success":{
               "text":"Makarna is a dangerous country, but you are an experienced traveller. If you ration your water very carefully, and use your knowledge of the land well, you can save your supplies and reach your destination in a much shorter time.</p></p>You move with the wind, and keep a weather eye on the sky. You detect sandstorms long before they reach you, and are able to find shelter from them. You scavenge small plants, find easier paths between dunes, and at one point even walk beneath the shadow of a small cloud for over a mile before it disappears.</p></p>You are tired and your muscles are sore when you reach your destination, but you know you could do this again. You truly are an experienced adventurer.",
               "area":"makarna_DESERT_C1",
               "outcomes":[
                  {
                     "parameter":"desert_supplies",
                     "quantity":2,
                     "change":"sub"
                  }
               ]
            },
			"rareSuccess":{
               "text":"Makarna is a dangerous country, but you are an experienced traveller. If you ration your water very carefully, and use your knowledge of the land well, you can save your supplies and reach your destination in a much shorter time.</p></p>You move with the wind, and keep a weather eye on the sky. You detect sandstorms long before they reach you, and are able to find shelter from them. You scavenge small plants, find easier paths between dunes, and at one point even walk beneath the shadow of a small cloud for over a mile before it disappears.</p></p>In fact, you don't even feel sore, or tired. You feel like you could wander through the desert like this forever. Like this is where you were meant to be. You climb to the top of a dune, and look out across the desert, seeing it stretch from horizon to horizon. An infinity of heat and dust, your kingdom, your territory.</p></p>Something inside you feels hot and intense. You shudder, stretching up and feeling the sun bear down on you. Why do you even need clothes? You are better off without them.</p></p>You pull off your shirt and pants, tossing aside your protection from the sun. As you do, you notice your body seems bigger, stronger. Not so much bulging with muscle, but lean and powerful, like a predator.</p></p>You flex your hands, and notice your palms are thicker and rounder than before. Dark brown pads cover them, and when you lift your feet, you notice you have them there too. Oddly, this doesn't seem unnatural. It just makes it easier to walk on the hot sand.</p></p>You leap down from the dune, before landing on all fours and bounding across the desert. Running like this feels freeing, natural. Your muscles bulge and heave, sweat drips down your flanks. As you run, your spine begins to change, stretching out and growing. It thickens into a long tail behind you, the weight of it making it easier for you to run, to glide across the sand. At the end of your thick, muscular tail, sharp fins stretch out, capable of cutting through solid rock. A think layer of brown-grey fur begins to cover your naked body, reflecting the heat and making you feel even more at home.</p></p>You snort, your head feeling larger, heavier, but your mind feeling oddly small. When you open your mouth, it stretches into a muzzle, revealing massive fangs. You shake your head, and the weight grows heavier, as thick horns push forward from your temples, and curve up in front of you. A thick mohawk of tough fur bristles from your head and down your powerful neck.</p></p>Yes, you are a true beast of the desert. The heat and sand is no danger to you. You are a danger to everything else!</p>",
               "descriptionchange":"You are a behemoth, a rare and dangerous desert-dwelling predator. You are huge, covered in short fur and capable of walking on four paws or on your hind legs. You have a large lionlike face, two ox-like horns, and a thick muscular tail tipped by two razor-sharp fins.",
			   "area":"makarna_DESERT_C1",
               "outcomes":[
                  {
                     "parameter":"might",
                     "quantity":10,
                     "change":"add"
                  },
				  {
                     "parameter":"magic",
                     "quantity":10,
                     "change":"sub"
                  },
				  {
                      "parameter":"species",
                      "quantity":68,
                      "change":"set"
                  }
               ]
            },
            "fail":{
               "text":"Makarna is dangerous, but surely so are you? You are confident enough in your skills that you see no need to overuse your supplies and waste time and money.</p></p>You set off across the dunes, making good progress at first. You push yourself hard, at one point sliding down a long dune and laughing at the progress you're making.</p></p>Your confidence is unearned, however. Your weather luck turns, and you don't see the mist-like cloud in the distance until it is already upon you. You are caught in a sandstorm, and it rages around you.</p></p>The sand that seemed so soft under your feet is now like blades across your skin. You cannot see, and you are parched, pained and exhausted. You struggle to find shelter, and barely manage to wedge yourself in the lee of a rock before you are totally overwhelmed.</p></p>When the storm passes, you are forced to patch yourself up and use up much of your supplies to get yourself back in travelling shape. Perhaps you overestimated your own skills.",
               "area":"makarna_DESERT_C1",
			   "outcomes":[
                  {
                     "parameter":"desert_supplies",
                     "quantity":4,
                     "change":"sub"
                  },
				  {
                     "parameter":"pain",
                     "quantity":3,
                     "change":"add"
                  }
               ]
            },
			"rareFail":{
               "text":"Makarna is dangerous, but surely so are you? You are confident enough in your skills that you see no need to overuse your supplies and waste time and money.</p></p>You set off across the dunes, making good progress at first. You push yourself hard, at one point sliding down a long dune and laughing at the progress you're making.</p></p>Your confidence is unearned, however. Your weather luck turns, and you don't see the mist-like cloud in the distance until it is already upon you. You are caught in a sandstorm, and it rages around you.</p></p>The sand that seemed so soft under your feet is now like blades across your skin. You cannot see, and you are parched, pained and exhausted. You struggle through the storm, desperately seeking shelter or escape, but find none.</p></p>You bump into something, and try desperately with your stinging eyes to see what it is. A tall, imposing shadow looms over you. Red eyes gleam in the storm. The whirling sands abate slightly, as something wraps a pair of enormous arms around you.</p></p>You are able to look up, and see a bizarre creature. It is made of craggy red stone, very loosely in a humanoid shape. It is mostly just a huge boulder, with stubby clawed feet and a pair of massive arms that rumble and thump as they move.</p></p>Its eyes are two red gems, embedded in the stone. Sand tumbles from its surface as it stares at you.</p></p>\"Give...me...\"</p></p>You feel weak all over, your body aching as the eyes glow. Your supplies and treasure fall from your hands, as you fall forward onto your knees.</p></p>\"Give...life...\"</p></p>Your hands hit the sand, and your body feels numb, and heavy. You feel stiff all over, barely able to move a muscle. Weight presses down on you, making your hands and knees sink into the shifting sand.</p></p>Your skin starts to harden, growing rough and firm. It becomes craggy and rocky, all colour in your body being replaced by the orange-yellow of sandstone. Your hands fuse into lumps of rock, your insides seize up and petrify into stone. Finally, the features on your head fade over, your whole body becoming a lump of messy, weathered stone, indistinguishable from any other normal boulder in the desert.</p></p>The sandstorm slowly fades, and the rocky creature's eyes seem brighter and more alert. It lurches off into the desert, leaving nothing but stones where you used to be.",
               "trapped_desc":"You are nothing but ordinary desert rocks, a lump of boulders half-sunken in the sand.",
               "trapped":"You are nothing but ordinary desert rocks, a lump of boulders half-sunken in the sand.",
			   "area":"makarna_DESERT_C1",
			   "outcomes":[
                  {
                     "parameter":"desert_supplies",
                     "quantity":0,
                     "change":"set"
                  },
				  {
                     "parameter":"desert_treasure",
                     "quantity":0,
                     "change":"set"
                  },
				  {
                      "parameter":"trapped",
                      "quantity":35,
                      "change":"set"
                   }
               ]
            }
         }
      },
	  {
          "id":"N_saurus",
          "title":"NORTH: Ride Your Saurus",
          "subtitle":"You'll barely need any supplies with a saurus to do the difficult parts.",
          "type":"random",
          "requirements":[
            {
               "parameter":"desert_supplies",
               "value":0,
               "comparison":"greater"
            },
			{
               "parameter":"saurus",
               "value":0,
               "comparison":"greater"
            }
          ],
          "icon":"navigateicon",
          "results":{
             "success":{
                "text":"You pat your saurus, and he snorts at you. He lowers his head, and you hop on top of him. After a moment to get your bearings, he trots off across the sand at a gallop.</p></p>The desert speeds past you as your mount crunches forward, his powerful leg eating up distances in mere minutes that would have taken you hours. The only downside is that the jostling and bumping of his stride is causing no small amount of discomfort in your hindquarters.</p></p>You reach your destination in no time at all, and reward your saurus with some food and water.",
                "area":"makarna_DESERT_C1",
                "outcomes":[
                   {
                     "parameter":"desert_supplies",
                     "quantity":1,
                     "change":"sub"
                  }
                ]
             }
          }
       },
	   {
          "id":"N_dying",
          "title":"NORTH: Travel Without Supplies",
          "subtitle":"A very unwise decision, and one that could mean your doom.",
          "type":"random",
          "requirements":[
            {
               "parameter":"pain",
               "value":5,
               "comparison":"less"
            },
			{
               "parameter":"desert_supplies",
               "value":3,
               "comparison":"less"
            }
          ],
          "icon":"navigateicon",
          "results":{
             "success":{
                "text":"There's no other option at this point. You are going to have to get as far as you can, even if your supplies have run dry.</p></p>You walk through the desert, trying to ignore your thirst. Mirages sway at the edges of your vision, tantalising you with water, moisture, shade. You focus on your steps, trudging forward one by one. Your feet sink in the sand, your body aches with discomfort.</p></p>Your mouth and throat are raw and dry from your thirst. Your lips feel cracked and painful, and your eyes burn. You cannot go on like this much longer.",
                "area":"makarna_DESERT_C1",
                "outcomes":[
                   {
                     "parameter":"pain",
                     "quantity":4,
                     "change":"add"
                  }
                ]
             }
          }
       },
	   
	   {
         "id":"E_careful",
         "title":"EAST: Cross the Savannah Carefully",
         "subtitle":"If you use extra supplies and take it slow, you can travel through the desert with a minimum of danger.",
         "type":"statcheck",
         "stat":"might",
         "difficulty":30,
         "requirements":[
            {
               "parameter":"desert_supplies",
               "value":2,
               "comparison":"greater"
            }
         ],
         "icon":"navigateicon",
         "results":{
            "success":{
               "text":"Makarna is a vast country, and one that has claimed the lives of many foolhardy adventurers who underestimated its dangers. You wisely decide to take it slow, and begin your travels across the dunes and plains.</p></p>When the sun reaches its zenith, and the heat is too great, you take shelter in what little shade you can find, and ration your water carefully. You move on only when the heat's edge dulls. Your feet slip on sandy dunes, and sweat soaks your clothes, but you make good progress.",
               "area":"makarna_DESERT_D2",
               "outcomes":[
                  {
                     "parameter":"desert_supplies",
                     "quantity":3,
                     "change":"sub"
                  }
               ]
            },
			"rareSuccess":{
               "text":"Makarna is a vast country, and one that has claimed the lives of many foolhardy adventurers who underestimated its dangers. You wisely decide to take it slow, and begin your travels across the dunes and plains.</p></p>You make great progress. You ration your water carefully, and find that you are surprisingly adept at walking over sandy dunes and through arid, cracked land. The sun slowly lowers in the sky, and the purple of night washes above you as the last of the daylight fades.</p></p>Stars twinkle above you, countless gleaming diamonds in a seemingly endless expanse of velvet black. The sky extended from horizon to horizon, unbroken and infinite. The vastness of it in the dark desert is beautiful, and strange. Your mind wants to expand, to fill the endless space.</p></p>You carry on your journey, but feel oddly changed by your experience.",
               "area":"makarna_DESERT_D2",
               "outcomes":[
                  {
                     "parameter":"desert_supplies",
                     "quantity":2,
                     "change":"sub"
                  },
				  {
                     "parameter":"might",
                     "quantity":2,
                     "change":"add"
                  },
				  {
                     "parameter":"magic",
                     "quantity":2,
                     "change":"add"
                  },
				  {
                     "parameter":"charm",
                     "quantity":2,
                     "change":"add"
                  },
				  {
                     "parameter":"stealth",
                     "quantity":2,
                     "change":"add"
                  }
               ]
            },
            "fail":{
               "text":"Makarna is a vast and dangerous country. You don't want to take chances, so you take it slow. You travel only when the heat isn't too unbearable, and you drink your water supplies liberally.</p></p>However, even taking it slow is difficult. You may have underestimated just how harsh Makarna really is. Your skin burns from the heat, and your mouth feels dry and parched. Your legs ache from slipping and sliding on the sandy dunes. You can't possibly keep this up for long.",
               "area":"makarna_DESERT_D2",
			   "outcomes":[
                  {
                     "parameter":"desert_supplies",
                     "quantity":3,
                     "change":"sub"
                  },
				  {
                     "parameter":"pain",
                     "quantity":1,
                     "change":"add"
                  }
               ]
            },
			"rareFail":{
               "text":"Makarna is a vast and dangerous country. You don't want to take chances, so you take it slow. You travel only when the heat isn't too unbearable, and you drink your water supplies liberally.</p></p>Perhaps a little too liberally, as it turns out. The unbearable heat is making you desperate to chug down more and more. You find yourself taking breaks, setting up camp over and over after barely making any progress, just for an excuse to have some shade.</p></p>Perhaps Makarnan travel is not for you. To your dismay, you feel exhausted and battered, and you've blown through an unreasonable amount of your supplies.",
               "area":"makarna_DESERT_D2",
			   "outcomes":[
                  {
                     "parameter":"desert_supplies",
                     "quantity":5,
                     "change":"sub"
                  },
				  {
                     "parameter":"pain",
                     "quantity":2,
                     "change":"add"
                  }
               ]
            }
         }
      },
	  {
         "id":"E_fast",
         "title":"EAST: Cross the Savannah Rapidly",
         "subtitle":"You can save supplies if you are confident in your skills.",
         "type":"statcheck",
         "stat":"might",
         "difficulty":50,
         "requirements":[
            {
               "parameter":"desert_supplies",
               "value":1,
               "comparison":"greater"
            }
         ],
         "icon":"navigateicon",
         "results":{
            "success":{
               "text":"Makarna is a dangerous country, but you are an experienced traveller. If you ration your water very carefully, and use your knowledge of the land well, you can save your supplies and reach your destination in a much shorter time.</p></p>You move with the wind, and keep a weather eye on the sky. You detect sandstorms long before they reach you, and are able to find shelter from them. You scavenge small plants, find easier paths between dunes, and at one point even walk beneath the shadow of a small cloud for over a mile before it disappears.</p></p>You are tired and your muscles are sore when you reach your destination, but you know you could do this again. You truly are an experienced adventurer.",
               "area":"makarna_DESERT_D2",
               "outcomes":[
                  {
                     "parameter":"desert_supplies",
                     "quantity":2,
                     "change":"sub"
                  }
               ]
            },
			"rareSuccess":{
               "text":"Makarna is a dangerous country, but you are an experienced traveller. If you ration your water very carefully, and use your knowledge of the land well, you can save your supplies and reach your destination in a much shorter time.</p></p>You move with the wind, and keep a weather eye on the sky. You detect sandstorms long before they reach you, and are able to find shelter from them. You scavenge small plants, find easier paths between dunes, and at one point even walk beneath the shadow of a small cloud for over a mile before it disappears.</p></p>In fact, you don't even feel sore, or tired. You feel like you could wander through the desert like this forever. Like this is where you were meant to be. You climb to the top of a dune, and look out across the desert, seeing it stretch from horizon to horizon. An infinity of heat and dust, your kingdom, your territory.</p></p>Something inside you feels hot and intense. You shudder, stretching up and feeling the sun bear down on you. Why do you even need clothes? You are better off without them.</p></p>You pull off your shirt and pants, tossing aside your protection from the sun. As you do, you notice your body seems bigger, stronger. Not so much bulging with muscle, but lean and powerful, like a predator.</p></p>You flex your hands, and notice your palms are thicker and rounder than before. Dark brown pads cover them, and when you lift your feet, you notice you have them there too. Oddly, this doesn't seem unnatural. It just makes it easier to walk on the hot sand.</p></p>You leap down from the dune, before landing on all fours and bounding across the desert. Running like this feels freeing, natural. Your muscles bulge and heave, sweat drips down your flanks. As you run, your spine begins to change, stretching out and growing. It thickens into a long tail behind you, the weight of it making it easier for you to run, to glide across the sand. At the end of your thick, muscular tail, sharp fins stretch out, capable of cutting through solid rock. A think layer of brown-grey fur begins to cover your naked body, reflecting the heat and making you feel even more at home.</p></p>You snort, your head feeling larger, heavier, but your mind feeling oddly small. When you open your mouth, it stretches into a muzzle, revealing massive fangs. You shake your head, and the weight grows heavier, as thick horns push forward from your temples, and curve up in front of you. A thick mohawk of tough fur bristles from your head and down your powerful neck.</p></p>Yes, you are a true beast of the desert. The heat and sand is no danger to you. You are a danger to everything else!</p>",
               "descriptionchange":"You are a behemoth, a rare and dangerous desert-dwelling predator. You are huge, covered in short fur and capable of walking on four paws or on your hind legs. You have a large lionlike face, two ox-like horns, and a thick muscular tail tipped by two razor-sharp fins.",
			   "area":"makarna_DESERT_D2",
               "outcomes":[
                  {
                     "parameter":"might",
                     "quantity":10,
                     "change":"add"
                  },
				  {
                     "parameter":"magic",
                     "quantity":10,
                     "change":"sub"
                  },
				  {
                      "parameter":"species",
                      "quantity":68,
                      "change":"set"
                  }
               ]
            },
            "fail":{
               "text":"Makarna is dangerous, but surely so are you? You are confident enough in your skills that you see no need to overuse your supplies and waste time and money.</p></p>You set off across the dunes, making good progress at first. You push yourself hard, at one point sliding down a long dune and laughing at the progress you're making.</p></p>Your confidence is unearned, however. Your weather luck turns, and you don't see the mist-like cloud in the distance until it is already upon you. You are caught in a sandstorm, and it rages around you.</p></p>The sand that seemed so soft under your feet is now like blades across your skin. You cannot see, and you are parched, pained and exhausted. You struggle to find shelter, and barely manage to wedge yourself in the lee of a rock before you are totally overwhelmed.</p></p>When the storm passes, you are forced to patch yourself up and use up much of your supplies to get yourself back in travelling shape. Perhaps you overestimated your own skills.",
               "area":"makarna_DESERT_D2",
			   "outcomes":[
                  {
                     "parameter":"desert_supplies",
                     "quantity":4,
                     "change":"sub"
                  },
				  {
                     "parameter":"pain",
                     "quantity":3,
                     "change":"add"
                  }
               ]
            },
			"rareFail":{
               "text":"Makarna is dangerous, but surely so are you? You are confident enough in your skills that you see no need to overuse your supplies and waste time and money.</p></p>You set off across the dunes, making good progress at first. You push yourself hard, at one point sliding down a long dune and laughing at the progress you're making.</p></p>Your confidence is unearned, however. Your weather luck turns, and you don't see the mist-like cloud in the distance until it is already upon you. You are caught in a sandstorm, and it rages around you.</p></p>The sand that seemed so soft under your feet is now like blades across your skin. You cannot see, and you are parched, pained and exhausted. You struggle through the storm, desperately seeking shelter or escape, but find none.</p></p>You bump into something, and try desperately with your stinging eyes to see what it is. A tall, imposing shadow looms over you. Red eyes gleam in the storm. The whirling sands abate slightly, as something wraps a pair of enormous arms around you.</p></p>You are able to look up, and see a bizarre creature. It is made of craggy red stone, very loosely in a humanoid shape. It is mostly just a huge boulder, with stubby clawed feet and a pair of massive arms that rumble and thump as they move.</p></p>Its eyes are two red gems, embedded in the stone. Sand tumbles from its surface as it stares at you.</p></p>\"Give...me...\"</p></p>You feel weak all over, your body aching as the eyes glow. Your supplies and treasure fall from your hands, as you fall forward onto your knees.</p></p>\"Give...life...\"</p></p>Your hands hit the sand, and your body feels numb, and heavy. You feel stiff all over, barely able to move a muscle. Weight presses down on you, making your hands and knees sink into the shifting sand.</p></p>Your skin starts to harden, growing rough and firm. It becomes craggy and rocky, all colour in your body being replaced by the orange-yellow of sandstone. Your hands fuse into lumps of rock, your insides seize up and petrify into stone. Finally, the features on your head fade over, your whole body becoming a lump of messy, weathered stone, indistinguishable from any other normal boulder in the desert.</p></p>The sandstorm slowly fades, and the rocky creature's eyes seem brighter and more alert. It lurches off into the desert, leaving nothing but stones where you used to be.",
               "trapped_desc":"You are nothing but ordinary desert rocks, a lump of boulders half-sunken in the sand.",
               "trapped":"You are nothing but ordinary desert rocks, a lump of boulders half-sunken in the sand.",
			   "area":"makarna_DESERT_D2",
			   "outcomes":[
                  {
                     "parameter":"desert_supplies",
                     "quantity":0,
                     "change":"set"
                  },
				  {
                     "parameter":"desert_treasure",
                     "quantity":0,
                     "change":"set"
                  },
				  {
                      "parameter":"trapped",
                      "quantity":35,
                      "change":"set"
                   }
               ]
            }
         }
      },
	  {
          "id":"E_saurus",
          "title":"EAST: Ride Your Saurus",
          "subtitle":"You'll barely need any supplies with a saurus to do the difficult parts.",
          "type":"random",
          "requirements":[
            {
               "parameter":"desert_supplies",
               "value":0,
               "comparison":"greater"
            },
			{
               "parameter":"saurus",
               "value":0,
               "comparison":"greater"
            }
          ],
          "icon":"navigateicon",
          "results":{
             "success":{
                "text":"You pat your saurus, and he snorts at you. He lowers his head, and you hop on top of him. After a moment to get your bearings, he trots off across the sand at a gallop.</p></p>The desert speeds past you as your mount crunches forward, his powerful leg eating up distances in mere minutes that would have taken you hours. The only downside is that the jostling and bumping of his stride is causing no small amount of discomfort in your hindquarters.</p></p>You reach your destination in no time at all, and reward your saurus with some food and water.",
                "area":"makarna_DESERT_D2",
                "outcomes":[
                   {
                     "parameter":"desert_supplies",
                     "quantity":1,
                     "change":"sub"
                  }
                ]
             }
          }
       },
	   {
          "id":"E_dying",
          "title":"EAST: Travel Without Supplies",
          "subtitle":"A very unwise decision, and one that could mean your doom.",
          "type":"random",
          "requirements":[
            {
               "parameter":"pain",
               "value":5,
               "comparison":"less"
            },
			{
               "parameter":"desert_supplies",
               "value":3,
               "comparison":"less"
            }
          ],
          "icon":"navigateicon",
          "results":{
             "success":{
                "text":"There's no other option at this point. You are going to have to get as far as you can, even if your supplies have run dry.</p></p>You walk through the desert, trying to ignore your thirst. Mirages sway at the edges of your vision, tantalising you with water, moisture, shade. You focus on your steps, trudging forward one by one. Your feet sink in the sand, your body aches with discomfort.</p></p>Your mouth and throat are raw and dry from your thirst. Your lips feel cracked and painful, and your eyes burn. You cannot go on like this much longer.",
                "area":"makarna_DESERT_D2",
                "outcomes":[
                   {
                     "parameter":"pain",
                     "quantity":4,
                     "change":"add"
                  }
                ]
             }
          }
       },
	   
	   {
         "id":"S_careful",
         "title":"SOUTH: Cross the Savannah Carefully",
         "subtitle":"If you use extra supplies and take it slow, you can travel through the desert with a minimum of danger.",
         "type":"statcheck",
         "stat":"might",
         "difficulty":30,
         "requirements":[
            {
               "parameter":"desert_supplies",
               "value":2,
               "comparison":"greater"
            }
         ],
         "icon":"navigateicon",
         "results":{
            "success":{
               "text":"Makarna is a vast country, and one that has claimed the lives of many foolhardy adventurers who underestimated its dangers. You wisely decide to take it slow, and begin your travels across the dunes and plains.</p></p>When the sun reaches its zenith, and the heat is too great, you take shelter in what little shade you can find, and ration your water carefully. You move on only when the heat's edge dulls. Your feet slip on sandy dunes, and sweat soaks your clothes, but you make good progress.",
               "area":"makarna_DESERT_C3",
               "outcomes":[
                  {
                     "parameter":"desert_supplies",
                     "quantity":3,
                     "change":"sub"
                  }
               ]
            },
			"rareSuccess":{
               "text":"Makarna is a vast country, and one that has claimed the lives of many foolhardy adventurers who underestimated its dangers. You wisely decide to take it slow, and begin your travels across the dunes and plains.</p></p>You make great progress. You ration your water carefully, and find that you are surprisingly adept at walking over sandy dunes and through arid, cracked land. The sun slowly lowers in the sky, and the purple of night washes above you as the last of the daylight fades.</p></p>Stars twinkle above you, countless gleaming diamonds in a seemingly endless expanse of velvet black. The sky extended from horizon to horizon, unbroken and infinite. The vastness of it in the dark desert is beautiful, and strange. Your mind wants to expand, to fill the endless space.</p></p>You carry on your journey, but feel oddly changed by your experience.",
               "area":"makarna_DESERT_C3",
               "outcomes":[
                  {
                     "parameter":"desert_supplies",
                     "quantity":2,
                     "change":"sub"
                  },
				  {
                     "parameter":"might",
                     "quantity":2,
                     "change":"add"
                  },
				  {
                     "parameter":"magic",
                     "quantity":2,
                     "change":"add"
                  },
				  {
                     "parameter":"charm",
                     "quantity":2,
                     "change":"add"
                  },
				  {
                     "parameter":"stealth",
                     "quantity":2,
                     "change":"add"
                  }
               ]
            },
            "fail":{
               "text":"Makarna is a vast and dangerous country. You don't want to take chances, so you take it slow. You travel only when the heat isn't too unbearable, and you drink your water supplies liberally.</p></p>However, even taking it slow is difficult. You may have underestimated just how harsh Makarna really is. Your skin burns from the heat, and your mouth feels dry and parched. Your legs ache from slipping and sliding on the sandy dunes. You can't possibly keep this up for long.",
               "area":"makarna_DESERT_C3",
			   "outcomes":[
                  {
                     "parameter":"desert_supplies",
                     "quantity":3,
                     "change":"sub"
                  },
				  {
                     "parameter":"pain",
                     "quantity":1,
                     "change":"add"
                  }
               ]
            },
			"rareFail":{
               "text":"Makarna is a vast and dangerous country. You don't want to take chances, so you take it slow. You travel only when the heat isn't too unbearable, and you drink your water supplies liberally.</p></p>Perhaps a little too liberally, as it turns out. The unbearable heat is making you desperate to chug down more and more. You find yourself taking breaks, setting up camp over and over after barely making any progress, just for an excuse to have some shade.</p></p>Perhaps Makarnan travel is not for you. To your dismay, you feel exhausted and battered, and you've blown through an unreasonable amount of your supplies.",
               "area":"makarna_DESERT_C3",
			   "outcomes":[
                  {
                     "parameter":"desert_supplies",
                     "quantity":5,
                     "change":"sub"
                  },
				  {
                     "parameter":"pain",
                     "quantity":2,
                     "change":"add"
                  }
               ]
            }
         }
      },
	  {
         "id":"S_fast",
         "title":"SOUTH: Cross the Savannah Rapidly",
         "subtitle":"You can save supplies if you are confident in your skills.",
         "type":"statcheck",
         "stat":"might",
         "difficulty":50,
         "requirements":[
            {
               "parameter":"desert_supplies",
               "value":1,
               "comparison":"greater"
            }
         ],
         "icon":"navigateicon",
         "results":{
            "success":{
               "text":"Makarna is a dangerous country, but you are an experienced traveller. If you ration your water very carefully, and use your knowledge of the land well, you can save your supplies and reach your destination in a much shorter time.</p></p>You move with the wind, and keep a weather eye on the sky. You detect sandstorms long before they reach you, and are able to find shelter from them. You scavenge small plants, find easier paths between dunes, and at one point even walk beneath the shadow of a small cloud for over a mile before it disappears.</p></p>You are tired and your muscles are sore when you reach your destination, but you know you could do this again. You truly are an experienced adventurer.",
               "area":"makarna_DESERT_C3",
               "outcomes":[
                  {
                     "parameter":"desert_supplies",
                     "quantity":2,
                     "change":"sub"
                  }
               ]
            },
			"rareSuccess":{
               "text":"Makarna is a dangerous country, but you are an experienced traveller. If you ration your water very carefully, and use your knowledge of the land well, you can save your supplies and reach your destination in a much shorter time.</p></p>You move with the wind, and keep a weather eye on the sky. You detect sandstorms long before they reach you, and are able to find shelter from them. You scavenge small plants, find easier paths between dunes, and at one point even walk beneath the shadow of a small cloud for over a mile before it disappears.</p></p>In fact, you don't even feel sore, or tired. You feel like you could wander through the desert like this forever. Like this is where you were meant to be. You climb to the top of a dune, and look out across the desert, seeing it stretch from horizon to horizon. An infinity of heat and dust, your kingdom, your territory.</p></p>Something inside you feels hot and intense. You shudder, stretching up and feeling the sun bear down on you. Why do you even need clothes? You are better off without them.</p></p>You pull off your shirt and pants, tossing aside your protection from the sun. As you do, you notice your body seems bigger, stronger. Not so much bulging with muscle, but lean and powerful, like a predator.</p></p>You flex your hands, and notice your palms are thicker and rounder than before. Dark brown pads cover them, and when you lift your feet, you notice you have them there too. Oddly, this doesn't seem unnatural. It just makes it easier to walk on the hot sand.</p></p>You leap down from the dune, before landing on all fours and bounding across the desert. Running like this feels freeing, natural. Your muscles bulge and heave, sweat drips down your flanks. As you run, your spine begins to change, stretching out and growing. It thickens into a long tail behind you, the weight of it making it easier for you to run, to glide across the sand. At the end of your thick, muscular tail, sharp fins stretch out, capable of cutting through solid rock. A think layer of brown-grey fur begins to cover your naked body, reflecting the heat and making you feel even more at home.</p></p>You snort, your head feeling larger, heavier, but your mind feeling oddly small. When you open your mouth, it stretches into a muzzle, revealing massive fangs. You shake your head, and the weight grows heavier, as thick horns push forward from your temples, and curve up in front of you. A thick mohawk of tough fur bristles from your head and down your powerful neck.</p></p>Yes, you are a true beast of the desert. The heat and sand is no danger to you. You are a danger to everything else!</p>",
               "descriptionchange":"You are a behemoth, a rare and dangerous desert-dwelling predator. You are huge, covered in short fur and capable of walking on four paws or on your hind legs. You have a large lionlike face, two ox-like horns, and a thick muscular tail tipped by two razor-sharp fins.",
			   "area":"makarna_DESERT_C3",
               "outcomes":[
                  {
                     "parameter":"might",
                     "quantity":10,
                     "change":"add"
                  },
				  {
                     "parameter":"magic",
                     "quantity":10,
                     "change":"sub"
                  },
				  {
                      "parameter":"species",
                      "quantity":68,
                      "change":"set"
                  }
               ]
            },
            "fail":{
               "text":"Makarna is dangerous, but surely so are you? You are confident enough in your skills that you see no need to overuse your supplies and waste time and money.</p></p>You set off across the dunes, making good progress at first. You push yourself hard, at one point sliding down a long dune and laughing at the progress you're making.</p></p>Your confidence is unearned, however. Your weather luck turns, and you don't see the mist-like cloud in the distance until it is already upon you. You are caught in a sandstorm, and it rages around you.</p></p>The sand that seemed so soft under your feet is now like blades across your skin. You cannot see, and you are parched, pained and exhausted. You struggle to find shelter, and barely manage to wedge yourself in the lee of a rock before you are totally overwhelmed.</p></p>When the storm passes, you are forced to patch yourself up and use up much of your supplies to get yourself back in travelling shape. Perhaps you overestimated your own skills.",
               "area":"makarna_DESERT_C3",
			   "outcomes":[
                  {
                     "parameter":"desert_supplies",
                     "quantity":4,
                     "change":"sub"
                  },
				  {
                     "parameter":"pain",
                     "quantity":3,
                     "change":"add"
                  }
               ]
            },
			"rareFail":{
               "text":"Makarna is dangerous, but surely so are you? You are confident enough in your skills that you see no need to overuse your supplies and waste time and money.</p></p>You set off across the dunes, making good progress at first. You push yourself hard, at one point sliding down a long dune and laughing at the progress you're making.</p></p>Your confidence is unearned, however. Your weather luck turns, and you don't see the mist-like cloud in the distance until it is already upon you. You are caught in a sandstorm, and it rages around you.</p></p>The sand that seemed so soft under your feet is now like blades across your skin. You cannot see, and you are parched, pained and exhausted. You struggle through the storm, desperately seeking shelter or escape, but find none.</p></p>You bump into something, and try desperately with your stinging eyes to see what it is. A tall, imposing shadow looms over you. Red eyes gleam in the storm. The whirling sands abate slightly, as something wraps a pair of enormous arms around you.</p></p>You are able to look up, and see a bizarre creature. It is made of craggy red stone, very loosely in a humanoid shape. It is mostly just a huge boulder, with stubby clawed feet and a pair of massive arms that rumble and thump as they move.</p></p>Its eyes are two red gems, embedded in the stone. Sand tumbles from its surface as it stares at you.</p></p>\"Give...me...\"</p></p>You feel weak all over, your body aching as the eyes glow. Your supplies and treasure fall from your hands, as you fall forward onto your knees.</p></p>\"Give...life...\"</p></p>Your hands hit the sand, and your body feels numb, and heavy. You feel stiff all over, barely able to move a muscle. Weight presses down on you, making your hands and knees sink into the shifting sand.</p></p>Your skin starts to harden, growing rough and firm. It becomes craggy and rocky, all colour in your body being replaced by the orange-yellow of sandstone. Your hands fuse into lumps of rock, your insides seize up and petrify into stone. Finally, the features on your head fade over, your whole body becoming a lump of messy, weathered stone, indistinguishable from any other normal boulder in the desert.</p></p>The sandstorm slowly fades, and the rocky creature's eyes seem brighter and more alert. It lurches off into the desert, leaving nothing but stones where you used to be.",
               "trapped_desc":"You are nothing but ordinary desert rocks, a lump of boulders half-sunken in the sand.",
               "trapped":"You are nothing but ordinary desert rocks, a lump of boulders half-sunken in the sand.",
			   "area":"makarna_DESERT_C3",
			   "outcomes":[
                  {
                     "parameter":"desert_supplies",
                     "quantity":0,
                     "change":"set"
                  },
				  {
                     "parameter":"desert_treasure",
                     "quantity":0,
                     "change":"set"
                  },
				  {
                      "parameter":"trapped",
                      "quantity":35,
                      "change":"set"
                   }
               ]
            }
         }
      },
	  {
          "id":"S_saurus",
          "title":"SOUTH: Ride Your Saurus",
          "subtitle":"You'll barely need any supplies with a saurus to do the difficult parts.",
          "type":"random",
          "requirements":[
            {
               "parameter":"desert_supplies",
               "value":0,
               "comparison":"greater"
            },
			{
               "parameter":"saurus",
               "value":0,
               "comparison":"greater"
            }
          ],
          "icon":"navigateicon",
          "results":{
             "success":{
                "text":"You pat your saurus, and he snorts at you. He lowers his head, and you hop on top of him. After a moment to get your bearings, he trots off across the sand at a gallop.</p></p>The desert speeds past you as your mount crunches forward, his powerful leg eating up distances in mere minutes that would have taken you hours. The only downside is that the jostling and bumping of his stride is causing no small amount of discomfort in your hindquarters.</p></p>You reach your destination in no time at all, and reward your saurus with some food and water.",
                "area":"makarna_DESERT_C3",
                "outcomes":[
                   {
                     "parameter":"desert_supplies",
                     "quantity":1,
                     "change":"sub"
                  }
                ]
             }
          }
       },
	   {
          "id":"S_dying",
          "title":"SOUTH: Travel Without Supplies",
          "subtitle":"A very unwise decision, and one that could mean your doom.",
          "type":"random",
          "requirements":[
            {
               "parameter":"pain",
               "value":5,
               "comparison":"less"
            },
			{
               "parameter":"desert_supplies",
               "value":3,
               "comparison":"less"
            }
          ],
          "icon":"navigateicon",
          "results":{
             "success":{
                "text":"There's no other option at this point. You are going to have to get as far as you can, even if your supplies have run dry.</p></p>You walk through the desert, trying to ignore your thirst. Mirages sway at the edges of your vision, tantalising you with water, moisture, shade. You focus on your steps, trudging forward one by one. Your feet sink in the sand, your body aches with discomfort.</p></p>Your mouth and throat are raw and dry from your thirst. Your lips feel cracked and painful, and your eyes burn. You cannot go on like this much longer.",
                "area":"makarna_DESERT_C3",
                "outcomes":[
                   {
                     "parameter":"pain",
                     "quantity":4,
                     "change":"add"
                  }
                ]
             }
          }
       },
	   
	   {
          "id":"drink_flask",
          "title":"Drink from a canteen",
          "subtitle":"Drinking from your canteen will soothe your aches and pains, and make it easier to keep on travelling.",
          "type":"random",
          "requirements":[
            {
               "parameter":"canteen_full",
               "value":0,
               "comparison":"greater"
            }
          ],
          "icon":"navigateicon",
          "results":{
             "success":{
                "text":"You open up one of your extra canteens, and drink the cool refreshing water inside. It sends a soothing flow of relaxation through your body. Your pains and injuries seem much more bearable now. You even have more energy than before.</p></p>In the desert, water truly does seem magical.",
                "outcomes":[
                  {
                     "parameter":"canteen_full",
                     "quantity":1,
                     "change":"sub"
                  },
				  {
                     "parameter":"canteen_empty",
                     "quantity":1,
                     "change":"add"
                  },
				  {
                     "parameter":"pain",
                     "quantity":2,
                     "change":"sub"
                  }
                ]
             }
          }
       },
	   {
          "id":"desert_die",
          "title":"Collapse",
          "subtitle":"You can go no further",
          "type":"random",
          "requirements":[
            {
               "parameter":"pain",
               "value":3,
               "comparison":"greater"
            }
          ],
          "icon":"pain",
          "results":{
             "success":{
                "text":"You fall forward into the sand, utterly exhausted. You cannot even crawl. The last of your strength has left you.</p></p>Everything goes blurry. Your thoughts become scrambled and confused. The sand starts to slowly cover you.</p></p>Then a shadow hovers overhead. It circles you, getting lower and lower, until a pair of clawed yellow feet land in front of your face.</p></p>\"Well well, shame that. Another adventurer out of his element, eh?\"</p></p>A pair of feather-fingered hands reach down, and start patting over you. They slide into your pockets, and take your belongings. You try to look up, and see a stocky bird, with a long featherless pink neck and a long vicious beak. The feathers at the base of his neck are ruffled out like a collar.</p></p>\"Not bad, some juicy goods here. Many thanks, lunch! I'll get myself a real nice price for one of these!\"</p></p>The vulture grins at you, and lifts his foot. His talon presses over your face, turning your head left and right as he looks down at you. You hear his stomach growl, but you are too weak to do anything at all.</p></p>He sits on your chest, and props his thick claws either side of your head. It's like being sat on by a particularly heavy pillow. He flexes his talons, and presses them to your cheeks, before rubbing your face and squeezing your head in the grip of his long avian toes.</p></p>It's oddly soothing. Your thirst and pain seems to fade away. He turns his feet, forcing you to look up into his eyes. Above him, the harsh sun glares down at you, but you barely notice. You just see the grin of that happy vulture, his bright eyes. It feels soothing, calm, happy.</p></p>\"You wanna be my lunch, bud? Want me to eat you, make me a happy stuffed vulture?\"</p></p>You do. You want to help this nice bird. He's taking all the pain away. He's soft and warm and handsome. Just a nice, friendly bird.</p></p>His beak opens wide, and leans down. You feel his tongue slide across your face, the wonderful moisture making you want to sigh. Your head presses up into his throat, so dark and cool and comfortable compared to the desert. Even if you had the strength to resist, you wouldn't. It feels so good, to have your shoulders and chest swallowed up, your body pressed into the vulture's gullet. To sink deep into the darkness, and slide down into his belly, curled up and warm and happy.</p></p>Nothing but vulture food.",
                "area":"belly",
                "outcomes":[
                  {
                     "parameter":"pain",
                     "quantity":0,
                     "change":"set"
                  },
				  {
                     "parameter":"desert_supplies",
                     "quantity":0,
                     "change":"set"
                  },
				  {
                     "parameter":"desert_treasure",
                     "quantity":0,
                     "change":"set"
                  }
                ]
             }
          }
       },
	   {
          "id":"saurus_HOME",
          "title":"Return to Makarna by Saurus",
          "subtitle":"A saurus can always navigate its way home.",
          "type":"random",
          "requirements":[
            {
               "parameter":"desert_supplies",
               "value":0,
               "comparison":"greater"
            },
			{
               "parameter":"saurus",
               "value":0,
               "comparison":"greater"
            }
          ],
          "icon":"navigateicon",
          "results":{
             "success":{
                "text":"Supposedly, all sauruses have incredible homing instinct. You stroke your saurus's neck, and he lowers himself so you can climb on top.</p></p>\"Home\", you command him, in passable Makarnan. He snorts with pleasure, and turns himself with unerring accuracy towards the Makarnan capital. The speed with which he takes off almost throws you off him completely.</p></p>You are forced to close your eyes, as your saurus is moving so fast that the sand is whipping against your face painfully. You cling to his neck for dear life, until after what seems a suspiciously short time, he stops.</p></p>You open your eyes, and realise you're back at Honest Even's shop. That can't be right - barely any time passed at all. You look suspiciously at your saurus, but he's already rooting in your pack for a treat. It can't be magic, surely? This thing is just a dumb animal...right?",
                "area":"makarna_sauruslot",
                "outcomes":[
                   {
                     "parameter":"desert_supplies",
                     "quantity":1,
                     "change":"sub"
                  }
                ]
             }
          }
       }
    ],
    "npcs":[
       
    ]
 }