{
        "title": "maze_deep",
        "header": "Deep Memory",
        "nomap": "Every direction you take leads only to more mirrors. You can't even tell if you are moving or if the maze is just shifting around you.",
        "subheader": "This part of the maze seems different. The reflections seem older, and more faded. You get the feeling of old, deep history, looming beneath you like a cavernous abyss. One wrong step, and you might plummet into it and never return.",
        "events": [
            {
                "id": "ironsky",
                "title": "I found it when I lost everything",
                "subtitle": "I thought there was no hope left. The rebellion was a miserable failure. My comrades were dead or imprisoned. My body was ruined, and I couldn't even move my fingers anymore. They even took him from me, the only thing I really cared about. I was cast into the mountains to die, but...",
                "type": "random",
                "requirements": [
                    
                ],
                "icon": "beneath",
                "results": {
                    "thing": {
                        "html": "data/active/TheIronSky.html",
                        "area": "maze_1",
                        "outcomes": [
                            {
                                "parameter": "mystery_sky",
                                "quantity": 1,
                                "change": "add",
                                "max": 1
                            }
                        ]
                    }
                }
            },{
                "id": "unchained",
                "title": "I found it in the tundra",
                "subtitle": "The tribe is going hungry. I needed to venture farther than before, looking for something to hunt. It is my duty. Then a blizzard came, and I looked for shelter.",
                "type": "random",
                "requirements": [
                    
                ],
                "icon": "lycaeon",
                "results": {
                    "thing": {
                        "text": "Your fingers touch against the cool, ice-black mirror, and you fall. Forward, down, back, further and further, to when the world was new...</p></p>You scan the horizon, but there is only the endless tundra. No sign of life. You raise your muzzle in the air and sniff, searching for anything at all. A trace of elks, perhaps even the distant tracks of one of the mighty mammoths that stalk these far northern lands. Nothing. Ignoring your aching stomach, you continue to walk.</p></p>The winter has been longer than ever this year. The shamaness claims it is a sign the sun is dying, and that the moon is poisoning him. As the greatest hunter of your people, it is your duty to seek a solution that will keep the pack alive. If that meant searching in the forbidden lands for new hunting grounds, then so be it. So far you have found nothing. You should have returned days ago, but your stubbornness kept you going. You look out through the dark, snow-frosted trees and wonder for a moment if the tundra goes on forever. If you stepped onto the frozen rivers and followed them like the reindeer do, would there be new worlds beyond?</p></p>Hunger is making you forget your duty. You grit your teeth and continue tracking. At the very least if you can find some mice or weasels you could sate your own belly for a while. You press your long grey muzzle near the snow and sniff carefully as you carry on. Then you sense something. That's odd. You don't have a word for what it smells like. The closest you can think of is when lightning struck the great bower tree when you were young. The shamaness said the gods were showing their anger at the wickedness of the world. The scent brings back vivid memories of that day, when there was a smell in the air you thought might be the sky itself burning.</p></p>You know you shouldn't, but you follow it. The track is incredibly faint, and you lose it several times, but gradually it leads you to a clearing in the deep woods, where no trees grow. There is a dent in the ground, like a prey's burrow that has been snowed over, but much larger. You start to dig, your large padded claws well-suited to pushing through the frost. You manage to unearth stone doors, buried beneath the falling snow, and you plant your paws firmly against the ground as you slowly push them open.</p></p>After their intiial stiffness, the doors suddenly slide the rest of the way of their own accord, and it's only your honed agility that stops you from falling on your face. You step forward. into a tunnel the likes you've never seen before. Your life of hunting in the snow, living with your pack in tents, and the cold never-changing world you live in makes it hard for you to even describe what this is. The walls and floor are made of stone, perhaps, but stone that shines like water. There are carvings in the stone, lines and shapes, and there is fire inside them that fills the place with green light. You know for sure this is forbidden, and you are probably ten-times cursed for disturbing such a place. You keep walking anyway.</p></p>The tunnel goes on for a long time, staying the exact same size the entire way, like it was carved by magic. At the end of it, it opens up into a round place, with what must be an altar. Atop it is an enormous skull. This, at least, you somewhat understand. It is huge, like the skulls of the mammoths, and it has the same enornous tusks they do. The muzzle is longer though, and if it is a mammoth, it must surely be their king because it is far larger than even they. There are things above it, like black water held in...you grit your teeth. There is so much here that you can't even describe. The world has such wonders in it that you will never understand. You feel compelled to move forward, and you find yourself reaching out to the skull, and staring into its dead, empty eyes.</p></p>There is a sound, like the beating of an enormous drum. A voice speaks, and it's coming from inside your own head.</p></p>WHAT</p>DO</p>YOU</p>WANT</p>TO</p>BE</p></p>You are forced suddenly out of the memory, and left spinning in the infinite labryinth of reflections. It takes you a moment to gather your mind together, like you are drawing it back from an incredibly long distance. What was that?",
                        "area": "maze_1",
                        "outcomes": [
                            {
                                "parameter": "mystery_chains",
                                "quantity": 1,
                                "change": "add",
                                "max": 1
                            }
                        ]
                    }
                }
            }
        ],
        "npcs": [
            
        ]
    }