{
    "title":"otterton_drizzlefin",
    "header":"Drizzlefin's Shack",
    "nomap":"You will have to deal with the owner here before you leave.",
    "subheader":"Drizzlefin’s home is a cramped, wooden shed right by the water. Everything smells strongly of fish, salt and sweat. There are scratches on the walls and ceiling. The only furniture is a small nightstand and a large bed that can fit most of the orca’s enormous form. (All events here are made by Reese Ikena)",
    "events":[
       {
          "id":"d1",
          "title":"Spend a Day with Drizzlefin",
          "subtitle":"Drizzlefin seems lonely in his little seaside shack. He might appreciate it if you spent some time with him.",
          "type":"random",
          "requirements":[
             {
                "parameter":"drizzlefin_connection",
                "value":1,
                "comparison":"less"
             },
             {
                "parameter":"maelstrom_time",
                "value":1,
                "comparison":"less"
             }
          ],
          "icon":"drizzlefin",
          "results":{
             "Chocobo Merchant":{
                "text":"Drizzlefin is surprised when you offer to stay by his side for the day. “Really? I… alright! Um, I gotta do work though… is that ok?”</p>\tYou nod, happy to tag along wherever the orca needs to go. Drizzlefin smiles, showing his sharp, carnivore teeth. “Thanks! It’s nice to have company.” He leads you out to the Otterton docks, where he immediately starts lifting barrels bigger than your body. You do your best to help out, squatting down and straining to lift a barrel yourself, but it’s like trying to move a mountain. You decide to stop before you injure yourself. </p>Drizzlefin notices you struggling and comes to give a hand. “It’s all in the kness! You’ll throw out your back if you don’t lift it right!” He bends down and shows you how to properly lift the barrel, though he makes the task look far easier than it is. You once again attempt to lift the barrel, failing once more, but Drizzlefin still gives you a thumbs up. “That’s the technique! Just gotta train up your arms!”</p>Though you lack the muscle to match the orca’s feats of strength, his words are reassuring. He sounds much more confident here than he did in his own home. Perhaps using his strength to help others makes him happy? Or perhaps he just hates being cooped up in that small abode? Either way, Drizzlefin keeps a smile on his face as the sun beats down, giving his smooth skin a luxurious shine. His muscles ripple and his tail sways powerfully. You have to shake your head to stop looking at his beautiful body.</p>By the end of the workday, Drizzlefin has done twice as much as any other dockworker. He’s handed a measly pay of fish bones by the harbourmaster and begins walking back home, his smile fading slightly. When he notices you waiting for him, he brightens slightly. “It… it was sweet of you to join me today. I really appreciate it, promise!” </p>You give the orca a friendly hug, which he returns, softly embracing you. Despite his strong body, he knows how to be gentle. When you release him, he smiles, nods, and returns to his house, leaving you at the docks as the sun begins to set.",
                "area":"otterton_dock",
                "outcomes":[
                   {
                      "parameter":"drizzlefin_connection",
                      "quantity":1,
                      "change":"set"
                   }
                ]
             }
          }
       },
       {
          "id":"d2",
          "title":"Go a Little Further",
          "subtitle":"At the end of the week, Drizzlefin is a little exhausted from his job at the docks. Maybe you can help him relax and relieve his stress?",
          "type":"random",
          "requirements":[
             {
                "parameter":"drizzlefin_connection",
                "value":0,
                "comparison":"greater"
             },
             {
                "parameter":"maelstrom_time",
                "value":1,
                "comparison":"less"
             }
          ],
          "icon":"drizzlefin",
          "results":{
             "Chocobo Merchant":{
                "text":"You approach Drizzlefin as he lies on his bed, half his body floating off the sides due to his large frame. He sees you saunter up, a little confused. “Is… is something up?” he asks cautiously. </p></p>He doesn’t expect you to then climb on top of his slick body and rub a hand across his chest. “Wha-” he starts to question, but you quickly silence him with a passionate kiss. At first, the orca blushes, but eventually he gives in, his eyes rolling up slightly as he presses his thick tongue against yours, pushing in and filling your mouth. He wraps his strong arms around you, holding you close as you stay locked in bliss.</p></p>You’re not done, though. You lean way from Drizzlefin and he complies, drooling a little. You slide your way back along his belly and feel your spine collide with a rock-hard pillar. A smile spreads across your face, knowing exactly what’s behind you. The orca blushes a little, but you were prepared for this. You push up, raising yourself close to the low ceiling, before bringing yourself down onto the porpoise’s fully erect cock.</p></p>Drizzlefin cries out with lust as his shaft delves deep into your body. You didn’t expect to get far down the orca’s member, but his pre and his slippery flesh acts as an efficient lube, stretching your opening to its limit. The orca’s body has gone mostly limp as he moans softly, his volume increasing slightly each time you manage to force your body a little further down. He has given up all control to you, and you are prepared to show him a great time.</p></p>With some soreness, you raise yourself slightly, then push down with force. Drizzlefin gasps, his tongue lulling out as he pants quickly for air. You smile and pump his cock once more. Each time you press down against his shaft, he slips further inside you and grows closer to orgasm. You find yourself approaching a climax too as you continue to ride and dominate his cock.</p></p>Eventually you break him. With a loud moan, his cum is unloaded at top speed, gushing out shot after shot. You didn’t realize how much seed the orca could produce with one orgasm. You feel like a balloon being filled with water as his cum nearly causes you to burst. His pulses finally slow down and stop, leaving both you and your enormous partner breathing heavily. You slowly push yourself off of Drizzlefin’s shaft. When you finally get his tip out, you feel his load of seed gush out of your hole and drip back onto its creator. </p></p>Between breaths, the orca manages to say, “Wow…”</p></p>Perhaps that’s all that needs to be said. The experience was unlike anything you’ve had before. With a quick “thanks”, you manage to stumble your way out of the shack, still feeling full and queasy.",
                "area":"otterton_dock",
                "outcomes":[
                   {
                      "parameter":"drizzlefin_connection",
                      "quantity":2,
                      "change":"set"
                   }
                ]
             }
          }
       },
       {
          "id":"dom_zriddle",
          "title":"Dominate Drizzlefin",
          "subtitle":"The large orca has proven to be much more submissive than his appearance would suggest. It’s time to show him who’s boss.",
          "type":"random",
          "requirements":[
             {
                "parameter":"drizzlefin_connection",
                "value":1,
                "comparison":"greater"
             },
             {
                "parameter":"maelstrom_time",
                "value":1,
                "comparison":"less"
             }
          ],
          "icon":"drizzlefin",
          "results":{
             "Chocobo Merchant":{
                "text":"Drizzlefin sees the look you give him and catches on quickly. “O-ok… I’ll get ready…” he stammers, quickly removing his pants and squirming onto his tiny bed. You follow him over, ready to make the orca submit. </p>\tBefore you get a chance, Drizzelfin pipes up. “Uh… not to be rude, but I don’t think I’d even feel you… I think we can fix that though! I-if you want…” You nod, understanding that while his huge body has quite the impact on you, you might have little impact on him in your current form. The porpoise gently takes your shoulders and rests you on his stomach. He mutters a quick “sorry about this,” before he squeezes you tight against him.</p>\tThe weight of his arms and the strength of his muscles squeezes the air out of you. You gasp, fearing you may asphyxiate. You feel air enter your lungs, but when it leaves, it pushes out your back. A hole has opened up near your neck, exhaling the breath you take in. The sensation is strange, but you slowly get used to it. </p>Your body, meanwhile, begins to thicken against the orca’s firm grasp. Your arms, legs and torso all ripple with muscle growth. Your fingers grow small claws and develop webbing. Your spine pushes out with force, generating new flesh with it. You can feel it sway behind you powerfully. Your reproductive organs fully retract and morph inside you. A new slit opens towards the front of your body, and a heavy, pink object begins to fill with blood and force its way between your stomach and Drizzlefin’s. Your new orca cock leaks with pre as you continue to change.</p>Next comes your face, pushing out into a wide, rounded muzzle. Your teeth become larger and pointed, and your tongue grows wide and long in your mouth. As you stare cross-eyed at your snout, a pain hits the middle of your spine. It extends away from your back, creating a large porpoise’s fin, ready to cut through water. Finally, your skin changes color to black and white, slick and shiny, and a little sweaty, too. Drizzlefin releases you, blushing at your now equally large body and erect cock. You stare at yourself for a moment, then back at Drizzlefiin, a wicked grin on your face.</p>“On all fours,” you command. Drizzlefin complies, lifting his rear up invitingly, his tail swaying and his hole ready for you to enter. Immediately you grab onto his cheeks and ram your new dick into him at top speed. Your little fucktoy gasps with a mix of pain and pleasure, gripping the bedsheets tight in his claws. You take a second to breathe deeply. Leaning away, you pull your cock most of the way out before forcing your way back in once more. Each powerful thrust widens Drizzlefin’s hole and leaves him whimpering, saliva dripping out of his open mouth. You don’t give your bitch a chance to rest, pounding his ass over and over again. At some point, the other orca cums with a loud moan, but you aren’t done. Drizzlefin whines as he runs out of seed, the bed stained white underneath him. </p>You don’t stop thrusting until you feel yourself reaching orgasm. You grab his tail in one hand and pull him in close, squeaking and moaning deeply as you unload into Drizzelfin’s ass. He grabs onto the blanket below him, moaning softly as you release liters of cum into him. You keep him trapped until you feel the last drop escape your cock. Then, with a long sigh, you release the orca, pulling out of his ass and allowing some of your seed to flow out of his hole. “Keep it in,” you demand. Drizzlefin nods gently and clenches his rear, making sure none of the cum drips out.</p>Leaving Drizzlefin filled up on a cum-stained bed, you stretch and flex your muscles, taking the time to properly admire your amazing body. It feels nice to be so powerful. You can’t help but wonder who wouldn’t beg to be fucked by you. You only clue in when Drizzlefin softly asks you to leave before sunset. Given how much you dominated the orca, it’s only fair if you let him have one wish. You step outside into the fresh air, still very erect. You can feel everyone’s eyes on you as you proudly stride through Otterton.",
                "descriptionchange":"You are now a muscular and powerful orca",
                "area":"otterton_dock",
                "outcomes":[
                   {
                      "parameter":"drizzlefin_connection",
                      "quantity":3,
                      "change":"set"
                   },
                   {
                      "parameter":"dominance",
                      "quantity":2,
                      "change":"add"
                   },
                   {
                      "parameter":"species",
                      "quantity":67,
                      "change":"set"
                   }
                ]
             }
          }
       },
       {
          "id":"drizzle_stayniht",
          "title":"Stay the Night",
          "subtitle":"Your experiences with Drizzlefin have grown your bond. Perhaps he’ll finally let you stay past sunset, even though he’s been so adamant about you leaving before now.",
          "type":"random",
          "requirements":[
             {
                "parameter":"drizzlefin_connection",
                "value":2,
                "comparison":"greater"
             },
             {
                "parameter":"maelstrom_time",
                "value":1,
                "comparison":"less"
             }
          ],
          "icon":"drizzlefin",
          "results":{
             "Chocobo Merchant":{
                "text":"When you ask Drizzlefin, he visibly tenses. “Do you really want to?” he pleads. Clearly something is scaring him. You give the orca a comforting pat on the shoulder, promising him that he’ll be safe with you around. “It…It’s not me I’m worried about,” he replies. His statement makes you rethink your request. Do you really want to stay overnight?</p>\tYou reassure Drizzlefin that you’ll be fine. The two of you have spent so much quality time together, how could anything change that? The orca surprises you by hugging you tightly against his strong body. A single tear runs down his cheek. “I… I trust you…” he whimpers, “so I’ll let you meet him… promise me you’ll be ok!”</p>\tDrizzlefin’s words make no sense to you. Who is this “him” he’s referring to? You decide to just return the hug, trying to keep the porpoise calm. You stay locked in an embrace as the last traces of light disappear over the horizon. As night falls, you feel a strange sensation coming from Drizzlefin’s skin. It’s as if the muscles underneath are constantly flexing and relaxing, but unmistakably growing in size. The orca suddenly releases you and cries out. His whole body vibrates and ripples as a strange transformation takes control.</p>\tAll you can do is watch as his claws sharpen and lengthen, his tail thickens and strikes the ground with such force it makes you shake, and his body pulses with strange energy. He grows even larger than he already was, his fin piercing the low roof of the shack. His arms grow stronger, as do his legs. It appears as if his skin could burst at any moment from the overwhelming power beneath the surface.</p>\tHis snout grows longer and more refined, his teeth lengthening and drool flooding out of his maw. Scars split the skin on his face. Finally, the now gigantic orca opens his narrow eyes, his glowing red pupils finding you staring at him in silent fear. He grins, baring his many sharp fangs, ready to snap your head off. “Hello, little morsel…” he taunts, “ready to play?”",
                "outcomes":[
                   {
                      "parameter":"maelstrom_time",
                      "quantity":1,
                      "change":"set"
                   }
                ]
             }
          }
       },
       {
          "id":"escapemael",
          "title":"Try to Escape",
          "subtitle":"If you act fast, maybe you can avoid the orca’s advance and make it to the door on time. Of course, there’s a high chance you won’t move a centimeter before he grabs you, but what choice do you have?",
          "type":"statcheck",
          "stat":"stealth",
          "difficulty":40,
          "requirements":[
             {
                "parameter":"maelstrom_time",
                "value":0,
                "comparison":"greater"
             }
          ],
          "icon":"maelstrom",
          "results":{
             "success":{
                "text":"You watch the orca intensely as he approaches, waiting for an opportunity. It comes when Maelstrom lifts one arm to snatch you. You quickly dive underneath his triceps, rolling across the floor. Once your feet touch hard ground once more, you leap for the metal door. The knob turns and you feel the ocean air enter the shack. There’s no time to delay. You race out and through Otterton, hearing the orca roaring behind you, but he doesn’t pursue you out of his home.</p>\tHidden from sight, you breathe heavily. What a monster… hopefully Drizzlefin will be back by daylight.",
                "area":"otterton_dock",
                "outcomes":[
                   {
                      "parameter":"maelstrom_time",
                      "quantity":0,
                      "change":"set"
                   }
                ]
             },
             "fail":{
                "text":"You watch the orca intensely as he approaches, waiting for an opportunity. It comes when Maelstrom lifts one arm to snatch you. You quickly dive underneath his triceps, but in a poorly timed blunder, you just end up smacking your face against the ground, leaving you dazed and clutching your head.</p>\tMaelstrom stands over you and presses a foot against your back, crushing you against the floor. “That was pathetic… but admittedly funny to watch,” he jeers with a sinister grin. He bends over and grabs you by the back of your neck, lifting you up so you’re eye to eye. “You didn’t make me chase you much, so I’ll make this fun!”</p>\tHis maw opens wide, revealing his many sharp teeth, writhing tongue, overflowing saliva, and a large throat waiting to swallow you whole. You squirm, but with his tight grip on your neck, you can’t even attempt escape. Watching you struggle, Maelstrom laughs, a deep laugh that shakes his body. “Aww, is my dinner trying to avoid his fate?” Then, before you can plead for mercy, he drops you into his mouth and snaps his jaws behind you.</p>\tThe inside of Maelstroms maw is pitch black and warm. You’re sitting chest-deep in a pool of his saliva. You try to make your way in the darkness. Your hands find something thick, wet, and fleshy. Suddenly, the foreign object pushes you down, into the acidic pool. Maelstrom’s tongue keeps you pinned to the bottom of his mouth. You fear you may drown in the orca’s saliva, but his tongue relaxes and allows you to come up for air. As you breathe, you hear Maelstrom’s body around you: the sound of wind passing through him with each inhale and exhale, the lapping of saliva waves within his mouth, the gurgling of his belly through the cavernous esophagus ahead of you, the rumble of his small chuckles at your desperate struggles.</p>\tThe orca plays with his food, letting you blindly attempt escape, but eventually he grows bored, and hungry. He uses his tongue to capture you, the wet flesh coiling around your body. Just to spite you, to give you one last feeling of hope before destroying it, he opens his mouth. You try to flee, but Maelstrom’s tongue prevents you from budging. Then, with one last laugh, he pulls you backwards, into his throat.</p>\tGoing down, every attempt to grab at the folds of muscle is foiled by its slippery texture. Sure enough, you fall all the way down into his stomach. The smell of digestive fluids is intoxicating. You can already feel the acids melting away your body, turning you into simple nutrients. By the time morning comes, you faintly hear Drizzlefin’s voice calling for you, but it’s too late. You are no more than a new layer of blubber on the orca’s skin.",
                "trapped_desc":"You are nothing but blubber on Drizzlefin's smooth orca belly",
                "trapped":"You are nothing but blubber on Drizzlefin's smooth orca belly",
                "outcomes":[
                   {
                      "parameter":"maelstrom_time",
                      "quantity":0,
                      "change":"set"
                   },
                   {
                      "parameter":"trapped",
                      "quantity":26,
                      "change":"set"
                   }
                ]
             },
             "rareFail":{
                "text":"You watch the orca intensely as he approaches, waiting for an opportunity. It comes when Maelstrom lifts one arm to snatch you. You quickly dive underneath his triceps, rolling across the floor. Once your feet touch hard ground once more, you leap for the metal door. You try to turn the knob, but the door gets stuck. You wrestle with it, but it’s too late. Maelstrom uses a hand and slams you against the closed door. “You very nearly made it outside… I warned you not to run… now you’ll see what happens when my meal pisses me off!”</p>\tWith one hand still pinning you, Maelstrom grabs fishing wire off the wall and begins to wrap it around your legs, trapping them together in a tight bind. He proceeds up your body, tying your arms to your sides. When he’s done, you’re completely immobilized. The orca admires his work, then pokes you with a foot. Losing your balance, you fall over, helpless. Maelstrom chuckles and grins at your predicament. “The normal way is too good for you…” </p>\tHe probs you against the wall, your feet up and your head laying against the ground. He turns around, exposing his muscular rear and enormous hole. Maelstrom bares his teeth in a terrifying smile. “You like it, little morsel? I sure hope so.” He lines himself up with your feet and sinks down. Your toes are swallowed up by his hole. You can feel the warmth inside him and realize that more than just your toes are going to be feeling that heat. The orca continues to lower himself down, taking on your calves, then your thighs. As he gets to your hips, he grunts heavily, straining and pushing himself until, with a satisfying pop, your pelvis is forced inside the orca.</p>\tYou try to squirm, but the fishing line keeps you tightly bound, and with half your body already swallowed by the porpoise’s ass, it’s unlikely you could escape anyway. Maelstrom chuckles and pants, enjoying watching you struggle and almost certainly enjoying the pleasure of your body filling his. The orca keeps going, pressing your arms even tighter against your body as they, too, are enveloped. Finally, only your head remains exposed. Maelstrom presses a hand against your scalp. “Take a deep breath… it’s the last one you’ll get.” Then, without any further warning, he shoves the last bit if you into his hole.</p>\tInside, it’s warm and smells putrid. You feel Maelstrom massaging himself, pressing you tightly within his intestines. Your mind begins to fade. You feel the nutrients being drained from you as you turn to mere mush. At daybreak, Drizzlefin awakes to find you gone. He wonders where you’ve disappeared, not knowing your unfortunate fate.",
                "trapped_desc":"You are nothing but churned up waste inside of Drizzlefin's behind",
                "trapped":"You are nothing but churned up waste inside of Drizzlefin's behind",
                "outcomes":[
                   {
                      "parameter":"maelstrom_time",
                      "quantity":0,
                      "change":"set"
                   },
                   {
                      "parameter":"trapped",
                      "quantity":27,
                      "change":"set"
                   }
                ]
             }
          }
       },
       {
          "id":"fightmael",
          "title":"Take Him On",
          "subtitle":"Maelstrom certainly intends to use and abuse you, but you’ve survived Drizzlefin. Surely you can survive this?",
          "type":"statcheck",
          "stat":"might",
          "difficulty":60,
          "requirements":[
             {
                "parameter":"maelstrom_time",
                "value":0,
                "comparison":"greater"
             }
          ],
          "icon":"maelstrom",
          "results":{
             "success":{
                "text":"You try to shake your fear off and give Maelstrom a smirk. “Well, big boy,” you say, “show me what you can do.” The giant orca grins widely, his fangs glistening. He sits down, shaking the ground as he does. With a slurping sound, his dick begins to emerge from his body, black and fleshy. You watch with astonishment as it keeps growing and growing. Drizzlefin’s may have been as thick as your thigh, but Maelstrom’s monstrous cock is thicker than your entire body. </p>\tAt this point, there’s no turning back. You’ve already made your choice. The orca beckons with a claw. You walk on top of his muscular stomach, breathing heavily with anxiety. “Calm down, little morsel,” he taunts, “I’m sure this will be over quickly.” You internally pray that you won’t be ripped apart the moment he enters your hole. Maelstrom doesn’t give you another moment to prepare. He grabs your face with his huge hand and forces you onto his cock.</p>\tThe initial push of his dick into your hole is intense. It should be impossible, but despite his girth, he begins to slide into you. Your organs are shoved aside to make room for his enormous form. Every time his shaft inches further into your body, you shudder with strange pleasure. Maelstrom grunts, seeming almost impressed by how wide you’re opening up. </p>\tYou don’t dare look down. You know the orca’s cock only gets thicker towards the base. The skin of your belly pushes out as his giant dick shapes your body to fit it. You can feel his throbbing length under the surface. You feel the steady rhythm of his blood flowing through his cock. How your hole hasn’t been ripped to shreds, you have no idea. All you can feel is him.</p>\tMaelstrom’s slick cock worms its way through your insides. As you sink lower and lower, you feel it invading your system. It feels like his dick never ends as you keep getting shoved down by the orca. At some point, there’s a loud squelch, and you gasp as you feel his dick pop into your throat. It’s difficult to speak or breathe. You moan with pleasure as his cock pulses inside your esophagus. “Well done,” Maelstrom snickers, “I haven’t met someone who can survive my cock before. Let’s see if that endurance lasts.”</p>\tWith your body practically impaled by the porpoise’s dick, you are wholly unprepared for him to suddenly pull back and thrust with his full weight. A faint gurgle escapes your lips, muted by the orca’s tip inside you. In and out, in and out, again and again. Maelstrom laughs at your deep blush and quiet moaning. “Keep it up, dinner. I’ve got a long way to go.”</p>\tYou don’t know how much time passes. The only thing you can think about or feel is the orca’s cock in your throat. He never slows down his thrusting, rubbing your insides raw. It is only late into the night that you feel Maelstrom’s dick twitch and pulse, and with a great roar from the orca, he blasts his seed through your entire body. You involuntarily open your jaw as his cum bursts out of your mouth in a flood of sticky, white fluid. If it isn’t being shot out of your mouth like an uncorked bottle, the cum is slowly sliding and dripping back down into your body. The orca releases load after load, snarling and thrashing, gripping onto your skin and leaving bloody claw marks. It feels like there’s no end to his orgasm. You can barely sneak in a breath between each massive glob of seed that fills your mouth. The pulses slow down, and each new load becomes smaller and smaller. Finally, you feel the last dribbles of cum clog your throat as he finishes. </p>Maelstrom breathes heavily, his heartbeat racing. Regaining his composure, the orca looks up at you. Your eyes are closed, your mouth open and gasping for air. His giant cock still squishes your organs and stretches your skin. A steady waterfall of cum seeps out of your open maw. Maelstrom grumbles his approval. “I’m not used to that. It felt amazing. And I imagine you felt the same way.” He grabs you around the hips and lifts you up, unclogging your body. Your hole drips with fresh seed as he frees you from his dick. “You’re welcome, little morsel. If you want to feel that again, just stay the night with me. I’ll make sure you have a good time.”</p>He drops you onto the floor where you stay, dazed and full. Sleep overcomes you. When you wake up in the morning, Drizzlefin is poking you awake. Everything still tastes like cum, and it’s hard to think, but you smile faintly at the orca. What a night!",
                "area":"otterton_dock",
                "outcomes":[
                   {
                      "parameter":"maelstrom_time",
                      "quantity":0,
                      "change":"set"
                   }
                ]
             },
             "fail":{
                "text":"You try to shake your fear off and give Maelstrom a smirk. “Well, big boy,” you say, “show me what you can do.” The giant orca grins widely, his fangs glistening. He sits down, shaking the ground as he does. With a slurping sound, his dick begins to emerge from his body, black and fleshy. You watch with astonishment as it keeps growing and growing. Drizzlefin’s may have been as thick as your thigh, but Maelstrom’s monstrous cock is thicker than your entire body. </p>\tAt this point, there’s no turning back. You’ve already made your choice. The orca beckons with a claw. You walk on top of his muscular stomach, breathing heavily with anxiety. “Calm down, little morsel,” he taunts, “I’m sure this will be over quickly.” You internally pray that you won’t be ripped apart the moment he enters your hole. Maelstrom doesn’t give you another moment to prepare. He grabs your face with his huge hand and forces you onto his cock.</p>\tThe initial push of his dick into your hole is intense. It should be impossible, but despite his girth, he begins to slide into you. Your organs are shoved aside to make room for his enormous form. Every time his shaft inches further into your body, you shudder with strange pleasure. But something doesn’t seem quite right. As Maelstrom continues to push into you, you begin to lose feeling around your hole.</p>\tThe orca doesn’t stop stretching you out as he shoves into your ass, but you look down. Your hips have started to turn a fleshy pink, matching the enormous cock entering you. Your genitals fuse with the giant shaft. Your legs begin to retract into its length. Panic begins to spread. You struggle to free yourself from Maelstrom’s dick, but your resistance is futile. Your body is already half merged with his cock.</p>\tMaelstrom chuckles as you squirm. He grabs your mouth and holds it closed. “Shh, fresh meat,” he teases, “you’ll be enjoying it soon enough.” As Maelstrom’s cock continues to push through you, your body stretches to fit it. Your skin continues to turn pink. When his dick forces its way further in, the changes spread upwards. Your midsection completely fades into his bulging, veining length. His tip is so far in, you can start to feel him in your throat. </p>\tThe orca grabs your sensitive flesh with a clawed hand and begins pumping. You blush and moan, your heartbeat changing its rhythm to match his. Your arms meld into your sides as you continue to merge with the giant cock. Soon, all that’s left is your head. Even then, you can feel your jaw lining up with the opening of his dick. You feel his pre seeping into your mouth and mixing with your saliva. All you can do is softly gurgle silent words as you melt into his body.</p>\tMaelstrom snorts and grunts, and with one final throb, he cums. The thick ropes of his seed spew out of your mouth, staining the ceiling and drenching the orca. Every load further destroys your sanity, reducing your mind to pure lust. Every time you spit out another glob of his cum, you want more. Maelstrom spews liter after liter through you, roaring and thrashing as he does so. </p>When he finally slows down, the loads of seed becoming small drops, you feel disappointed. You twitch, sending pleasure through the rest of the orca’s body. Maelstrom chuckles and strokes you, making you shake with a horny need. “When the sun sets again, I’ll give you another chance,” he promises. You twitch again to show your approval and the orca grins. “Good…”</p>Drizzlefin awakes in the morning to find his dick still fully erect and dripping pre. It doesn’t take him long to realize where you’ve gone. He sadly strokes you, making you throb, ready to serve the orca.",
                "trapped_desc":"You are Drizzlefin's thick, throbbing orca cock",
                "trapped":"You are Drizzlefin's thick, throbbing orca cock",
                "outcomes":[
                   {
                      "parameter":"maelstrom_time",
                      "quantity":0,
                      "change":"set"
                   },
                   {
                      "parameter":"trapped",
                      "quantity":28,
                      "change":"set"
                   }
                ]
             },
             "rareFail":{
                "text":"You try to shake your fear off and give Maelstrom a smirk. “Well, big boy,” you say, “show me what you can do.” The giant orca grins widely, his fangs glistening. He sits down, shaking the ground as he does. With a slurping sound, his dick begins to emerge from his body, black and fleshy. You watch with astonishment as it keeps growing and growing. Drizzlefin’s may have been as thick as your thigh, but Maelstrom’s monstrous cock is thicker than your entire body. </p>\tAt this point, there’s no turning back. You’ve already made your choice. The orca beckons with a claw. You walk on top of his muscular stomach, breathing heavily with anxiety. “Calm down, little morsel,” he taunts, “I’m sure this will be over quickly.” You internally pray that you won’t be ripped apart the moment he enters your hole. Maelstrom doesn’t give you another moment to prepare. He grabs your face with his huge hand and forces you onto his cock.</p>\tThe push of his dick against your hole is intense. His flesh, wet with pre, attempts to slide into your body. However, you can’t seem to even fit the very tip of his cock. You stare back at Maelstrom with embarrassment. The orca has the strongest look of disappointment you’ve ever seen. “Can’t even entertain me for a minute, snack?” Maelstrom grunts. He lifts you up with a firm hand. “Well,” he considers, “if I can’t fit inside you, maybe you can fit inside me.” Your brain struggles to process what he means, but no amount of preparation would help you.</p>\tThe porpoise holds your calves tightly together, using his other hand to keep you straight. His erect dick flops towards you, twitching with anticipation. You realize the orca’s intentions too late. He grins eagerly and forces your feet into his cock’s slit. </p>\tMaelstrom gasps and softly moans. The noises are surprisingly gentle for the huge beast. His handling of you is much rougher. After the initial pleasure of sliding your feet into his dick, the orca is excited to finish the job. He pushes you in, his slit opening up to swallow you whole. As your legs are forced further down his shaft, you begin to feel the sloshing of cum against your soles. It’s warm and comforting. Your fear eases as more of your body slips into Maelstrom’s cock. You know a lovely bath of sticky seed awaits you at the bottom.</p>\tThe orca grunts as he fits your torso into his shaft. When only your head remains exposed, he teases you one last time. “Now you’ll make yourself useful.” With those last words, Maelstrom uses a finger to pop your head into his slit. Inside it’s pitch black. You easily slide down the slick interior. At the end, you splash into a pool of hot cum inside the giant orca’s body. You sink in up to your chin. The waves of seed occasionally slosh into your mouth. It tastes amazing, draining your mind of thoughts, leaving you dizzier with each gulp.</p>\tLittle do you know the orca is pumping his dick above you. On top of that, your toes are beginning to fade, melting away into the warm bath around you. The cum slowly disintegrates your body, turning your flesh into more seed. All you can think about is the wonderful sensation of cum running down your throat. Your nostrils, ears, even your eyes, all start dripping fresh seed. Your legs and torso fade and merge into the pool. Your brain turns to mush as you become completely lost in the cum. It isn’t long until, with a great thrashing of his body, Maelstrom shoots you out full force from his cock. You splatter all across the ceiling of the small shack, dripping back down onto the orca and the bed underneath him. The porpoise eventually finishes his orgasm, murmuring softly about how you actually contributed to his pleasure for once.</p>\tWhen the sun rises, Drizzlefin opens his eyes to see the giant stain of cum, you, on the metal roof above him. He sighs, not knowing that you’ve become a permanent decoration on his ceiling.",
                "trapped_desc":"You are nothing but a musky cumstain in Drizzlefin's shack",
                "trapped":"You are nothing but a musky cumstain in Drizzlefin's shack",
                "outcomes":[
                   {
                      "parameter":"maelstrom_time",
                      "quantity":0,
                      "change":"set"
                   },
                   {
                      "parameter":"trapped",
                      "quantity":29,
                      "change":"set"
                   }
                ]
             }
          }
       }
    ],
    "npcs":[
       {
          "id":"drizzlefin",
          "name":"Drizzlefin",
          "requirements":[
             {
                "parameter":"maelstrom_time",
                "value":1,
                "comparison":"less"
             }
          ],
          "description":"Drizzlefin is a huge orca who has to bend slightly to stand in the small space. His sleek black and white skin pulses with large muscles. He smiles shyly whenever you look at him.",
          "icon":"drizzlefin",
          "dialogue":[
             {
                "input":"What is your name?",
                "output":"“I’m Drizzlefin… if it’s easier, you can call me Fin! Folks around here do.”"
             },
             {
                "input":"What do you do around here?",
                "output":"“I’m just another sailor and fisherman, nothing special. I make enough to keep this little place, at least.”"
             },
             {
                "input":"See you later",
                "output":"“Oh, ok! I, uh… I hope I’ll see you again soon!”"
             },
             {
                "input":"What's up with all the scratch marks?",
                "output":"“It wasn’t me! Whoever lived here before me must’ve made em… yeah, that’s it!”"
             },
             {
                "input":"Can I see your cock?",
                "output":"Drizzlefin blushes and stammers, “I… you really… I guess I could… um…” He gives up trying to make any sense. With one large hand, he lowers his raggedy pants and reveals his already erect cock. His fine specimen is as thick as your thigh and just as long. It takes a moment for Drizzlefin to notice he’s dribbling pre. When he does, he quickly yelps and hides his cock back in his pants."
             },
             {
                "input":"Can I see your feet?",
                "output":"“Sure… sorry I don’t have any paws. I heard a lot of people up north like that stuff.” He sits down on his tail and lifts a foot that’s larger than your entire head. His sole smells strongly of seawater and salty sweat. After a minute or two, Drizzlefin lowers his foot once more and blushes at your intense expression."
             }
          ]
       },
       {
          "id":"maelstrom",
          "name":"Maelstrom",
          "requirements":[
             {
                "parameter":"maelstrom_time",
                "value":0,
                "comparison":"greater"
             }
          ],
          "description":"Maelstrom is gigantic, much taller and stronger than the kind orca you met before. His sharp fin punctures the roof. His eyes follow you, his body tensed and ready to strike if you attempt an escape.",
          "icon":"maelstrom",
          "dialogue":[
             {
                "input":"What is your name?",
                "output":"The orca sneers. “Maelstrom. It just may be the last name you hear.”"
             },
             {
                "input":"What do you do around here?",
                "output":"“I’m the better version of that pitiful, blubbering orca you already know. Sadly, I’m limited to just a third of the day… if only I had more time…”"
             },
             {
                "input":"See you later",
                "output":"“Who said you could leave?”"
             },
             {
                "input":"What's up with all the scratch marks?",
                "output":"“With claws as sharp as these,” the orca says as he flexes his hand, “it can be difficult to maintain an impeccable home.”"
             },
             {
                "input":"Can I see your cock?",
                "output":"He smiles, chuckling softly. “Just look down,” he says. You do and find a frighteningly large dick pointed at your face. Pre oozes constantly out of it, wetting the space around you. The thought of this cock ripping you open or swallowing you whole is both tempting and worrying."
             },
             {
                "input":"Can I see your feet?",
                "output":"“Don’t bother with something as trivial as feet, stupid snack. I have better things planned for you.”"
             },
             {
                "input":"What are you going to do to me?",
                "output":"“Depends how much you force me to chase you,” the orca teases. “One way or another, you aren’t leaving this shack.”"
             }
          ]
       }
    ]
 }