{
    "title":"ping_camp",
    "header":"The Camp",
    "nomap":"You are trapped within a Faerie Circle, you must partake of the festivities or find an escape before you may leave.",
    "subheader":"You find yourself in an unusual campsite composed of one red and yellow carnival tent surrounded by tables of food and drink, which smell fresh and appetizing. It is lined with a faerie circle that glows and sparkles. Outside of it, time appears to be at a standstill, adding to the strangeness of the unusual location. There are only two people in here, you and your apparent host, or rather captor.",
    "events":[
       {
          "id":"revel",
          "title":"Revel in the Party",
          "subtitle":"Nysus grabs the large pitcher in front of him and a pewter mug and begins to pour a pint of purple wine. As it flows out into the cup, you could swear it slightly glows. He then sets the mug down on the table and looks at you. “Come, join me and drink your woes away.” He then throws his head back and begins to pour the wine into his maw, gulping it down with streams of it flowing past his mouth and dripping down his naked frame. ",
          "type":"random",
          "requirements":[
             {
                "parameter":"species",
                "value":63,
                "comparison":"nequal"
             },
             {
                "parameter":"gender",
                "value":1,
                "comparison":"equal"
             }
          ],
          "icon":"tffetish",
          "results":{
             "grizzsex":{
                "text":"You walk forward, past the mug and toward Nysus, confidence in your step. He lowers his pitcher and for a second his expression begins to turn sour; however, before he can swallow the last of the wine that entered his mouth you are on top of him. You bring him into an embrace and move into a sloppy kiss. Nysus realizes at this and smirks before your lips touches his. As you kiss, rubbing up on him a little, the wine he was going to swallow goes from his mouth to yours. The taste is almost overwhelmingly sweet, but you swallow it whole without breaking the kiss. Despite the warmth of the kiss, the feeling of the liquid going down and settling in your belly begins to take precedence. You begin to feel a flush of warm coupled with a tipsy feeling, as you grip on Nys- er Nis-, you find that it is hard to remember his name, so you just think of him as a hot goat man.  It is then said hot goat man breaks the kiss, whispering into your ear, “A man after my own heart, eh?”</p>\tHe then, without warning, lifts you up, and lays you out on the table, knocking much of the food and drink onto the ground. Despite the situation, you can’t help but feel a slight feeling of disappointment at the wasted food, however that concern is soon gone as his strong hands begin to move apart your legs splaying you on the table. He smirks, as he lifts his equine member, moving it into a ready position. Even in your drunken haze you realize it is massive at full mast, being at nearly two feet in length and thick enough to make you sweat a little. However, as if he anticipated your worry, he whispers, whilst pouring some of that strange wine onto the engorged penis, “Don’t worry, it’ll be pure bliss~” </p>\tHe then slowly pulls you back toward him, his cock brushing against your ass. You sweat a little and brace yourself, expecting it to be rough and painful. Instead, you find that he was correct as he thrusts forward. Instead of pain, you feel an extreme heat followed by indescribable pleasure. As he enters you, stretching out your hole, you moan out loudly, the feeling both intoxicating yet sobering. You wrap your legs around him as he thrusts in more, and it doesn’t take any time for him to hit your G spot. However instead of you moaning at this, a loud bleat escapes your lips shocking you a little.</p>\tYou don’t have long to think on why you did that however, as it is then when he starts in earnest. With that bleating as a cue, he begins to ram at you fast and hard, making sure to hit that spot each and every time. You feel his equine cock roughly stretch out your ass, going in and out with little care as he ruts into you. However, as before, this is somehow only pleasurable for you, your bleating a telltale giveaway of that. You feel yourself get closer and closer to a handsfree orgasm with each of his thrusts. Until finally, you cum, strings of it splashing onto the chest of your bovid lover. Despite this, Nysus doesn’t stop or give you a break, instead he keeps pounding away, interrupting your afterglow.</p>\tAs he continues to rut into you, you begin to notice that you feel different, past the drunkenness, and past the warmth in your rear. You feel a little uncomfortable, as if you were being pinched all along your body, the strongest of this feeling centered around your forehead. You move a hand up to rub against it and to hopefully relieve yourself of the uncomfortable feeling. Instead of what would normally be there, your hand meets the tips of two small horn nubs. You realize immediately what is happening, and at first there is a sense of shock coupled with the familiar feeling that someone is changing you to fit their desires. But your lover, anticipating your apprehension, brings that familiar pitcher from his side up, pouring the savory wine forcibly down your lips. As before it doesn’t take long for it to go to your head, your mood dulling to a happy drunken one.</p>He then leans in and whispers something, “You should just let loose, lose all those worries and join me… Party our cares away, as Satyrs should…” The words ring truer in your mind than any thoughts you could formulate in your drunken haze. You should just enjoy yourself; you are a Satyr, why would you do anything else? As this happens the transformation continues throughout your body, your feet having compressed into goat like hooves and the legs slowly being covered in coarse brown hair, with a small goat tail. Nysus then grabs at your new legs tightly, splaying them as his rutting grows in speed and veracity, a few bleats escaping his own lips as he gets closer and closer to his own orgasm. As the transformation reaches your own cock, you begin to feel horny again, your newfound lust barely being sated by the domineering male on top of you. As your dick becomes more equine, it grows harder and harder, taking your attention away from the rest of the changes wracking your body. </p>Your chest changes into a normal human one, albeit very hairy and skinnier than Nysus’s. Your arms likewise, are slightly muscular and hairy, with large rough hands. Lastly, the nubs from before rapidly grow into full goat horns weighing down your head a little, signifying your full transformation. Then, without any warning, Nysus cums, the semen gushing out of your ass with no room to contain it. He stays there panting for a bit, his cock growing a little softer inside of you. When his breath levels out, he pulls out, causing more of his seed to pool out onto the table. With one hand he helps you up and gives you a quick pat on the back. “We are going to have so much fun together.” You smile and nod in agreement.",
                "descriptionchange":"This adventurer is a skinny and hairy Satyr, with goat legs and two small horns on their head. They are likely to be seen drunk and partying more often than not.",
                "outcomes":[
                   {
                      "parameter":"species",
                      "quantity":63,
                      "change":"set"
                   }
                ]
             }
          }
       },
       {
          "id":"badtouchten",
          "title":"Bide Your Time (And Try to Enjoy It)",
          "subtitle":"Nysus grabs the large pitcher in front of him and a pewter mug and begins to pour a pint of purple wine. As it flows out into the cup, you could swear it slightly glows. He then sets the mug down on the table and looks at you. “Come, join me and drink your woes away.” He then throws his head back and begins to pour the wine into his maw, gulping it down with streams of it flowing past his mouth and dripping down his naked frame.",
          "type":"random",
          "requirements":[
             
          ],
          "icon":"random",
          "results":{
             "1":{
                "text":"You reluctantly walk up and grasp the cup he offered, thinking it best not to offend the man, and begin to sip at the wine. The taste of it is almost overwhelmingly sweet and unusual, but despite that you feel as if you can’t get enough, and soon you gulp down the rest, wanting more. Nysus laughs and exclaims, “Parched it seems, if you are that thirsty I’m sure you would be hungry too!” Upon him saying those words, you realize you are hungry and thirsty, even though mere moments you were relatively content; right now, you are ravenous. You look at the food and drink on the table, it seemingly radiant, almost as if it is glowing: the meat succulent and glistening; the fruit colorful and lively; and the drinks have condensation dripping along the sides.  Your mouth waters at the sight of it, and you look up at your Satyr host, as if to ask permission. He then laughs again, and says, “Help yourself.” After that it is a complete blur of stuffing your face with everything at the table, eventually passing out after an overwhelming amount of overindulgence. Later you wake up, some half-eaten food messily strewn about you, you don’t know how long it has been since you passed out, let alone when you started stuffing yourself. You groan as you get up, noticing that your belly is just a little bit fatter.",
                "outcomes":[
                   {
                      "parameter":"time",
                      "quantity":1,
                      "change":"add"
                   }
                ]
             },
             "2":{
                "text":"You reluctantly walk up and grasp the cup he offered, thinking it best not to offend the man, and begin to sip at the wine. The taste of it is almost overwhelmingly sweet and unusual, but you sip it down easily. After you finish the cup, you feel a bit tipsy and warm. You think that since you only had one cup that you couldn’t be drunk, and so you ask for another, albeit with a bit of a slur. Your host obliges and pours more of the wine, as he does so you swear you spot a sparkle flow from the pitcher into the cup. As you sip, you mention that, not with suspicion but with more of a drunken astonishment. At this he says, “Oh that, it’s nothing, just some… presentation…” You just accept this at truth, praising him for the little party trick. You continue to sip and ask for more cups, getting drunker and drunker, and subsequently even more jolly. It is not until your fifth cup your host speaks again, “Speaking of presentation, I haven’t seen a show in some time, you wouldn’t mind indulging me in say getting on that table and dancing for me?” It takes more than a few moments for his request to click and then without any apprehension you say you can try. You shakily get onto the table, the wood being very sturdy and supports your weight very easily. Once you get on, and once ‘you lose that sense of vertigo, you begin to sway a bit. It is slow at first, you being very unsure of what he exactly wants. But then a thought crosses your mind, he wants a show. You begin to make your movements a bit more sensual, rubbing along your body with your hands, moving your butt out a bit, showing off your assets. You notice Nysus is enjoying it, his legs wide open showing off his growing member. However, as you begin to pay attention to that, you don’t notice exactly where your foot went, and so you slip on a roast pig that was slightly in front of you. You crash onto the table, scattering dishes and food. For a few moments there is just silence, and then the both you erupt into laughter. This continued for a few moments until he offers you another drink, which you heartily accept. After that, you remember nothing and wake up with a hangover outside the tent.",
                "outcomes":[
                   {
                      "parameter":"time",
                      "quantity":1,
                      "change":"add"
                   }
                ]
             },
             "3":{
                "text":"You reluctantly walk up and grasp the cup he offered, thinking it best not to offend the man, and begin to sip at the wine, noting the sweet taste. However, as you grasp the cup tighter it cracks and shatters, a surprisingly large amount of wine gets everywhere, most of it on you and the Satyr. For a few moments there is just silence, but then he just starts laughing and laughing as if it was the most hilarious thing. While he does so, his grip on the pitcher loosens a bit, causing a stream of the sweet tasting wine to pour onto his crotch. After he stops laughing, wiping a small tear from the corner of his eye, he looks straight at you with a hungry smile and points down at his legs spread out wide showing off his large member dripping with the purple liquid. He then says with a slight edge to his voice, “Oh Guest, it looks like you made quite the mess. I think you should help clean it up.” He beckons you forward, and you, feeling a strange warmth and fuzziness in your head, comply reluctantly. You walk forward stopping just in front of him and gulp a little, seeing your hesitation he then says demandingly and tersely, “Kneel.” You feel a strange need to obey his order, so you do, getting onto your knees, his dripping cock pointed directly in front of your face. You begin to slowly lick at it, tasting the wine on your tongue immediately. At first, your licking is slow and apprehensive, but as you lick up more of the wine your head begins to grow fuzzier. Your licking grows more and more dedicated, your tongue seeking out more of that delicious fluid. It doesn’t take long for you to completely clean off all the wine that poured down onto his dick; however, you don’t stop licking, instead you continue your ministrations on his penis as you begin to suck him off in earnest. You move in further, his cock barely fitting into your mouth. However, you don’t get to know for sure if you could take if further as you feel a hard hoof push you back suddenly. You fall back, knocking over one of the chairs that lined the table and look at the Satyr, who smirks smugly. “I asked you to clean, and there’s still a mess around me…” He points at a rag in the corner, gesturing for you to get it and clean up the tent. The rest of the night seems to be a blur, as you continue to clean the messes that you somehow accidentally make, making both your hands and jaw sore.",
                "outcomes":[
                   {
                      "parameter":"time",
                      "quantity":1,
                      "change":"add"
                   }
                ]
             },
             "4":{
                "text":"You reluctantly walk up and grasp the cup he offered, thinking it best not to offend the man, and begin to sip at the wine. The taste of it is almost overwhelmingly sweet and unusual, but despite that you feel as if you can’t get enough, and soon you gulp down the rest, wanting more. And your host obliges, practically pouring it into your open maw, each drop of the unending torrent making everything else become a tipsy blur until you finally pass out, your head sore, and mysteriously so also your behind.",
                "outcomes":[
                   {
                      "parameter":"time",
                      "quantity":1,
                      "change":"add"
                   }
                ]
             },
             "5":{
                "text":"You reluctantly walk up and grasp the cup he offered, thinking it best not to offend the man, and begin to sip at the wine. The taste of it is almost overwhelmingly sweet and unusual, but despite that you feel as if you can’t get enough, and soon you gulp down the rest, wanting more. Nysus however has a different idea, he proposes a little game, which you agree to quite eagerly before even hearing the rules. Which are simple, whoever cums first gets the drink all to themselves while the other has to drink up a different kind of juices. And so wildly and messily you touch yourself, really wanting that drink. Except, you can’t seem to get off, something blocking you. Even as you get to the edge you can seem to push past it, until finally a splatter from your host hits you in the face. He laughs out and takes a large swig, some of it dripping out the sides of his smiling mouth. You spend the rest of the evening sobering up as you lick on his member cleaning up every last drop, the smell of his cum staying with you well after.",
                "outcomes":[
                   {
                      "parameter":"time",
                      "quantity":1,
                      "change":"add"
                   }
                ]
             },
             "6":{
                "text":"You turn out to be quite the lightweight, after just one sip you pass out. Eventually you awaken, Nysus looking down at you with an expression that displays just a bit of disappointment.",
                "outcomes":[
                   {
                      "parameter":"time",
                      "quantity":1,
                      "change":"add"
                   }
                ]
             }
          }
       },
       {
          "id":"grue_vore",
          "title":"Refuse and Try to Leave",
          "subtitle":"Nysus grabs the large pitcher in front of him and a pewter mug and begins to pour a pint of purple wine. As it flows out into the cup, you could swear it slightly glows. He then sets the mug down on the table and looks at you. “Come, join me and drink your woes away.” He then throws his head back and begins to pour the wine into his maw, gulping it down with streams of it flowing past his mouth and dripping down his naked frame. His offer seems suspicious making you think that you already want out of this strange time locked place.",
          "type":"random",
          "requirements":[
             
          ],
          "icon":"vorefetish",
          "results":{
             "success":{
                "text":"You plainly tell the Satyr that you are going to leave and promptly turn to go. As you do so you hear him say coldly, “No one gets to leave without my permission.” You ignore the threatening statement and exit the tent heading for where you initially crossed the ring of mushrooms. You look up and see that the same bird you spotted earlier is still frozen in place, making you wonder if you can really just leave without any repercussions. You shake your head, trying to clear away such doubts and then attempt to step across the circle.</p>\tYou move your foot over the mushroom and then all of a sudden freeze. You find that you can’t move a muscle, your body standing there like an awkward statue with your eyes affixed to staring at your foot. The sensation of being frozen doesn’t hurt, instead it feels a bit tingly, similar to the sensation one experiences when a leg or arm falls asleep. For what feels like an eternity, you stand there, completely petrified, unable to struggle or even speak. Eventually, you hear the sound of hooves walking toward you, which stops just behind you. “I told you, no one leaves till I say so. A rude guest like you doesn’t deserve to be treated with the respect and kindness a host like me has provided. A true disappointment, party-pooper, complete waste of my time…” He continues to rail off minor insults and grievances to his captive audience, only pausing every so often to take a drink, until finally he sighs and then says, “You know, there actually may be one thing a disrespectful wretch as yourself can be good for, quality dinner.”</p>\tYou feel a rough hand push lightly into your back followed by a feeling of extreme heat. Whereas before it was mild, you now feel sweltering, almost as if you were in an oven, the thought crossing your mind that he may in fact be cooking you. After his touch leaves your back, he continues talking to you, fully aware of your inability to respond, “All the food I can produce magically is nice and all, but it can’t beat that which is procured freshly.” The heat continues to swelter, increasing in intensity and causing you to begin to sweat. The Satyr grabs you by the shoulders and then turns you around to face him directly, his hungry grin and drunken blush looking far more malevolent than it did earlier. “Now I wonder what you’ll be. A chicken leg? Or maybe some good ol’ fashioned pumpkin pie. Everyone of you malcontents are different.” </p>His hand strokes against your cheek possessively and then without warning he moves his face in and gives it a long vertical lick. He backs off saying, “This taste… This is the taste of Spellbread. Delicious, you can never get any of that here.” With him standing in front of you, you begin to realize that you are shrinking bit by bit, your height and point of view lowering, all why the heat grows in intensity. The last thing you see on Nysus’s face before it slides out of your vision completely is his mouth watering a little. As you shrink, you begin to realize that your arm and leg, that were previously stuck in front of you, have begun to recede a bit, the color and texture of them becoming significantly and alarmingly bread-like. </p>The shrinking continues until finally your vision is level with the ground, the heat from before instantly stopping as the shrinking had stopped. Your body feels weird in this state, the knowledge that you are a loaf of spellbread combined with the fact that you are completely lucid. You no longer feel petrified, although you would not be able to move even if you wanted. You don’t have long however to parse out exactly how you feel about this predicament, let alone figure out exactly what kind of spell bread you are, as a familiar rough hand grips tightly around you, lifting you rapidly. Another hand dusts off your bottom of dirt and grime from being on the ground and then, without any words or final taunts, he shoves you into his mouth whole, quickly chewing and swallowing you, removing the “troublesome guest.”",
                "area":"belly",
                "outcomes":[
                   {
                      "parameter":"time",
                      "quantity":0,
                      "change":"set"
                   }
                ]
             }
          }
       },
       {
          "id":"goleave",
          "title":"The Trade",
          "subtitle":"You feel relatively trapped in this time locked campsite. Maybe if you offer the right thing, your captor may let you leave, or at least you hope he will. Looking through what you have on hand, there is only one thing you possess that may be able to interest a satyr, wine. ",
          "type":"random",
          "requirements":[
             {
                "parameter":"wine_1",
                "value":99,
                "comparison":"greater"
             }
          ],
          "icon":"wine_1",
          "results":{
             "success":{
                "text":"You quickly offer Nysus a large amount of the wine you had stored in your pack. He looks at the offering a little bemused for a second, and then smiles wide exclaiming, “Ah, you brought me a gift! How very generous of you. Most other guests don’t even have the common decency to offer me the smallest of tithe after I have so graciously invited them to join me.” He stands up clapping his hands once into a held state, “I accept your gift. In fact, you are free to go at your leisure, after a drink of course.” He walks over quickly and takes the many bottles of wine off of you, putting them down behind his chair, and coming back with two glasses containing a sparkly blue liquid. “The finest I have to offer my friend, drink up,” he says before downing his glass quickly. He then pauses before handing you your glass and says, “It actually has been awhile since I was offered a gift. How about I give you one of my own?” He places the cup down on the table and goes back to his throne, picking up a bronze pitcher you didn’t spot before. “Fey enchanted, you’ll never want for drink again, and it may help in loosening lips and all that,” he says placing the pitcher next to the glass. You begrudgingly accept the pitcher and drink and gulp down the strange liquid, it being exceedingly bitter and sour. You cough out a bit looking up at the satyr and realize that everything is a weird swirly blur, just before everything turns into darkness. Sometime later you wake up on the ground, outside the ring of mushrooms with a familiar bird pecking at your head, worsening the not so mysterious aching hangover. ",
                "area":"ping_forest",
                "outcomes":[
                   {
                      "parameter":"time",
                      "quantity":0,
                      "change":"set"
                   },
                   {
                      "parameter":"wine_1",
                      "quantity":100,
                      "change":"sub"
                   },
                   {
                      "parameter":"everlasting_pitcher",
                      "quantity":1,
                      "change":"add"
                   }
                ]
             },
             "fail":{
                "text":"You quickly offer Nysus a large amount of the wine you had stored in your pack. He looks at the offering a little bemused for a second, and then smiles wide exclaiming, “Ah, you brought me a gift! How very generous of you. Most other guests don’t even have the common decency to offer me the smallest of tithe after I have so graciously invited them to join me.” He stands up clapping his hands once into a held state, “I accept your gift. In fact, you are free to go at your leisure, after a drink of course.” He walks over quickly and takes the many bottles of wine off of you, putting them down behind his chair, and coming back with two glasses containing a sparkly blue liquid. “The finest I have to offer my friend, drink up,” he says before downing his glass quickly. You begrudgingly accept and gulp down the strange liquid, it being exceedingly bitter and sour. You cough out a bit looking up at the satyr and realize that everything is a weird swirly blur, just before everything turns into darkness. Sometime later you wake up on the ground, outside the ring of mushrooms with a familiar bird pecking at your head, worsening the aching hangover.",
                "area":"ping_forest",
                "outcomes":[
                   {
                      "parameter":"time",
                      "quantity":0,
                      "change":"set"
                   },
                   {
                      "parameter":"wine_1",
                      "quantity":100,
                      "change":"sub"
                   }
                ]
             }
          }
       },
       {
          "id":"theparty",
          "title":"The Party",
          "subtitle":"You may want to leave eventually, but right now you just want to party with your lover Nysus. The next few years will be a blast.",
          "type":"random",
          "requirements":[
             {
                "parameter":"species",
                "value":63,
                "comparison":"equal"
             }
          ],
          "icon":"tffetish",
          "results":{
             "success":{
                "text":"You and Nysus get along like two peas in a pod, enjoying yourselves immensely. Every waking hour you and he eat, drink, and/or have sex constantly. Occasionally, another fool wanders in, and you two have your way with them till they either become food or leave. If time worked normally in this campsite, years would have passed, the constant overindulgence taking a toll on your body, though in your eyes none of the changes are negative. Whereas your physique was relatively normal before, now you have a sort of muscle-gut, the fat only accenting the slight muscular frame and making you prouder. Additionally, you begin to grow a goatee of your own, the facial hair making you seem aged up considerably. Lastly, your own equine cock slowly grows out, rivaling Nysus’s in length and girth while also nearly impossible to sate, the true lustful cock of a satyr. If one was to see the two of you, they would think you brothers, and you wouldn’t do anything to dissuade that notion. Eventually you get bored of the repetition, the only new thing being that occasional fool that crosses the circle, but even then, most of them act very predictably. And so, you decide to leave, having one final toast with your compatriot and leaving to continue your adventures, with a new pleasure focused outlook on life. ",
                "area":"ping_forest",
                "descriptionchange":"This adventurer is a large, hedonistic Satyr, with a musclegut, goat legs, and two small horns on their head. A large equine cock always drips between their legs, ready for the party. They are likely to be seen drunk and partying more often than not.",
                "outcomes":[
                   {
                      "parameter":"time",
                      "quantity":0,
                      "change":"set"
                   }
                ]
             }
          }
       },
       {
          "id":"leaveamicably",
          "title":"Leave Amicably",
          "subtitle":"You have spent enough time in this strange camp, although you wouldn’t be able to tell from the outside world. You feel like it may be as safe as it would ever be to confront him and demand to leave.",
          "type":"random",
          "requirements":[
             {
                "parameter":"time",
                "value":4,
                "comparison":"greater"
             }
          ],
          "icon":"navigateicon",
          "results":{
             "success":{
                "text":"You bide you time a bit and then when you think Nysus is at his cheeriest you begin to press the issue. You try and phrase it in a way that conveys that you are grateful for the party he has thrown but you feel that you have taken up enough of his time. After you finish your spiel, attempting to seem as polite and earnest as possible, he looks at you for a few seconds as if thinking hard and then says, “Of course, it’s only polite to ask for permission.” He then stands up, grabbing a glass of sparkling blue liquid from behind his throne. “How about one final toast, for the farewell?” You begrudgingly accept, a little suspicious of the drink but wanting to get on with your journeys. You take the glass in hand, and hold it looking at the sparkling lights that seem to float in it. Nysus then says with a flair, just before tipping back his own pitcher of wine, “To our continued enjoyment of all life’s wonders!” At this you slightly raise your glass and then down it quickly. The taste is extremely bitter making you want to cough it out, you look to the Satyr incredulously and notice that everything is in a swirly blur. You are about to say something to Nysus before everything becomes inky darkness. Sometime later you wake upon the ground, a familiar bird pecking hard against your head, worsening a not so mysterious hangover. ",
                "area":"ping_forest",
                "outcomes":[
                   {
                      "parameter":"time",
                      "quantity":0,
                      "change":"set"
                   }
                ]
             }
          }
       }
    ],
    "npcs":[
       {
          "id":"nysus",
          "name":"Nysus",
          "description":"Your “host,” Nysus, is an older looking satyr sitting in the main tent on a wooden throne, in front of him sits the largest table of food with an unusual pitcher of wine situated right in front of him. He himself is a relatively large man, with a beer gut and thick hair running up his body, however his arms and goat-like legs appear very muscular and toned. He has a long-rugged goatee surrounding his perpetually jolly smile which seems to be always on the cusp of laughing and boasting, Lastly he talks almost as if he was completely sober albeit with a drunken slur at the end of each sentence.",
          "icon":"satyr",
          "dialogue":[
             {
                "input":"What is your name?",
                "output":"“You haven’t heard of me? And I thought my esteemed guest wanted to join one of my world-famous parties! If you must know, I am your gracious host, Nysus the Great, but you can just refer to me as Nysus.”"
             },
             {
                "input":"What is your job?",
                "output":"“Job?!” He then laughs as if what you said was completely ridiculous. After he finally tires down from it, he says a little incredulously “Guest, I don’t need a job! If there’s a Job for me, it is to enjoy all the pleasures of this earth. Food, drink, flesh, it is all for my enjoyment. Any and all are allowed to join me of course…” His grin seems to look slightly ravenous at that last part."
             },
             {
                "input":"Why do you keep calling me \"guest\"?",
                "output":"“What else would I call you, you didn’t give me a name, and you are my guest, I am so glad to have one after some time I’ll let you know.”"
             },
             {
                "input":"Can I just go?",
                "output":"His expression instantly grows a bit dark, a slight chill filling the air around you. “You only just arrived, stay and don’t joke like that,” he says coldly and without the typical drunk slur. And then as fast as it came, the cold disappears, his mood having switched just as fast."
             },
             {
                "input":"What is going on, why is nothing outside the circle moving?",
                "output":"“Cause it is time to party, and we have no time for anything else… Just relax and enjoy the moment forever!” He gives no other explanation."
             },
             {
                "input":"How is your cock?",
                "output":"“Heh, it is quite fine.” He then opens his legs letting you see it in its full ‘glory’. It is surprisingly large, its equine length being at nearly a foot and half as thick as a forearm. Below hangs his ballsack, which also seems massive compared to the Satyr’s body. You stare at it for a bit, as he shows off, apparently an exhibitionist, before breaking the silence. “Though it could be better if someone tended to it… I jest of course,” he says as he closes his legs, tucking the member away."
             },
             {
                "input":"What are your paws like?",
                "output":"“I don’t have paws, see?” He then raises his goat leg up showing off the dark cloven hoof. He then lowers it and then says, “Though I don’t mind you checking on them…”"
             }
          ]
       }
    ]
 }