{
        "title": "riverford",
        "header": "Ruins of Riverford",
        "position": [0.60,0.04],
        "mapId": "worldmap.jpg",
        "subheader": "There may have been a small village or town once, at this point where the river is bridged by a path of small stones. But now all that remains is a few lumps and ridges that might once have marked out walls and houses. The soil is dark and dead; nothing has grown here for a long time.",
        "events": [
            {
                "id": "trainmagic",
                "title": "Lingering Malice",
                "subtitle": "Whatever happened in this place, it has left a stain, both physical and supernatural. The blackened soil stinks of corrupt magic, to those who know the scent. You could train your magic here, but it will be high risk and high reward. Who knows what angry spirits still lurk?",
                "type": "statcheck", 
                "stat": "magic",
                "difficulty": 80,
                "requirements": [
                    
                ],
                "icon": "magic",
                "results": {
                    "success": { 
                        "html": "data/active/RiverfordTraining.html",
                        "outcomes": [
                            
                        ]
                    },
                    "fail": { 
                        "text": "You take appropriate precautions, first. You draw out a magic circle in chalk, and press your finger to the white lines as you fill them with a small burst of energy. Any entities or magical spirits that cross the line will cause the chalk to flare up again as it drains the nearby magic to maintain your spell.</p>Next, you lay out some candles. Fire is not alive, but it mimics life as it flickers and dances, so it is very sensitive to magical meddling. It will act as another warning if something approaches. As you look down at your preparations, you feel an odd sense of nostalgia. Where did you learn all of this, again?</p>You shake your head and concentrate. It won't do to be distracted right now. To train properly, and really attune to the ambient magic in the air, you'll need to be naked. You strip down, pulling off your shirts, pants and boots, before placing them in a neatly folded pile on the ground.</p>Then, shivering slightly in the cold air, you cross your legs, and begin to meditate.</p>Time passes slowly, as you breathe in and out, emptying your mind and attuning your senses. The sun slowly crawls down in the sky, and twilight begins to draw in. The points between night and day are a powerful magnet for magic. You feel spirits and entities starting to rise up from the ground. They are like little glowing lights, visible only to your magical senses.</p>The lesser spirits and malice-entities slowly push against your magic circle, and then pop through. They float around you, led on basic, simplistic instincts.</p>The spirits start to take on shapes, becoming something like glowing, barely-visible hands. They touch and stroke your bare body, feeling your skin, teasing your chest and nipples.</p>More hands lift up your feet, and start to stroke and squeeze your toes and soles. Then even more are drawn in, and they grab your wrists. You are pulled up into the air, unable to struggle free even when more hands start to stroke your thights, your rear, and your crotch.</p>You gasp as you feel two fingers slide up into your ass. They start to pump and tease inside you, while more hands grip your cock and start to stroke. Even more massage your balls, hands now everywhere on you, on every inch of your skin, teasing and touching you.</p>You moan and wriggle as the hands stroke and tease and pump you almost to climax, leaving your cock dripping and oozing with pre. Then, they slow down. You struggle, desperate to cum, but they keep you right on the edge. Just as you start to calm down, they begin to pump again.</p>It carries on like that all night. Your body hot, flushed and sweaty, desperate to cum, but always kept just barely away from what you need. Soon all it takes for them to get you right to the edge is the barest touch. Hours later, as your mind is almost insane with need, the hands finally push you just over the edge.</p>Cum erupts from your cock, rising into the air and then splattering down all over your body. You arch your back and moan as you feel like you empty your balls completely, soaking yourself in jizz.</p>The magic circle fades and disappears, along with the hands.</p>You are left panting on the ground, your spell broken and with traces of magical residue glowing all over your bare skin, like glimmering cumstains.</p>This wasn't a successful meditation, but you did still learn a little from your experience.",
                        "outcomes": [{
                            "parameter": "curse",
                            "quantity": 2,
                            "change": "add"
                        }]
                    }
                }
            },{
                "id": "trainstealth",
                "title": "A Foul Smell",
                "subtitle": "There is a ripe, unpleasant stench in the air here. It's sort of swampy and sweet, putting you in mind of overripe fruit in summer, but with a nasty mix of sweat and grime, too.</p>Following it leads you to a dried-out riverbank, with a den dug out into the earth. It smells like a river troll's den. These disgusting creatures ooze slime that can be valuable as a crafting component, if you can get it without waking them.",
                "type": "statcheck", 
                "stat": "stealth",
                "difficulty": 80,
                "requirements": [
                    
                ],
                "icon": "stealth",
                "results": {
                    "success": { 
                        "text": "You creep in to the den, slowly. The stench gets more unpleasant the deeper you go, and the floor and walls are glistening wetly with layers of slime and filth. Your feet stick to the ground in places, making it difficult to be as quiet as you'd like. There are lumps of trash lying around in mounds, including the crumpled clothes of adventurers. This place is dangerous.</p></p>You don't need to travel far in to reach the troll. It is slumped on the ground near the back of the crude den. It is a huge beast, over ten feet tall, with a gut as wide and round as a boulder. Its green skin is mottled and craggy like mossy rock, but glistens wetly with slime. Gigantic arms end in two-fingered thick hands, similar to the huge humanoid feet it has, with two fat toes, and soles stained black with mud and dirt. Its head it round and hairless, with one enormous closed eye, and a pair of massive curving yellow tusks.</p>It is lying on its back, its feet and arms splayed out as it sleeps. The massive wet belly rises up and down slowly, and between its legs you can see the thick, log-sized mass of its flaccid cock. Its cock droops on the ground, covered by a grey-green foreskin. The tip of it gushes and dribbles a little with clear, slightly greenish slime. The source of the cavern's sticky floor.</p>To get any closer without waking it, you will unfortunately have to remove your footwear. You reach down, and pull off your shoes, then place your feet down on the cold, sticky ground. The cold slime oozes between your toes as you sneak forward, moving slowly so that your steps don't make any slurping, sticky noises in the goo. The stench of the beast becomes more rank as you sneak between its legs, and your nose is assaulted by the mossy, sweaty stink of the unwashed monster.</p>Finally, you are within inches of its huge cock. You reach down, carefully pressing your hands against the leaking, slippery faucet of its crumpled foreskin, and slide your fingers inside. It's warm and thick within, like dipping your hands into almost-too-hot glue. When you pull your hands back out, they are dripping with thick globs of emerald-green ooze, much thicker and brighter than the clear goop on the floor. You drip it carefully into some potion bottles, and collect as much as you can, before turning back around and sneaking out the way you came.</p>Once you are outside, you wash your hands in the river as best you can. The goop refuses to come off until you scrape your hands with a tree branch, and even then your skin is stained a little green, and the smell follows you all the way back to town. You sell your bottles to a merchant, who gives you a good price so long as you promise to take a bath before returning to him.",
                        "outcomes": [
                            {
                                "parameter": "muscat_1",
                                "quantity": 40,
                                "change": "add"
                            }
                        ]
                    },
                    "fail": { 
                        "text": "You creep in to the den, slowly. The stench gets more unpleasant the deeper you go, and the floor and walls are glistening wetly with layers of slime and filth. Your feet stick to the ground in places, making it difficult to be as quiet as you'd like. There are lumps of trash lying around in mounds, including the crumpled clothes of adventurers. This place is dangerous.</p></p>You don't need to travel far in to reach the troll. It is slumped on the ground near the back of the crude den. It is a huge beast, over ten feet tall, with a gut as wide and round as a boulder. Its green skin is mottled and craggy like mossy rock, but glistens wetly with slime. Gigantic arms end in two-fingered thick hands, similar to the huge humanoid feet it has, with two fat toes, and soles stained black with mud and dirt. Its head it round and hairless, with one enormous closed eye, and a pair of massive curving yellow tusks.</p>It is lying on its back, its feet and arms splayed out as it sleeps. The massive wet belly rises up and down slowly, and between its legs you can see the thick, log-sized mass of its flaccid cock. Its cock droops on the ground, covered by a grey-green foreskin. The tip of it gushes and dribbles a little with clear, slightly greenish slime. The source of the cavern's sticky floor.</p>To get any closer without waking it, you will unfortunately have to remove your footwear. You reach down, and pull off your shoes, then place your feet down on the cold, sticky ground. The cold slime oozes between your toes as you sneak forward, moving slowly so that your steps don't make any slurping, sticky noises in the goo. The stench of the beast becomes more rank as you sneak between its legs, and your nose is assaulted by the mossy, sweaty stink of the unwashed monster.</p>Finally, you are within inches of its huge cock. You reach down, carefully pressing your hands against the leaking, slippery faucet of its crumpled foreskin, and slide your fingers inside. It's warm and thick within, like dipping your hands into almost-too-hot glue.</p>Then, you try to pull your hands back out, so that you can collect the more valuable, thicker slime from within the creature's cock. But try as you might, you can't seem to tug yourself free. You yank harder, but the glue-like fluids inside the troll's sweaty foreskin hold you tight.</p>Your tugging seems to have stirred the beast. You freeze in place as it growls and mumbles. Its huge hand reaches down, and it scratches its balls, sending out a wave of nauseating stench. Then it settles back down, yawning loudly.</p>Its hand continues to move between its legs, until it grips around its fat shaft. Then, it slowly and lazily starts to pump and squeeze its huge cock. You can only stand there, trying not to make a sound as you feel the troll's cockhead bulge and thicken against your hands. Slowly, the massive glistening deep-green dome of its head pushes out from its foreskin, and your hands are freed. You start to pull them off slowly from the surface of the monster's cock, but before you can fully free yourself, you see the troll's cock open up, its slit becoming rounder.</p>You are suddenly deluged in a massive, hose-like spray of hot, rank cum. It forces you off the troll's cock and launches you two feet back, as gushing, splattering loads of jizz spray over every inch of your body. The spray is as messy as it is powerful, hitting the walls and even the ceiling, where it drips down in fat off-white globs.</p>Once the cum subsides, the troll starts to snore once more. You pull yourself up off the ground, and crawl slowly outside, with troll ejaculate dripping from your body in a messy  trail onto the floor. Dunking yourself into the river does little to abate the utterly repulsive, humid stench of unwashed sex that is soaked into you.</p>You try to collect up some of the goop for sale, but when you return to town later, you are banned from every ingredient shop due to your repellant stench. By the time you wash it off, the cum you collected has cooled and become worthless.",
                        "outcomes": [{
                            "parameter": "outcast",
                            "quantity": 2,
                            "change": "add"
                        }]
                    }
                }
            },{
                "id": "doom2",
                "title": "Doom Again",
                "subtitle": "You notice a familiar face, sitting up against a burned-out mound that might once have been a wall. It's the muscular, shirtless lizard warrior you met at the riverbank.</p></p>His face is pale, and strained. Sweat is dripping down his chest as he wheezes and clutches at his ankle.",
                "type": "random",
                "requirements": [
                    {
                        "parameter": "doom_connection",
                        "value": 0,
                        "comparison": "greater" 
                    }
                ],
                "icon": "doomb",
                "results": {
                    "thing": {
                        "html": "data/active/Doom2.html",
                        "outcomes": [
                            
                        ]
                    }
                }
            }
        ],
        "npcs": [
            
        ]
    }