{
    "title":"titansplinter",
    "header":"Titan's Enslavement",
    "position":[
       0.55,
       0.02
    ],
    "mapId":"worldmap.jpg",
    "subheader":"Titan's mind is confused and overpowered by the mythical power of his ancient ancestor. (All content here is contributed by Meek and is only loosely canonical)",
    "events":[
       {
          "id":"trainanal",
          "title":"Train Titan: Anal",
          "subtitle":"Titan’s eyes swirl as you activate the White Splinter. He doesn’t resist you at all.",
          "type":"random",
          "requirements":[
             {
                "parameter":"titan_training",
                "value":0,
                "comparison":"equal"
             }
          ],
          "icon":"titan_b",
          "results":{
             "pumpkin_1":{
                "text":"You peel Titan’s clothes off, even his white undies. He’s a fat boy, with almond-colored fur. His dick is uncut, throbbing erect at 4 inches. Even hard, the foreskin covers the head. Combined with a hefty ballsack to make it look smaller, you can’t help feeling this cock is extremely cute. You think it’s masculine. Titan thanks you when you say so.</p></p>His bare feet are the most notable part of him, though. Unlike most boars, he doesn’t have trotters. Both of you have the same royal boar feet, with wide squishy soles and wriggling toes. Titan is normally so scared of showing them he shakes. Here, he’s relaxed. Open. Available.</p></p>Inexperienced. You decide it’s time to give him some lessons.</p></p></p>You’re excited to teach Titan about anal. You ask him if he’s ever put anything in his butt. “No, daddy.” His voice is light and hollow, like his mind is currently--a cup waiting to be filled. When you order him to turn around, you test what you’re working with.</p></p>Being a baker, it only makes sense Titan has cake for days. His asscheeks are globular and heavy. Yes, heavy. Each cheek is packed with so much fat and muscle it takes a bit of effort to lift and part them, and they’re both bigger than your head. When you spread Titan’s ass, the smell of his musky crack is intoxicating. The stink makes your eyes roll upwards as you press your heart-shaped boar nose as close to his asshole as possible.</p></p>While you huff his ass, Titan stands obediently still. Empty-minded. You love the smell of this boy’s ass. It’s strong and betrays his pig-like nature by being so dirty, musky, and savory. Not to say Titan’s ass is dirty, thankfully--he keeps himself clean, but it’s an unwashed virgin hole.</p></p>You’re gonna fix that and loosen his tight pucker while you do it. “Titan,” you say, standing up. “You need an enema. Do you know what that is?”</p></p>Even hypnotized, Titan blushes. “Yes, daddy.” You tell him there’s nothing to be embarrassed about. You take him to his bathroom and show him how to do it, step-by-step, so he can clean himself out. </p></p>Temperate water, not too much pressure, don’t use too much at a time. Fill yourself, hold it in, sit on the toilet, release. Repeat until the water runs clear. DON’T use soap. Relax.</p></p>You give Titan some privacy to follow orders and wait in the cottage living room. He comes out about half an hour later, wobbling. You ask if he’s clean. “Yes daddy,” he says, hands at his sides. You ask him how it felt. “Full, daddy. Empty now.” </p></p>Good boy. You give him a kiss on the nose and inspect the results. Titan’s ass is dripping wet with soaked fur. The musky smell is mostly gone, but upon spreading his ass, Titan’s hole has relaxed. It’s still a tight pucker. But a workable one.</p></p>“Such a good boy,” you heap praise on the boar. This is all foreign to Titan, so you make sure to positively affirm every correct step. However, you do feel like equally affirming you’re in charge here. “Bend over and spread your ass wide.” Titan obeys. “You are stiff. Stable. Mindless. Repeat.”</p></p>“I am stiff... Stable... Mindless.” Titan says blankly. You tell him not to move. A statue with its ass spread like a whore. Does he hear and obey? “I hear and obey,” Titan repeats.</p></p>You nudge Titan’s arm, and his entire body moves. He’s frozen in position. He wouldn’t stop himself from smashing his face on the floor if you tipped him too far. But you had a purpose for all this.</p></p>First, you grab a bottle of lube. You place it on Titan’s back. Next is a plug and dildo. You balance all three on Titan like a table. He says nothing, probably because he’s thinking nothing. “Relax your hole, my obedient statue.” </p></p>You watch his butthole untense and grin. This is cheating, but the brainwashing helps this process go faster. Mind over body. His butthole is the same brown color as his fur, but lighter. You swirl your index finger around the ring, feeling how taut it is. Unfortunately, still too tight to play with. With a hefty dose of lube on that same finger, you begin massaging his butthole.</p></p>If you expected Titan to react, he doesn’t. His breathing remains steady and he doesn’t shake. Your lube-coated finger drives itself into his ass and continues rubbing. The anal ring is the most important thing to coax so he doesn’t get hurt. The effort pays off after ten minutes. You’ve made his shining-with-lube hole pliable. It stretches easily around one finger, then two.</p></p>More lube. Even experienced partners can always use more lube. It’s hot to watch the thick liquid squirt over his ass, especially seeing it inside his hole. The whole time, you’re checking in on Titan. “I feel good, daddy.” He says every time you ask. Good. All of this has been fun, but next is the main event.</p></p>You smear lube on the dildo and position it against Titan’s ass. “I’m going to put it in. Not all the way.” His hole takes the head of the sex toy, wrapping around it tight. Looking good. Just the head, in and out. Titan keeps his fat cheeks spread while you work it. The bottle of lube and the plugs are still balanced on his back.</p></p>The dildo fucks Titan, gradually getting deeper, but you stop about halfway in. He can’t take any deeper than that. “How’s it feel, boy?” You grunt.</p></p>“Good, daddy...” Titan breathes, betraying unstoppable lust. His voice and his faucet of a cock tells you this is going well. You haven’t found his prostate yet, but he’s loving it. After a bit, you put the dildo away and insert your thick boar digits. </p></p>“There’s a magic button in here,” you tell him. “It’s going to feel amazing. When that happens... Cum.” You swivel your fingers around inside his asshole until you find a firm, round organ inside. For the first time, Titan shivers despite the hypnotic power.</p></p>“Y-yes... Daddy...”</p></p>“No touching yourself.” You begin stroking Titan’s ‘magic button’ in small circles. “And be loud. Don’t hold back!” Titan’s eyes instantly begin welling with tears. Not from pain, but raw emotion. He’s overwhelmed, and with your permission, is expressing a bit of how he’d normally react to the stimulation. You encourage it.</p></p>“FFFFFFFFUHHCCK!” Titan squeals hoarsely. “I LOVE IT, DADDY! I LOVE IT! PLEASE LET ME CUM! LET ME C-CUM!” He sobs, drooling onto the floor. The lube and buttplugs clatter on the floor, but he remains in place. “I NEED IT! SHOVE IT IN ME, PLEASE! PLEASE DADDY! IT DOESN’T HURT, USE ME! ANYTHING! I NEED TO CUM!” </p></p>You laugh, a bit too villainously. The boy needs a reward and you’re gonna give it to him. The hypnotic command is still in place, as evidenced when you press firmly on Titan’s prostate.</p></p>Something between a groan and dry heave comes from Titan as his cock explodes, showering his thighs, legs, feet, and the cottage floor with spunk. His balls and taint flex multiple times as he unloads and doesn’t stop. That thing about how much boars cum must be true, or he’s truly been pent up. Either way his hairy crack and sack squeezes every drop out of his cock, until Titan’s lower half is covered in musky royal boar cum.</p></p>You pull your fingers out. His hole doesn’t gape much, but it’s a start. You release Titan from this statue pose and his legs buckle. He collapses in the puddle of his warm cum, grinning, tongue out, eyes lolled. He’s lost to the world and ass-up.</p></p>You’re nearly done. With another generous helping of lube, you grab one of the thicker buttplugs. You wouldn’t normally start with this one, but... Titan has been a great student. You twist the plug into his hole, making his legs twitch.</p></p>You tell him to keep this in his butt 24/7. The only time it comes out is for using the bathroom... Or training his asshole with that dildo, which he will now do regularly. “Yes... Daddy...” He moans.",
                "outcomes":[
                   {
                      "parameter":"titan_training",
                      "quantity":1,
                      "change":"set"
                   }
                ]
             }
          }
       },
       {
          "id":"trainoral",
          "title":"Train Titan: Oral",
          "subtitle":"Titan’s eyes swirl as you activate the White Splinter. He doesn’t resist you at all.",
          "type":"random",
          "requirements":[
             {
                "parameter":"titan_training",
                "value":1,
                "comparison":"equal"
             }
          ],
          "icon":"titan_b",
          "results":{
             "pumpkin_1":{
                "text":"You peel Titan’s clothes off, even his white undies. He’s a fat boy, with almond-colored fur. His dick is uncut, throbbing erect at 4 inches. Even hard, the foreskin covers the head. Combined with a hefty ballsack to make it look smaller, you can’t help feeling this cock is extremely cute. You think it’s masculine. Titan thanks you when you say so.</p></p>His bare feet are the most notable part of him, though. Unlike most boars, he doesn’t have trotters. Both of you have the same royal boar feet, with wide squishy soles and wriggling toes. Titan is normally so scared of showing them he shakes. Here, he’s relaxed. Open. Available.</p></p>Inexperienced. You decide it’s time to give him some lessons.</p></p>Stroking the hypnotized baker boar’s chin, you coax him to his knees. He kneels on the cottage floor, staring ahead placidly. Titan has an uncompromising gag reflex that’ll take some time to fix. While tempting to choke him with your dick until he passes out, Titan is your friend. With that White Splinter, you’re acting on the honor of King Gareth himself! It wouldn’t do to be unruly. Yet.</p></p>You pull out a dildo, about the width of three fingers and a foot long. “Titan.” You attach it to the wall, so it hangs in front of the boar’s face. “Shove the dildo in your mouth.”</p></p>Titan, even completely mesmerized by the White Splinter’s spell, gulps audibly. “Yes daddy,” he intones, before leaning into the rubbery sex toy. He opens his mouth and tastes it before diving deeper, moving the head of the cock past his tusks. </p></p>You bought a dildo that’s flexible, making it easier for a beginning like Titan. A thread of drool pours from his bottom lip down near his twitching piggy dick. Titan is eager but pushing too hard. “Relax,” you order and place your hand on the back of his head. “Take it slow. The goal isn’t to get it as deep as possible. That comes with experience.” </p></p>Titan exhales through his snout. He’s gripping the fur on his thighs, but untenses at your direction. You continue to give him basic advice on blowjobs. He laps at the underside of the rubber. There are tears in his eyes, but he’s obviously enjoying it. After a few minutes of coaxing and getting him comfortable, Titan forces his mouth down to the base of the toy.</p></p>He gags and tries to pull off, but you hold him in place. “That’s good. Daddy’s proud of you.” Keeping your hand on the back of his head, you start pushing him to the base. “Through the nose. Relax that throat.” Titan’s no longer tonguing the sex toy, he’s enduring. With your guidance he bobs up and down on the rubbery cock. By this point, there’s a whole puddle of drool on his lap. </p></p>The foreskin of his dick is shining with musky precum. You resist tasting it, but his whole body is sweating with the same smell. It’s like when Titan is at the stovetop. Stronger, though. Raw and overworked.</p></p>Satisfied with Titan’s progress orally, you release him from the rubber dildo. His fat chest is heaving, but he smiles very genuinely when you tell him how good he’s doing. “Thank you... Daddy...” He breathes, a line of spit connecting his mouth to the dildo.</p></p>The training lasts for an hour, testing the limits of Titan’s jaw and throat. You don’t want to push him too far but he’s a very good student. You teach him how a good blowjob is about endurance and variety. When your jaw gets tired, pull off and lick. Tongue the shaft, balls, and head. Deepthroating isn’t the end-all-be-all for a great blowjob. Work on suction.</p></p>Titan absorbs the information and does a good job acknowledging commands. The sound of gagging is sexy, but the steady squelch of his tightening throat is equally so. He’s not professional, but by the time he’s ordered to finish, he’s already better at working it. His head and shoulders gyrate mechanically with the rubber cock in his mouth.</p></p>You tell him to train with this on his own time. Regularly. “Yes daddy!” His cock throbs.",
                "outcomes":[
                   {
                      "parameter":"titan_training",
                      "quantity":2,
                      "change":"set"
                   }
                ]
             }
          }
       },
       {
          "id":"useoral",
          "title":"Train Titan: Oral",
          "subtitle":"Titan’s eyes swirl as you activate the White Splinter. He doesn’t resist you at all.",
          "type":"random",
          "requirements":[
             {
                "parameter":"titan_training",
                "value":1,
                "comparison":"greater"
             }
          ],
          "icon":"titan_b",
          "results":{
             "pumpkin_1":{
                "text":"You peel Titan’s clothes off, even his white undies. He’s a fat boy, with almond-colored fur. His dick is uncut, throbbing erect at 4 inches. Even hard, the foreskin covers the head. Combined with a hefty ballsack to make it look smaller, you can’t help feeling this cock is extremely cute. You think it’s masculine. Titan thanks you when you say so.</p></p>His bare feet are the most notable part of him, though. Unlike most boars, he doesn’t have trotters. Both of you have the same royal boar feet, with wide squishy soles and wriggling toes. Titan is normally so scared of showing them he shakes. Here, he’s relaxed. Open. Available.</p></p>Inexperienced. You decide it’s time to give him some lessons.</p></p>You decide to inspect Titan’s progress with oral sex. “Suck it,” you toss him a fat dildo.</p></p>“Yes daddy,” he says dutifully as ever before opening his mouth wide. Holding the rubber cock in one hand, he pushes it deep in. You are immediately impressed with how far Titan goes before gagging on the shaft. He coughs through his nose but resists choking.</p></p>It’s slow, but soon Titan’s scruffy chin is touching the base of the toy. Titan tongues and slides back and forth, forcing himself deep. You wonder if his throat’s getting wider. “Good boy,” you tell him. “Shove it in and hold it.”</p></p>Titan obeys, keeping the toy as deep as possible. It must be halfway down his gullet. The wide base is at his lips. That gives you an idea.</p></p>You leave the hypnotized boar for a moment to retrieve a roll of duct tape. Without warning Titan, you rip a few pieces across Titan’s face. The dildo is still inside his mouth. “Keep the tape on as long as you can take it,” you tell him. Titan’s cock is throbbing as you leave him like that.",
                "outcomes":[
                   
                ]
             }
          }
       },
       {
          "id":"useanal",
          "title":"Train Titan: Anal",
          "subtitle":"Titan’s eyes swirl as you activate the White Splinter. He doesn’t resist you at all.",
          "type":"random",
          "requirements":[
             {
                "parameter":"titan_training",
                "value":1,
                "comparison":"greater"
             }
          ],
          "icon":"titan_b",
          "results":{
             "pumpkin_1":{
                "text":"You peel Titan’s clothes off, even his white undies. He’s a fat boy, with almond-colored fur. His dick is uncut, throbbing erect at 4 inches. Even hard, the foreskin covers the head. Combined with a hefty ballsack to make it look smaller, you can’t help feeling this cock is extremely cute. You think it’s masculine. Titan thanks you when you say so.</p></p>His bare feet are the most notable part of him, though. Unlike most boars, he doesn’t have trotters. Both of you have the same royal boar feet, with wide squishy soles and wriggling toes. Titan is normally so scared of showing them he shakes. Here, he’s relaxed. Open. Available.</p></p>Inexperienced. You decide it’s time to give him some lessons.</p></p>You never get tired of seeing Titan’s fat ass, especially when you make him bend over. A perfect pair of balls leading to that hairy taint, and between two enormous cheeks? A buttplug wider than your fist. Titan’s moved up a few sizes since the initial training. He never removes it, and with how loose his hole has become, it shows.</p></p>You’re the daddy though, and you pull it out of his hungry ass with a nice wet slurp. He keeps himself lubed. Titan shakes his ass back and forth, breaking the strands connecting his hole to the plug. It’s still gaping widely. That gives you an idea.</p></p>You generously lube your right arm and form a fist, before pressing your knuckles against Titan’s hole. “Daddy’s gonna give ya a present for workin’ hard,” you say. Titan takes a deep breath. He’s brainwashed, but you warn him what’s coming next. “You wanna try it?”</p></p>Titan nods, and you slowly insert your fist inside inch-by-inch. Your boar hand is thick, so his hole is stuffed just from that. His quivering vibrates up your wrist as he tightens his ass around you. You try pulling deeper, but you can’t manage much more.</p></p>It’s still a great accomplishment, and you pump in and out. Titan’s lost to the world, moaning like a mess. He’d cum if you didn’t stop him. “Yesss... D-daddy...” He’s steaming with sweat. You’re not working too much. Your fist is only inserted up to the wrist as you steadily fuck him with it. His prostate is throbbing against you. It’s bigger than it was the first time you fingered him.</p></p>This lasts only a few minutes. “Cum.” You order, and Titan’s ass constricts around your wrist like a vacuum seal. It’s warm and wet inside this boar. He’s wordlessly cumming all over the wall and floor in a steady stream, twitching and gurgling on his own spit. </p></p>You remove your fist. “Clean up and put your plug back in.” You pause. “A bigger one.”",
                "outcomes":[
                   
                ]
             }
          }
       },
       {
          "id":"fucktitan",
          "title":"Fuck Titan: Oral",
          "subtitle":"You activate the White Splinter and Titan blanks, no longer whatever personality you’ve allowed him. Titan’s gaze is glassy, and his mouth is curled into a dim smile. Since the training he’s been diligent about following your orders. The cottage smells ripe with sex. You see a monstrously wide plug wedged in his ass comfortably. ",
          "type":"random",
          "requirements":[
             {
                "parameter":"titan_training",
                "value":1,
                "comparison":"greater"
             }
          ],
          "icon":"titan_b",
          "results":{
             "pumpkin_1":{
                "text":"You activate the White Splinter and Titan blanks, no longer whatever personality you’ve allowed him. Titan’s gaze is glassy, and his mouth is curled into a dim smile. Since the training he’s been diligent about following your orders. The cottage smells ripe with sex. You see a monstrously wide plug wedged in his ass comfortably. </p></p>His hole is prepared, but what about that pretty mouth? You force him to open wide, wide enough to see down his throat. Those jaw-stretching exercises have done work. It reminds you of the various voracious predators throughout the land, but the only thing Titan’ll be eating is you.</p></p>He’s been a good boy. “Titan,” you say, pointing to the floor. “On your knees for daddy.” Instantly, the young man obeys. His snout is inches from your bulge. You rub it in his face, marking him with musk. “You like the way daddy smells?”</p></p>“Yes, daddy.” Titan says. You give him permission to rub his face into your crotch and he does so, breathing deeply. </p></p>“You wanna taste daddy’s cock?” You grunt, and Titan moans that yes, yes he does. “Beg for it.”</p></p>Titan whimpers. “Pleaaaaase daddy, I’ve been so good... I bet your cum is really tasty... I can’t help it,” he says, putting on a show grabbing himself. “Anything, daddy! I need your dick! Please! I wanna get fat off your cum, please... I love you, daddy... And daddy’s dick...”</p></p>You’re not sure how good he is at dirty talk, but the boy’s trying and that gets you hard enough. He’s not wrong, either. He has been a quick study. “Alright, boy.” You pull out your fat cock, and the smell of your own boar balls hits your nose. Titan’s getting a faceful of it. He gasps at the sight. “Worship.”</p></p>Eager to prove himself, Titan obeys. You feel his warm breath against your erection and his wet pig nose, followed by a wet tongue. He starts by lapping your shaft and head. You lean back and watch. “Mmm, yeah,” you say huskily. “Give daddy that brain.” You mean that in multiple ways and Titan’s doing both.</p></p>As he starts sucking your cock, you get impatient and force him all the way down. Titan doesn’t gag. “Stay. I wanna feel that nose in my pubes, boy...” Titan’s swirling half-lidded eyes betray nothing but obedience as he does just that. His mouth is warm and soft, it makes you melt. His tongue keeps playing with your meat in his mouth when its not trying to suck the soul from your body.</p></p>He sucks, and sucks, and tongues at your shaft. Practicing everything he learned. He’s become an expert slut. You’re not gonna last long.</p></p>You hump lazily into his mouth, trying to make him choke on your dick. After a minute or two the pleasure gets so high you grab Titan by the tusks and mash his face into your belly. You pull forward until Titan is underneath you on the floor, and gravity helps ram your dick deeper. Between your dick and fat fuzzy body on top of his face, he might have a hard time breathing, but you’re too love-drunk to care.</p></p>If its uncomfortable, Titan doesn’t signal it. You’re pounding his pretty mouth like he owes you money. The sound of your balls slapping his chin and the constant choking glurk noises bring you over the edge. With a roar, you cum down his throat.</p></p>You cum until your balls are drained, and only then do you flip over to release Titan. His face is red and slick with drool, but he stares at the ceiling blankly. His expression is doll-like. You note there’s no cum, and you came a lot. He swallowed every drop. “Everything you dream of, boy?”</p></p>“Yes daddy,” Titan says obediently.",
                "outcomes":[
                   
                ]
             }
          }
       },
       {
          "id":"fucktitana",
          "title":"Fuck Titan: Anal",
          "subtitle":"You activate the White Splinter and Titan blanks, no longer whatever personality you’ve allowed him. Titan’s gaze is glassy, and his mouth is curled into a dim smile. Since the training he’s been diligent about following your orders. The cottage smells ripe with sex. You see a monstrously wide plug wedged in his ass comfortably. ",
          "type":"random",
          "requirements":[
             {
                "parameter":"titan_training",
                "value":1,
                "comparison":"greater"
             }
          ],
          "icon":"titan_b",
          "results":{
             "pumpkin_1":{
                "text":"His hole is prepared, but what about that pretty mouth? You force him to open wide, wide enough to see down his throat. Those jaw-stretching exercises have done work. It reminds you of the various voracious predators throughout the land, but the only thing Titan’ll be eating is you.</p></p>You need that ass, NOW. With a saunter, you recline in a chair, legs spread. “Give your daddy a lap dance, you fuckin’ whore.” You pat your thigh for emphasis, noting your ragingly erect cock straining your pants.</p></p>Titan giggles empty-headedly. “Of course, daddy.” With seductive steps, Titan walks to you. You make him strip, leaving only his fat buttplug. He straddles your lap and grinds, making your bellies push against each other. You’re both fat royal boars. You’d be praying the chair doesn’t break from your weight, but you’re distracted. Titan tongues at your ear and strokes your chest and shoulders, telling you how big and strong you are. You feel his fupa and cock press against your belly button. With how he’s rubbing against you, it feels like he’s about to shove his cock inside your gut.</p></p>Your cock is where the danger lies. His fat taint is holding it between his cheeks as he works. Your cock is being jerked by his ass and that pliable rubber sex toy in his butt. “Turn around,” you say. Titan hops off and obeys, raising his ass until his tail’s flagging in the air. You grab the buttplug with three fingers and twist it, making Titan squirm. When you pull it out, you inspect his hole.</p></p>It’s not the pucker it used to be. After so much training and use, Titan’s ass is a delicious-looking donut, gaping constantly. You thought of Titan eating others before--this hole would be equally dangerous, for that. It would be more than capable.</p></p>Titan flexes his lubed donut asshole to get your attention. He shakes his ass back and forth before pressing that boar butt against your cock and balls, threatening to swallow them inside. “Daddy...” Titan says in a sing-song.</p></p>You didn’t give him permission to do that. It feels good, but... He knows as well as you there’s a punishment, but Titan wants it. Well, why disappoint. </p></p>You slam an open palm against one of Titan’s giant ass cheeks, watching it turn pink. “Naughty boy,” you admonish him. “Ten spanks.” Titan whines, but you don’t let him speak. He gets another swat on the ass, then two on the other cheek. He yelps for each one. </p></p>“D-daddy!” He says, tears starting to form in his eyes. He looks embarrassed, but you spank him again. He winces. Now his ass is sensitive, making it hurt just a bit more.</p></p>“Count with daddy,” you say with a mischievous grin of your own. “One.” And you spank him again.</p></p>Titan resists protesting the obvious fact that you’ve already given him more than that. “O-one...” he puts his head down. Another slap. You say two, and Titan breathes harshly through his nose. “Two...” </p></p>Three. Four. Five. Six. Seven. Each time, Titan breaks down a bit more. You’re not using a paddle. He’s not in enough pain to sob. But this’ll sting. Teach him a lesson. His cock looks like it’s gonna burst at any moment, but he wouldn’t cum without your say-so. Not unless he wanted something much worse than this. “E-eight...” Titan whispers after you say it. His ass is pink like a cooked ham. “Nine...” Nine. </p></p>You raise your arm back and deliver the final slap, making Titan’s knees buckle. “TEN!” He squeals, falling face-first into the floor. What an angle. His thick asshole is pulsating between two reddened cheeks. There’s only one thing to do.</p></p>Taking advantage of Titan’s downed state, you stand up to line your desperate cock against that lord-class butthole. “Good boy,” You tell him. “Taking your lumps. Daddy’ll treat you for that.” There’s no prep-work needed with an ass like this. His hole is wet and self-lubricating with ass juice and being worked by that buttplug. You shove your cock inside.</p></p>It feels amazing. It’s like velvet, its so soft and pliable. Immediately you rut in his hole and start humping his abused ass. “Daddy...” Titan pants, rolling his hips against you. There’s no build-up or foreplay. This ass is getting fucked. Your cock is long and thick, but it’s only a third the width of that plug. Something about such a gaping hole, kissing your thighs and crotch while you fuck it senseless... Well, it’s not long before you blast a load.</p></p>Gripping the fuzz on his ass to drive yourself deeper, you push into Titan’s ass and cum hard. His hole milks you for every drop. You cum so deep, when you pop your cock out of his hole, it doesn’t dribble out. You wonder if there’s some magic in that set of plugs you gifted the boar. “Good boy,” you say. “Now go get daddy a drink.”</p></p>Titan stands up stiffly, like a puppet being lifted on strings. His face is placid. “Yes, daddy!” He says lightly. It’s only when he walks towards the kitchen that you see your cum start to leak from his butt. ",
                "outcomes":[
                   
                ]
             }
          }
       }
    ],
    "npcs":[
       
    ]
 }