{
    "title":"under_graveyard",
    "header":"Beneath the Graveyard",
    "nomap":"You are on the hunt, and have no time to delay.",
    "subheader":"You are deep below one of the old crypts next to Dormaus Village Church. The passageway crumbled centuries ago, and now is a precarious abyss that threatens to plunge you down to your death at any moment.",
    "events":[
       {
          "id":"deeper",
          "title":"Climb Deeper",
          "subtitle":"The ruined walls still have the remains of stone brickwork, and this climb should be no harder than what you have experienced many times in the forbidden caves.",
          "type":"statcheck",
          "stat":"stealth",
          "difficulty":20,
          "requirements":[
             {
                "parameter":"priest_quest",
                "value":1,
                "comparison":"equal"
             }
          ],
          "icon":"default",
          "results":{
             "success":{
                "text":"You start making your way down the rope, being careful to brace yourself against the walls. There are alcoves in the crumbling stone, the empty remains of what were likely to once have been burial chambers. Though it is a little creepy, you use them as rudimentary steps, and keep a firm grip on your rope.</p>With how dark it is down here, what you are not expecting is plantlife. You step down a little further, and feel the rustling and crinkling of leaves. Something slides up your leg, squeezing you like a cold slippery tendril. You look down in shock to see a cluster of strange flowers with deep black leaves, and long snakelike vines. The vines continue to crawl up your leg, getting warmer and more sensual as they stroke along your thigh, and then over your crotch. You feel the small thin tendrils slide and touch over every inch of your genitals, feeling out your skin and sending throbs of pleasure through you. When one of them slides up against your rear, and shoves its way inside, you gasp out in shock, and almost lose your grip on the rope. </p>Fortunately, you have had enough experience in this bizarre world that getting anally fucked by a plant isn't really all that shocking. You continue climbing, ignoring the plant as it throbs and pushes its way into you. It slides more tendrils lovingly around your waist, but you keep a grip on the rope with one hand and shove them off with the other. Apparently disappointed, the plant recedes and curls up in its alcove. You manage to make the rest of the climb unscathed, and soon reach the bottom.",
                "outcomes":[
                   {
                      "parameter":"priest_quest",
                      "quantity":2,
                      "change":"set"
                   }
                ]
             },
             "fail":{
                "text":"You start making your way down the rope, being careful to brace yourself against the walls. There are alcoves in the crumbling stone, the empty remains of what were likely to once have been burial chambers. Though it is a little creepy, you use them as rudimentary steps, and keep a firm grip on your rope.</p>With how dark it is down here, what you are not expecting is plantlife. You step down a little further, and feel the rustling and crinkling of leaves. Something slides up your leg, squeezing you like a cold slippery tendril. You look down in shock to see a cluster of strange flowers with deep black leaves, and long snakelike vines. The vines continue to crawl up your leg, getting warmer and more sensual as they stroke along your thigh, and then over your crotch. You feel the small thin tendrils slide and touch over every inch of your genitals, feeling out your skin and sending throbs of pleasure through you. When one of them slides up against your rear, and shoves its way inside, you gasp out in shock, and lose your grip on the rope.</p>You slip, and fall, the tendril receding as you plummet into the darkness. You fear this may be the end of you, but something strange happens. There is a loud roar, and a crashing sound, and something rams into you mid-air. You feel an enormous jaw close over you, with teeth as large as daggers and a tongue the size of your entire torso. Despite its size, it holds you with great care, not even piercing the skin. The creature lands against one wall, and then leaps down to another, zig-zagging across the pit until it lands safely on the ground. You are deposited on the floor, and you hear a strange, crunching twisting sound. Bonacieux's torch lights up with a whoosh of air, and you look over to see no sign of a massive beast. Instead, he is just buttoning up his armour, which had burst open. \"I lost my supplies in the fall, I'm afraid. We will have to take greater caution as we proceed.\"",
                "outcomes":[
                   {
                      "parameter":"priest_quest",
                      "quantity":2,
                      "change":"set"
                   },
                   {
                      "parameter":"b_supplies",
                      "quantity":1,
                      "change":"sub"
                   }
                ]
             }
          }
       },
       {
          "id":"deeper_yet",
          "title":"A Disturbing Passageway",
          "subtitle":"As you reach the bottom of this hole, you at first think there is no path onwards. You clamber down and look around carefully. The walls are covered in crumbling stone, that has fallen from above and blocked all further access. All except one tight, cramped passage where two large stone plates have landed against eachother like dominos. Within the passage, you see you would have to crawl over the rusty armour of some long-dead soldier.",
          "type":"statcheck",
          "stat":"charm",
          "difficulty":20,
          "requirements":[
             {
                "parameter":"priest_quest",
                "value":2,
                "comparison":"equal"
             }
          ],
          "icon":"default",
          "results":{
             "success":{
                "text":"You carefully inspect the armour. It has fallen from somewhere in the collapsed tunnel, and appears as if it was once very expensive. The corroded metal still has traces of gold filigree on it, and is shaped in a way that suggests what may once have been decorative embellishments. Fortunately, there's no body inside.</p>You squeeze into the small crevice and begin the uncomfortable crawl across the broken stonework to the passageway beyond. You do not notice strange black tendril inside the armour until it's too late. You feel the metal clank and shift, and you twist and desperately push yourself away, but too late. The breastplate is forced over your chest, and the rusty helmet slides over your head. Your vision swims and you feel dizzy. You hear Bonacieux's concerned voice as you seem to slip away into a dream.</p></p>You awaken with a snort. Your head is aching like crazy. You must have drank too much with the other guards again. You're getting too old to keep doing that. You reach up, and massage your wide chubby jowls with your thick furry hoof-hand. For a brief moment, you think something looks off about it, but you put that down to just an effect of your hangover. You heave yourself up, your huge furry brown gut hanging below you, as you wander over to the mirror in the guard tower.</p>You look the same as usual. Bit older, maybe. A heavy, stocky brown boar, with a wide pink snout, and grey streaks in your thick bristly fur. You scratch your chin and yawn, showing off your huge tusks. You fish around for your helmet, and pull it on over your head. You quite like how your tusks nicely curve out around the frame of the helmet. Keeps all the new recruits in their place being able to see what a big powerful man their sergeant is. You turn, and look out through the arrow-slit window in the side of the stone tower. Dormaus is bustling along as always, across the hills and past the river. The kingdom is growing so fast these days. New cottages are sprouting up faster than weeds. The king expanded the castle twice in two decades, when it hadn't changed for hundreds of years before that.</p>You are distracted by a knocking on your door. You snort with annoyance, and stomp over to open it up. Standing beyond is a very nervous young fox. He's dressed in the blue and white striped tunic that all new recruits get before they've shown they can be trusted with armor. \"Private, you better have a damn good reason for bothering me before the sun is even up\", you growl at him. He gulps and hops from one foot to the other. His feet are bare, and dirty. Probably used to be a farmboy before joining the guard. You can tell by his thin, but toned arms and that slender underfed body that barely fits the tunic. Your cock shifts a little in your pants, and you adjust it with your hoofed hand. He definitely notices. \"I, um, sir, I was told it was, um, that I have to clean the sergeant's room, er, sir\", he stammers.</p>You grin. There's no such requirement. Someone is hazing the lad, hoping you'll give him a tongue-lashing and a clip around the ear. You have something else in mind though. \"I got something you can clean, boy\", you say. You grab his arm and pull him inside, then lock the door. He stumbles on the mess of clothes you've left on the floor, but when he looks at your grin, he starts to blush. He reaches down to the buttons on his tunic, waiting for your permission, and you give him a nod. He unbuttons, and pulls it off, revealing his thin, furry chest. Then he pushes down his pants to show off his erect, throbbing cock, rising up from the pale fur of his crotch. Maybe he wasn't sent up here after all. Looks like someone has been hoping to serve the sergeant.</p>You push him over to the bed, and reach down into your pants, pulling out your thick, musky boar cock. He rolls over, and lifts his rear, his huge fluffy brush tail wagging and moving. You grip his slender sides with your rough trotter hands, and press your cockhead to his hole. He shakes a little, and whines. \"Sergeant Phil, p-please breed me!\", he whimpers.</p></p>You grunt. Something isn't right. You so badly want to fuck this needy little bitch's hole. But...that isn't your name. This...isn't your body! You back away, and he turns with surprise. \"Sergeant?\", he says. You faintly hear an echoing voice. Bonacieux. He's shouting you. You growl, and slide your hand down your fat, furry body. Feeling, your eyes closed. Past your fat gut, your thick legs. There! A slimy, ghostly little tendril. You squeeze and rip it free, then toss it away.</p></p>When you open your eyes, you're back in the catacombs. Back in your body. You crawl through quickly, and look around. What the fuck was that?  Bonacieux follows shortly behind you, a look of concern on his face.",
                "area":"catacombs",
                "outcomes":[
                   
                ]
             },
             "fail":{
                "text":"You carefully inspect the armour. It has fallen from somewhere in the collapsed tunnel, and appears as if it was once very expensive. The corroded metal still has traces of gold filigree on it, and is shaped in a way that suggests what may once have been decorative embellishments. Fortunately, there's no body inside.</p>You squeeze into the small crevice and begin the uncomfortable crawl across the broken stonework to the passageway beyond. You do not notice strange black tendril inside the armour until it's too late. You feel the metal clank and shift, and you twist and desperately push yourself away, but too late. The breastplate is forced over your chest, and the rusty helmet slides over your head. Your vision swims and you feel dizzy. You hear Bonacieux's concerned voice as you seem to slip away into a dream.</p></p>You awaken with a snort. Your head is aching like crazy. You must have drank too much with the other guards again. You're getting too old to keep doing that. You reach up, and massage your wide chubby jowls with your thick furry hoof-hand. For a brief moment, you think something looks off about it, but you put that down to just an effect of your hangover. You heave yourself up, your huge furry brown gut hanging below you, as you wander over to the mirror in the guard tower.</p>You look the same as usual. Bit older, maybe. A heavy, stocky brown boar, with a wide pink snout, and grey streaks in your thick bristly fur. You scratch your chin and yawn, showing off your huge tusks. You fish around for your helmet, and pull it on over your head. You quite like how your tusks nicely curve out around the frame of the helmet. Keeps all the new recruits in their place being able to see what a big powerful man their sergeant is. You turn, and look out through the arrow-slit window in the side of the stone tower. Dormaus is bustling along as always, across the hills and past the river. The kingdom is growing so fast these days. New cottages are sprouting up faster than weeds. The king expanded the castle twice in two decades, when it hadn't changed for hundreds of years before that.</p>You are distracted by a knocking on your door. You snort with annoyance, and stomp over to open it up. Standing beyond is a very nervous young fox. He's dressed in the blue and white striped tunic that all new recruits get before they've shown they can be trusted with armor. \"Private, you better have a damn good reason for bothering me before the sun is even up\", you growl at him. He gulps and hops from one foot to the other. His feet are bare, and dirty. Probably used to be a farmboy before joining the guard. You can tell by his thin, but toned arms and that slender underfed body that barely fits the tunic. Your cock shifts a little in your pants, and you adjust it with your hoofed hand. He definitely notices. \"I, um, sir, I was told it was, um, that I have to clean the sergeant's room, er, sir\", he stammers.</p>You grin. There's no such requirement. Someone is hazing the lad, hoping you'll give him a tongue-lashing and a clip around the ear. You have something else in mind though. \"I got something you can clean, boy\", you say. You grab his arm and pull him inside, then lock the door. He stumbles on the mess of clothes you've left on the floor, but when he looks at your grin, he starts to blush. He reaches down to the buttons on his tunic, waiting for your permission, and you give him a nod. He unbuttons, and pulls it off, revealing his thin, furry chest. Then he pushes down his pants to show off his erect, throbbing cock, rising up from the pale fur of his crotch. Maybe he wasn't sent up here after all. Looks like someone has been hoping to serve the sergeant.</p>You push him over to the bed, and reach down into your pants, pulling out your thick, musky boar cock. He rolls over, and lifts his rear, his huge fluffy brush tail wagging and moving. You grip his slender sides with your rough trotter hands, and press your cockhead to his hole. He shakes a little, and whines. \"Sergeant Phil, p-please breed me!\", he whimpers.</p></p>You grunt and chuckle. Hell yeah you're going to breed him! Something faintly in the back of your head tells you that something is wrong, but you ignore it. You are Sergeant Phil, the big horny boar. Don't overthink it. You ram your cock forward, feeling it stretch the fox's tight hole. Damn, but this guy might even be a virgin! You push in deeper, as his hot little ass wiggles and pushes against you. Your thick cock feels amazing penetrating inside him, and his little whines and whimpers of needy pleasure make you feel like a big, tough man. Your huge musky bear balls slap against his ass as you fuck him faster and harder. Can't go easy on the recruits after all.</p>Someone seems to be calling your name outside. You ignore it. What an annoyance. You're trying to have fun here! You block out the sound, and stroke your rough hands down the fox's slender back. You lean forward, and breathe your thick, smoky breath against his neck. He shivers and blushes more, his own cock leaking pre all over your bed. Finally, you grunt, and snarl as you feel your fat cock pulse inside him, and unload thick, hot loads of boar batter deep into his little slut ass.</p></p>You are sinking deeper into your pleasure, loving the warm musky rush of your usual hour-long boar orgasm flooding over you, when you feel an annoying stinging sensation in your cheeks. You growl, and shake your head, before blearily opening them. There is a grey wolf standing over you, with magical implements scattered all around him. In his hand, he's holding some sort of weird black worm. It glows and sizzles as he disintegrates it. \"Are you alright? You seemed to pass out, and you've been muttering something in your sleep\", he says. You blink with confusion.  Bonacieux. The old wolf is  Bonacieux. You...are not Sergeant Phil. But some of him has remained on you. You look down to see that your belly is bulging and rounder than it was before, and your voice feels a little deeper and rougher. Clearly you're going to have to be more careful down here.",
                "area":"catacombs",
                "outcomes":[
                   {
                      "parameter":"b_supplies",
                      "quantity":1,
                      "change":"sub"
                   }
                ]
             }
          }
       }
    ],
    "npcs":[
       
    ]
 }